{
  "query": "apple AAPL",
  "start_date": "01-01-2025",
  "end_date": "10-01-2025",
  "backward_start_date": "18-12-2024",
  "backward_end_date": "31-12-2024",
  "fetch_timestamp": "2025-11-29 22:30:40",
  "article_count": 28,
  "articles": [
    {
      "url": "https://www.fool.com/investing/2024/12/31/apples-stock-has-reached-historic-levels-in-one-me/?source=iedfolrf0000001",
      "url_mobile": "",
      "title": "Apple Stock Has Reached Historic Levels in One Metric . It a Clear Warning Sign for 2025 . ",
      "seendate": "20241231T133000Z",
      "socialimage": "https://g.foolcdn.com/editorial/images/801516/person-giving-a-thumbs-down-to-a-computer-screen.jpg",
      "domain": "fool.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": null,
      "recency_weight": 1.0,
      "content": "Watching companies set individual records on revenue or earnings is always a great sign for investors, as it indicates the company is reaching new heights. However, there are also some metrics you don't want to see companies setting new records in, like debt or valuation.\nApple(AAPL+0.47%)has recently set a new record, but it's not for a good reason. I think this is a huge signal for investors to pay attention to in 2025 because it could result in a retreat for the stock price.\nApple has been among the top consumer brands for a long time. Its iPhones are in the hands of the majority of smartphone users in the U.S., who also wear Apple's watches and AirPods, and use Apple computers. While Apple has been dominant for some time, it seems to have peaked.\nApple hasn't released meaningful new products or technology for some time, which has caused the company to become fairly stagnant. iPhone sales, the company's largest segment by revenue, haven't increased at a rapid pace for some time.\nData source: Apple. Note: Q4 ends around Sept. 30 but is different each year.\nMid-single-digit percentage revenue growth is a key indicator that a company has reached maturity. This growth rate isn't likely to change unless Apple launches a new product or bumps its prices. However, the company is trading as if its revenue is growing a mid-20% pace or more.\nApple's stock has now reached a new decade-high valuation level despite not showing much growth. Although Apple's stock has traded for ahigher price-to-earnings (P/E) ratiothan this during its life as a public company, this is the first time it has traded this high in its modern state (when iPhone sales are a significant chunk of its revenue).\nAAPL PE Ratiodata byYCharts\nI've also overlayed Apple's revenue growth rate to show that the previous time Apple was valued around 40 times trailing earnings, its revenue was growing at more than 50% year over year. With Apple's revenue now growing at a much slower rate, this valuation seems to be getting out of hand because it won't be able to grow its way into a more reasonable price tag.\nAs a result, Apple probably will return to a more historically normal valuation level through a price decline.\nWith Apple growing at a slower pace than the broader market, there's no reason why Apple deserves a premium over theS&P 500(^GSPC+0.54%). With the S&P 500 trading at a trailing P/E ratio of 25.2 and a forward P/E of 21.9, I'd expect Apple stock to trade around those levelsifit continues to put up mundane growth.\nWall Street analysts project Apple's revenue will rise 6% in fiscal year 2025 (ending September 2025) and 8% in fiscal year 2026, so this slow but steady growth is expected to continue during the next few years.\nIf Apple's stock falls to a P/E ratio of 30, the stock price would need to decline by nearly 30%. A P/E ratio of 25 (around the S&P 500's valuation) would imply a fall of more than 40%. Now, these exact declines probably won't happen because Apple's earnings will grow each quarter, which will help its P/E ratio come down. However, there likely needs to be some amount of price correction, as years of growth have already been baked into the stock.\nThere aren't many reasons to own Apple over other big tech companies. It's growing slowly and is expensively valued. All it really has going for it as an investment is its name. Investors should think about moving on from Apple stock, as even some of its biggest proponents (likeWarren Buffett) have started selling Apple shares during the past year.\nKeithen Druryhas no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple. The Motley Fool has adisclosure policy.\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.\nRelated Articles\nInvest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services.\nMaking the world smarter, happier, and richer.\n©1995-2025The Motley Fool. All rights reserved.\nMarket data powered byXigniteandPolygon.io.\nAbout The Motley Fool\nOur Services\nAround the Globe\nFree Tools\nAffiliates & Friends"
    },
    {
      "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/12/42736753/jensen-huangs-nvidia-printing-money-like-apple-in-early-iphone-days-says-tesla-bull-ross-gerber",
      "url_mobile": "",
      "title": "Jensen Huang Nvidia  Printing Money Like Apple  In Early iPhone Days , Says Tesla Bull Ross Gerber - NVIDIA ( NASDAQ : NVDA ) ",
      "seendate": "20241231T100000Z",
      "socialimage": "https://cdn.benzinga.com/files/images/story/2024/12/31/Nvidia-CEO-Jensen-Huang.jpeg?&fit=crop",
      "domain": "benzinga.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 2,
      "days_ago": null,
      "recency_weight": 1.0,
      "content": "Nvidia Corp.(NASDAQ:NVDA) is on the cusp of a significant growth phase, fueled by its leadership in AI infrastructure.\nWhat Happened: InvestorRoss GerbercomparedJensen Huang‘s chip giant current financial trajectory toApple Inc.(NASDAQ:AAPL) during the early iPhone years, highlighting the immense potential in AI, Yahoo Financereportedon Tuesday.\n“Nvidia is printing money like Apple did in the early days of the iPhone,” he said in an interview with Yahoo Finance.\nGerber, a decade-long investor in Nvidia andTesla, sees the company’s growth driven by the global development of AI infrastructure, largely supported by Nvidia’s cutting-edge chips. He mentioned that Nvidia’s profitability and strong market position in the chip industry make the upcoming five years promising.\nGerber also compared Nvidia to Tesla, adding the former hasbeen a better investmentin the past decade.\nThis year, Nvidia has drawn $30 billion in retail investor inflows, ranking as the most favored stock among retail investors in 2024. Despite some traders recently offloading shares, Nvidia’s stock has surged 181% year to date.\nNvidia’s founder and CEO,Jensen Huang, is set to speak at CES 2025, potentially further boosting the stock.\nSee Also:Kiyosaki Warns Of Bitcoin In Black Rocks ETF: ‘It Is Suppressing Bitcoin Price’\nWhy It Matters: Nvidia’s strategic focus on robotics as a new growth driver comes amid fierce competition in the AI chipmaking sector, particularly fromAdvanced Micro Devices, Inc.. Nvidia’s valuationsurpassed $3 trillion, rivalingApple Inc., fueled by the AI boom. The company has also invested in humanoid robotics firms like Figure AI, marking its entry into ‘physical AI.’\nAdditionally,Ibiden Co., akey supplier for Nvidia, is considering expanding its production capacity to meet the surging demand for AI chip package substrates. This move underscores the robust demand for AI-use substrates, with all available stock being quickly acquired by customers. Ibiden’s new substrate factory in Gifu, Japan, is expected to begin operations at 25% capacity by late 2025, eventually reaching 50% by March 2026.\nPrice Action:Nvidia was trading slightly lower at $137.24 in overnight trading hours on Robinhood at 2:19 am ET.\nRead Next:\nDisclaimer: This content was partially produced with the help ofBenzinga Neuroand was reviewed and published by Benzinga editors.\nImage via Shutterstock\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\nA newsletter built for market enthusiasts by market enthusiasts. Top stories, top movers, and trade ideas delivered to your inbox every weekday before and after the market closes."
    },
    {
      "url": "https://www.fool.com/investing/2024/12/28/warren-buffett-sell-apple-stock-buy-stock-up-3100/?source=iedfolrf0000001",
      "url_mobile": "",
      "title": "Warren Buffett Sells Apple Stock and Buys a Restaurant Stock Up 3 , 100 % Since Its IPO",
      "seendate": "20241228T101500Z",
      "socialimage": "https://g.foolcdn.com/editorial/images/802206/investor-16.jpg",
      "domain": "fool.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": null,
      "recency_weight": 1.0,
      "content": "Warren Buffett reportedly manages about 90% ofBerkshire Hathaway's(BRK.A+0.29%)(BRK.B+0.51%)equity securities portfolio, while understudies Todd Combs and Ted Weschler handle the rest. The company does not disclose which investment manager makes each individual trade, but Buffett is almost certainly in charge of large positions likeApple(AAPL+0.47%).\nDespite once calling Apple the \"best business\" in the world, Buffett sold 100 million shares in the third quarter, cutting Berkshire's stake by 25%. And while Apple still ranked as the company's largest holding as of Sept. 30, Buffett has now sold more than 615 million shares in the last four quarters.\nMeanwhile, Berkshire started a very small position inDomino's Pizza(DPZ+0.97%)in the third quarter. That stock is up 3,100% since its initial public offering (IPO) in July 2004, but it has struggled more recently. Shares have fallen 21% in the last three years, despite theS&P 500advancing 28% during that period.\nHere's what investors should know about Apple and Domino's.\nApple has builtbrand authorityandpricing powerthrough engineering expertise. Its lineup of consumer electronics products is built on proprietary software that creates a seamless user experience across devices, and consumers are willing to pay for that. The average iPhone price was 3 times higher than the average Samsung smartphone price during the third quarter.\nApple has a strong presence in several consumer electronics markets, including a leadership position (as measured by sales) in smartphones. However, the company in recent years has expanded its focus beyond hardware. Adjacent services like App Store downloads, iCloud storage, and Apple Pay let the company more efficiently monetize its installed base that exceeds 2.2 billion active devices.\nApple reported modest financial results in the fourth quarter of fiscal 2024, which ended in September 2024. Revenue increased 6% on double-digit sales growth in the services segment, and mid-single-digit sales growth in the Mac, iPad, and iPhone segments. Meanwhile,non-GAAP(adjusted) earnings increased 12% to $1.64 per diluted share.\nApple is a solid business, but not even the best business is worth buying at any price. Apple'sprice-to-earnings (P/E) ratiohas risen from 26 in April to 42 in December without a meaningful catalyst. Sure, it recentlylaunched Apple intelligence, a suite of artificial intelligence capabilities for newer iPhones and MacBooks. But that has yet to trigger the upgrade cycle predicted by so many analysts.\nThe present P/E multiple looks particularly expensive because Wall Street expects Apple's earnings to increase at 10% annually over the next three years. In my opinion, that makes the stock wildly overvalued at its current price, and I thinkWarren Buffettmade the right call in selling shares. But certain Wall Street analysts would disagree. Dan Ives at Wedbush says Apple could be a $5 trillion company within 18 months.\nDomino's is the largest pizza company in the world as measured by sales and stores. The company delivers 1 in every 3 pizzas in the U.S., according toThe Wall Street Journal. Regular promotions and the recent relaunch of its loyalty program have helped Domino's build a reputation for providing more value than peers likePapa John's Internationaland Pizza Hut (owned byYum! Brands).\nConsequently, Domino's has been more likely to reportsame-store salesgrowth in recent years. In fact, its same-store sales have increased in seven consecutive quarters despite somewhat difficult macroeconomic conditions created by high inflation and rising interest rates, which have made consumers especially choosy. Comparatively, Papa John's and Pizza Hut have seen same-store sales decline in four of the last seven quarters.\nDomino's reported mixed results in the third quarter. Revenue increased 5% to $1 billion, which missed the 7% increase Wall Street anticipated. However, generally accepted accounting principles (GAAP) net income was flat at $4.19 per diluted share, which was better than the 13% decline analysts expected. The company opened a net total of 72 stores in the third quarter, such that its total store count now exceeds 21,000.\nCEO Russell Weiner told analysts on the third-quarter earnings call: \"I continue to believe that we will deliver U.S. same-store sales growth of 3% or more annually. And that's why I expect Domino's to continue to drive additional market share gain.\" The company also reiterated its guidance for \"approximately 8% annual income from operations growth\" through 2028.\nTo that end, Wall Street expects Domino's earnings to increase at 8% annually during the next few years. Company guidance and Wall Street's outlook may be conservative given that Domino's anticipates a rebound in international sales in 2026, but the stock is still expensive at its current valuation of 26.6 times earnings. I think investors should wait for a better entry point.\nTrevor Jennewinehas no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple, Berkshire Hathaway, and Domino's Pizza. The Motley Fool has adisclosure policy.\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.\nRelated Articles\nInvest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services.\nMaking the world smarter, happier, and richer.\n©1995-2025The Motley Fool. All rights reserved.\nMarket data powered byXigniteandPolygon.io.\nAbout The Motley Fool\nOur Services\nAround the Globe\nFree Tools\nAffiliates & Friends"
    },
    {
      "url": "https://www.insidermonkey.com/blog/analyst-says-apple-aapl-stock-is-expensive-amid-slow-developing-upgrade-cycle-1414601/",
      "url_mobile": "https://www.insidermonkey.com/blog/analyst-says-apple-aapl-stock-is-expensive-amid-slow-developing-upgrade-cycle-1414601/?amp=1",
      "title": "Analyst Says Apple ( AAPL ) Stock is Expensive Amid  Slow - Developing  Upgrade Cycle",
      "seendate": "20241228T000000Z",
      "socialimage": "https://d2gr5kl7dt2z3t.cloudfront.net/blog/wp-content/uploads/2023/09/19155253/AAPL-insidermonkey-1695153171712.jpg",
      "domain": "insidermonkey.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 2,
      "days_ago": null,
      "recency_weight": 1.0,
      "content": "We recently published a list ofAnalysts Are Talking About These 10 AI Stocks. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against other stocks analysts are talking about.\nMarco Argenti, Chief Information Officer at Goldman Sachs, recently said that in 2025, the world will witness the full potential of AI that has been in development. He used the analogy of a child raised in a library, now ready to step out into the world.\n“What if they, we make them interact with sensory data, with vision data, with, uh, you know, like basically opening that door of the library and making this child walk into the real world? I think this creation of word models, like they’re called generally in the industry, where you combine multimodal information, that is not only text but is also videos, but is also sensory data. It might be temperature, it might be anything you can perceive around you, could actually unlock the next level of capabilities,” Argenti said, according to CNBC.\nDespite high hopes, a potential plateau in performance improvements in AI systems, high energy consumption of AI data centers and transparency remain key issues tech companies will continue to grapple with in 2025.\nREAD ALSO:7 Best Stocks to Buy For Long-Termand8 Cheap Jim Cramer Stocks to Invest In\nFor this article, we picked 10 AI stocks currently trending based on latest news and analyst ratings. With each stock, we have mentioned the number of hedge fund investors. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points(see more details here).\nA wide view of an Apple store, showing the range of products the company offers.\nNumber of Hedge Fund Investors: 158\nTom Forte, Maxim Group senior consumer internet analyst, said while talking to CNBC that Apple Inc (NASDAQ:AAPL) is an expensive stock.\n“If you look at the valuation, it’s trading well north of 30 times on a PE basis, which is at or above its peers who are also taking advantage of this AI-fueled rally. When you look at the next couple of years for Apple Inc (NASDAQ:AAPL), on what looks to be a very slow-developing upgrade cycle, if there is a major upgrade cycle, you’re looking at mid to high single-digit EPS growth. So, north of 30 times PE, mid single-digit to high single-digit EPS growth—I think it’s, you know, an expensive stock.”\nApple Inc (NASDAQ:AAPL) is desperately in need of new catalysts. The company’s revenue in China fell 8% in fiscal year 2024, following a 2% decline the previous year. The Chinese market accounts for about 15% of Apple’s total revenue, so this downtrend cannot be ignored.\nInvestors had hopes for the Wearables, Home, and Accessories segment, but so far its performance has been weak. Vision Pro faces tough competition from Meta’s $500 Quest and the more affordable Quest 3S, making it hard to justify its $3,500 price tag. The failure of Apple’s HomePod, unable to compete with Amazon’s and Google’s lower-priced offerings, further highlights the challenges in this market.\nApple’s iPhone 16 has not shown promising growth prospects yet and investors are still in a wait-and-see mode on the AI platform.\nWhile the company is projected to achieve 9.5% EPS growth this fiscal year and 12.3% growth in the next, much of this growth is already priced in, as the stock trades at nearly 30 times the expected EPS for the fiscal year ending September 2026.\nParnassus Growth Equity Fund stated the following regarding Apple Inc. (NASDAQ:AAPL) in itsQ3 2024 investor letter:\n“Apple Inc.(NASDAQ:AAPL) shares rose during the quarter, making our underweight position a relative detractor. Investors reacted positively to the new iPhone 16 lineup and its advanced features, including generative artificial intelligence, greater durability and increased processing power.”\nOverall, AAPLranks 5thon our list of stocks analysts are talking about. While we acknowledge the potential of AAPL, our conviction lies in the belief that under the radar AI stocks hold greater promise for delivering higher returns, and doing so within a shorter time frame. If you are looking for an AI stock that is more promising than AAPL but that trades at less than 5 times its earnings, check out our report about thecheapest AI stock.\nREAD NEXT:8 Best Wide Moat Stocks to Buy Nowand30 Most Important AI Stocks According to BlackRock\nDisclosure: None. This article is originally published atInsider Monkey.\nYahoo Finance\nReturns since its inception in May 2014 (through August 15th, 2025)\n30 day money back guarantee. Cancel anytime.\nWarren Buffett\nBerkshire Hathaway\n$293,447,417,000\nDavid Einhorn\nGreenlight Capital\n$1,491,303,000\nGeorge Soros\nSoros Fund Management\n$5,416,602,000\nJim Simons\nRenaissance Technologies\n$77,426,184,000\nLeon Cooperman\nOmega Advisors\n$1,886,381,000\nCarl Icahn\nIcahn Capital LP\n$22,521,664,000\nSteve Cohen\nPoint72 Asset Management\n$22,767,998,000\nJohn Paulson\nPaulson & Co\n$3,510,256,000\nDavid Tepper\nAppaloosa Management LP\n$4,198,712,000\nPaul Tudor Jones\nTudor Investment Corp\n$6,160,740,000"
    },
    {
      "url": "https://www.benzinga.com/24/12/42697989/dow-edges-higher-in-thin-holiday-trading-fear-declines-among-us-investors-but-fear-greed-index-remains-in-fear-zo",
      "url_mobile": "",
      "title": "Dow Edges Higher In Thin Holiday Trading As Tesla , Apple Surge : Investor Sentiment Improves , But Greed Index Remains In  Fear  Zone - Tesla ( NASDAQ : TSLA ) ",
      "seendate": "20241227T103000Z",
      "socialimage": "https://cdn.benzinga.com/files/images/story/2024/12/27/Market-Sentiment--Fear-And-Greed-Index--.jpeg?&fit=crop",
      "domain": "benzinga.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": null,
      "recency_weight": 1.0,
      "content": "The CNN Money Fear and Greed index showed some easing in the fear level, while the index remained in the “Fear” zone on Thursday.\nU.S. stocks settled mixed on Thursday, with the Dow Jones index closing slightly higher during the session. The market was shut on Wednesday for Christmas Day.\nMonth to date, the S&P 500 gained 0.1%, while the Nasdaq has surged 4.2%, driven by significant gains inTesla(NASDAQ:TSLA) andApple(NASDAQ:AAPL). The blue-chip Dow, however, fell around 3.5% during the month.\nOn the economic data front, U.S. initial jobless claims fell by 1,000 from the previous week to a reading of 219,000 during the second week of December, compared to market estimates of 224,000.\nMost sectors on the S&P 500 closed on a positive note, with healthcare, financial, and real estate stocks recording the biggest gains on Thursday. However, consumer discretionary and communication services stocks bucked the overall market trend, closing the session lower.\nThe Dow Jones closed higher by around 29 points to 43,325.80 on Thursday. The S&P 500 fell 0.04% to 6,037.59, while the Nasdaq Composite slipped 0.05% at 20,020.36 during Thursday's session.\nWhat is CNN Business Fear & Greed Index?\nAt a current reading of 35.1, the index remained in the “Fear” zone on Thursday, versus a prior reading of 34.\nThe Fear & Greed Index is a measure of the current market sentiment. It is based on the premise that higher fear exerts pressure on stock prices, while higher greed has the opposite effect. The index is calculated based on seven equal-weighted indicators. The index ranges from 0 to 100, where 0 represents maximum fear and 100 signals maximum greediness.\nRead Next:\nPhoto courtesy: Shutterstock\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\nA newsletter built for market enthusiasts by market enthusiasts. Top stories, top movers, and trade ideas delivered to your inbox every weekday before and after the market closes."
    },
    {
      "url": "https://www.insidermonkey.com/blog/apple-inc-aapl-billionaire-d-e-shaw-is-bullish-on-this-stock-right-now-1414574/",
      "url_mobile": "https://www.insidermonkey.com/blog/apple-inc-aapl-billionaire-d-e-shaw-is-bullish-on-this-stock-right-now-1414574/?amp=1",
      "title": "Apple Inc . ( AAPL ): Billionaire D . E . Shaw Is Bullish On This Stock Right Now",
      "seendate": "20241227T171500Z",
      "socialimage": "https://d2gr5kl7dt2z3t.cloudfront.net/blog/wp-content/uploads/2023/09/19155253/AAPL-insidermonkey-1695153171712.jpg",
      "domain": "insidermonkey.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": null,
      "recency_weight": 1.0,
      "content": "We recently compiled a list of the10 Best Stocks to Buy According to Billionaire D.E. Shaw.In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against the other stocks.\nEquity market pricing is never perfect due to supply and demand imbalances, emotional reactions, and errors. Billionaire investor David Elliot Shaw excels at detecting and exploiting these inefficiencies to generate shareholder value. Unlike most hedge fund managers who rely on intuition, Shaw uses sophisticated mathematical models and algorithms for investment decisions. Over the years, he has developed software and hardware to gain an edge in investment opportunities.\nBorn in 1951, David E. Shaw became a successful billionaire scientist and hedge fund manager. After earning a PhD from Stanford in 1980, he foundedD.E. Shaw & Co.in 1988 with six employees and $28 million in capital. The hedge fund has averaged a 12.5% return since inception, with only one down year. Shaw’s firm uses powerful computers and advanced algorithms for quick market responses and risk management, returning over $51 billion to investors. Likewise, it generated a net return of 11.88% between 2001 and 2011. While Shaw’s firm was down by 9% at the height of the financial crisis in 2008, it bounced back to profitability with a 21% return in 2009.\nREAD ALSO:10 Best Stocks to Buy According to Billionaire David EinhornandBillionaire Paul Singer’s Top 12 Long-Term Stock Picks.\nD.E. Shaw is expanding and launching new funds. In 2023, they raised money for D.E. Shaw Alkali Fund VI, the newest in their Alkali group. By November 2024, they had secured $1 billion for this fund, focusing on corporate debt, structured credit, and synthetic securitizations.\nLast year, the firm also raised $1.1 billion for two new private investment vehicles: D.E. Shaw Voltaic Fund and D.E. Shaw Diopter Fund. In June 2024, D.E. Shaw announced it was raising its second fund in 16 months to target bank capital deals. They filed a private placement notice for D.E. Shaw Diopter Fund II, but the amount wasn’t disclosed.\nBloomberg reported that D.E. Shaw’s largest hedge fund, the D.E. Shaw Composite Fund, gained 9.6% in 2023, outperforming the HFR Global Hedge Fund Index, which was up about 2.5% through December 15. Reuters added that D.E. Shaw’s macro-oriented fund, the Oculus Fund, gained 7.8% in 2023, beating its macroeconomic peers. According to Bloomberg, the Oculus Fund has never had a negative year since it started.\nDiversification is another vital arsenal that D.E. Shaw & Co. relies on to spread risk and reduce market volatility. The firm is highly diversified with a portfolio value of about $116.49 billion. While technology stocks account for the most significant share in the equity market at 24.6%, the hedge fund also has stakes in Services at 17.5% and the financial sector at 7.7%. In addition to diversifying holdings, Shaw relies on a multi-strategy approach to squeeze optimum value in the market.\nBillionaire D.E. Shaw suggests investing in resilient companies, even as the US Federal Reserve signals fewer interest rate cuts in 2025. Despite three cuts reducing the benchmark rate to 4.25%-4.5%, economic slowdown concerns persist, especially in the labor market. Job growth is mainly in government and health care, while growth in manufacturing, business, and professional services has stagnated.\nOur Methodology\nTo make the list of best stocks to buy according to billionaire D.E. Shaw, we scanned D.E. Shaw & Co investment portfolio. We then settled on the hedge fund’s largest holdings analyzing why they stand out and the number of hedge funds that hold stakes in them. Finally, we ranked the stocks in ascending order based on D.E. Shaw & Co stake value.\nAt Insider Monkey, we are obsessed with the stocks that hedge funds pile into. The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\nA wide view of an Apple store, showing the range of products the company offers.\nD.E. Shaw & Co’s Stake Value: $2 Billion\nNumber of Hedge Fund Holders: 158\nApple Inc. (NASDAQ:AAPL) is a technology company that designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories. It is one of the best-performing stocks in the D. E. Shaw portfolio, going by the 37% year-to-date gain. The strong performance comes from investors rallying behind the company’s innovative product lineup and strong financial performance that affirms underlying growth.\nSimilarly, it is one of the best stocks to buy, according to billionaire D.E. Shaw, given the investments it is making in AI. Apple Inc. (NASDAQ:AAPL) is investing in Apple Intelligence, an AI-driven initiative that is expected to bolster the iPhone product line. While iPhone sales have appeared subdued in recent years, the integration of AI features is one factor expected to give people a reason to upgrade, strengthening Apple’s revenue base.\nConsequently, iPhone shipments are projected to grow 12% year-over-year to 258 million units in fiscal 2026. The growth would be propelled by features like upgraded Siri, AI image tools, and ChatGPT integration. While the hardware business has been a key growth driver over the years, the service segment also affirms Apple Inc.’s (NASDAQ:AAPL) long-term prospects. The segment is projected to achieve a double-digit growth rate driven by strong pricing power, expanding adoption and new offerings\nThe introduction of AI services is projected to contribute between $7 and $14 billion in incremental services revenue. Likewise, the expectation is high that Apple Inc.’s (NASDAQ:AAPL) gross margin will improve next year owing to cost efficiencies and faster-growing service revenue, allowing the company to generate more shareholder value.\nOverall AAPLranks 2ndon our list of the best stocks to buy according to Billionaire D. E. Shaw. While we acknowledge the potential of AAPL as an investment, our conviction lies in the belief that under the radar AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than AAPL but that trades at less than 5 times its earnings, check out our report about thecheapest AI stock.\nREAD NEXT:8 Best Wide Moat Stocks to Buy Nowand30 Most Important AI Stocks According to BlackRock\nDisclosure: None. This article is originally published atInsider Monkey.\nYahoo Finance\nReturns since its inception in May 2014 (through August 15th, 2025)\n30 day money back guarantee. Cancel anytime.\nWarren Buffett\nBerkshire Hathaway\n$293,447,417,000\nDavid Einhorn\nGreenlight Capital\n$1,491,303,000\nGeorge Soros\nSoros Fund Management\n$5,416,602,000\nJim Simons\nRenaissance Technologies\n$77,426,184,000\nLeon Cooperman\nOmega Advisors\n$1,886,381,000\nCarl Icahn\nIcahn Capital LP\n$22,521,664,000\nSteve Cohen\nPoint72 Asset Management\n$22,767,998,000\nJohn Paulson\nPaulson & Co\n$3,510,256,000\nDavid Tepper\nAppaloosa Management LP\n$4,198,712,000\nPaul Tudor Jones\nTudor Investment Corp\n$6,160,740,000"
    },
    {
      "url": "https://www.benzinga.com/markets/futures/24/12/42699993/us-stocks-to-open-lower-as-index-future-decline-analysts-remain-upbeat-about-santa-rally",
      "url_mobile": "",
      "title": "US Stocks To Open Lower As Index Future Decline : Analysts Remain Upbeat About Santa Rally - Apple ( NASDAQ : AAPL ), Evaxion Biotech ( NASDAQ : EVAX ) ",
      "seendate": "20241227T131500Z",
      "socialimage": "https://cdn.benzinga.com/files/images/story/2024/12/27/Wall-Street_2.jpeg?&fit=crop",
      "domain": "benzinga.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": null,
      "recency_weight": 1.0,
      "content": "U.S. stock futures tumbled on Friday in premarket hours after a mixed Thursday. All four index futures slipped in trade.\nWhile the S&P 500 index is on its way to registering a robust 20% plus return for the second consecutive year in 2024 it ended lower on the second day of the Santa rally after advancing 1.1% on Christmas Eve. Analysts say that the full ‘Santa Claus Rally’ has never been lower.\nThe 10-year and two-year Treasury notes yielded 4.61% and 4.33%, respectively. The probability of having no change in the interest rates for the upcoming Jan. 31, 2025 decision was at 89.3%, down from 91.4% a week ago, accordingtoCME Group’s FedWatch tool.\nIn premarket trading on Friday, theSPDR S&P 500 ETF Trust(NYSE:SPY) was up 0.04% to $601.34 and theInvesco QQQ Trust ETF(NASDAQ:QQQ) fell 0.36% to $527.70, according toBenzinga Pro data.\nCues From The Last Session\nU.S. stock markets closed mixed on Thursday, following a Christmas break. The Dow Jones Industrial Average edgedhigher, while the S&P 500 and Nasdaq Composite dipped slightly.\nMonth-to-date performance varied across indices. The Nasdaq significantly outperformed, driven by strong gains inTesla Inc.(NASDAQ:TSLA) andApple Inc.(NASDAQ:AAPL), while the Dow Jones experienced a decline of around 3.5%. The S&P 500 saw a modest gain of 0.1%.\nEconomic data released on Thursday showed a slight decrease in initial jobless claims, coming in below market expectations. This suggests a continued strong labor market.\nSector performance was mixed. Healthcare, financial, and real estate sectors led gains, while consumer discretionary and communication services sectors underperformed.\nInsights From Analysts\nAccording to the chief market strategist at Carson Research,Ryan Detrick, the final six days of the ‘Santa Claus Rally’ has been higher five out of seven, with two small losses. But even these six days have been higher by 1.7% on average.\nMapping the data from 1950, Detrick summarized that the S&P 500 has had a 20% plus return 22 times and a negative return annual return or 21 times in total.\nAccording toCharlie Bilello, the chief market strategist at Creative Planning the S&P 500’s 57 all-time highs in 2024 was the fifth highest in its history.\nLouis Navellierof Navellier & Associates in his daily market commentary said, “The Fed may be turning its attention to inflation, according to Fed Chairman Jerome Powell's comments, but if continuing unemployment claims continue to rise, it will likely get the Fed's attention and encourage more key interest rate cuts.”\n“Continuing unemployment claims rose to 1.91 million in the latest week, which represents the highest level in more than three years. New unemployment claims came in at 219,000, which was a bit lower than the four-week moving average of 226,500,” he added.\nSee Also:How To Trade Futures\nUpcoming Economic Data\nOnly a few data points remain to be released in this truncated week that will help investors determine the future course of action.\nStocks In Focus:\nCommodities, Gold And Global Equity Markets:\nCrude oil futures were higher in the early New York session by 0.46% to hover around $69.94 per barrel.\nThe gold spot index was down by 0.48% to $2,641.11 per ounce. The Dollar Index was up 0.01% to 108.138 level.\nAsian markets were mixed on Friday, as Hong Kong’s Hang Seng, China’s CSI 300, and South Korea’s Kospi index declined. Whereas, Japan’s Nikkei 225, Australia’s ASX 200, and India’s S&P BSE Sensex index rose. Most European markets traded higher.\nRead Next:\nPhoto courtesy: Wikimedia\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\nA newsletter built for market enthusiasts by market enthusiasts. Top stories, top movers, and trade ideas delivered to your inbox every weekday before and after the market closes."
    },
    {
      "url": "https://247wallst.com/personal-finance/2024/12/27/were-in-our-50s-with-a-large-holding-in-apple-stock-should-we-use-an-exchange-fund-to-diversify/",
      "url_mobile": "",
      "title": "Were in our 50s with a large holding in Apple stock should we use an exchange fund to diversify ? ",
      "seendate": "20241227T154500Z",
      "socialimage": "https://247wallst.com/wp-content/uploads/2024/12/insert.jpg",
      "domain": "247wallst.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": null,
      "recency_weight": 1.0,
      "content": null
    },
    {
      "url": "https://wallstreetpit.com/121846-wedbush-maps-apples-road-to-a-5-trillion-milestone/",
      "url_mobile": "",
      "title": "Wedbush Maps Apple Road to a $5 Trillion Milestone",
      "seendate": "20241227T230000Z",
      "socialimage": "https://wallstreetpit.com/wp-content/uploads/2016/11/apple-iphone-15.jpg",
      "domain": "wallstreetpit.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": null,
      "recency_weight": 1.0,
      "content": "December 27, 2024Ron Haruni\nOn CNBC’s “Closing Bell Overtime,”Dan Ives,Wedbush‘s global head of technology research, shared his insights on Apple’s recent performance and its potential path to a $5 trillion market cap, primarily driven by an anticipated AI upgrade cycle. Ives recentlyraisedhis price target for Apple (AAPL) to a Street-High of $325 from $300, maintaining an ‘Outperform’ rating on the shares, attributing his optimism to recent channel checks indicating a robust holiday season, projecting Apple to sell 240 million iPhones this year.\nDespite Apple’s stock trading at high multiples compared to its earnings, Ives dismissed concerns about overvaluation. He argued that Apple’s services business alone could justify a $2 trillion valuation, and with AI integration, revenue could increase significantly, potentially adding $5 to $10 billion annually. This, combined with what he believes will be an underestimated growth in iPhone sales, could push Apple’s valuation far beyond current expectations.\nIves addressed concerns about consumer behavior amidst inflation, noting that while it might affect upgrades marginally, the real driver for upgrades is the vast number of iPhones—300 million out of 1.5 billion globally—that haven’t been upgraded in over four years. He emphasized thatApple Intelligence, part of the iOS 18.2 update, would catalyze this cycle, with hundreds of new AI-driven apps expected to enhance the iPhone ecosystem.\nResponding to comparisons with the lukewarm reception to AI PCs by companies like HP (HPE) and Dell (DELL), Ives highlighted the unique upgrade cycle for smartphones, which typically occurs every 2.5 to 3 years but has now extended to 4 years, creating pent-up demand. He believes that the integration of AI will not only drive iPhone upgrades but also extend across Apple’s entire product line, including iPads and Macs, marking the beginning of a multi-year AI-driven upgrade super cycle.\nIves concluded that the current market cap of Apple, around $3.92 trillion, does not reflect the potential growth from AI monetization. He predicts that as AI penetration in Apple’s ecosystem grows from 15% to 25-30%, the company could feasibly reach a$5 trillion valuationwithin the next 12 to 18 months. His vision is for Apple to lead the consumer AI revolution, countering any skepticism with a firm belief in Apple’s strategic position and future growth trajectory.\nDisclaimer: This page containsaffiliate links. If you choose to make a purchase after clicking a link, we may receive a commission at no additional cost to you. Thank you for your support!"
    },
    {
      "url": "https://www.themarketsdaily.com/2024/12/27/equities-research-analysts-updated-eps-estimates-for-december-26th-aapl-acva-avxl-celh-crvl-kmpr-mcy-nke-pb-pypd.html",
      "url_mobile": "",
      "title": "Equities Research Analyst Updated EPS Estimates for December 26th ( AAPL , ACVA , AVXL , CELH , CRVL , KMPR , MCY , NKE , PB , PYPD ) ",
      "seendate": "20241227T061500Z",
      "socialimage": "",
      "domain": "themarketsdaily.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": null,
      "recency_weight": 1.0,
      "content": null
    },
    {
      "url": "https://finance.yahoo.com/news/apple-stock-touches-intraday-high-after-nod-of-confidence-from-wall-street-154221679.html",
      "url_mobile": "",
      "title": "Apple stock touches intraday high after nod of confidence from Wall Street",
      "seendate": "20241226T161500Z",
      "socialimage": "https://s.yimg.com/ny/api/res/1.2/4wJKpYVJFN2GTURC48Hlcw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2024-12/50bf8b80-bca9-11ef-bada-38725b6ea9b9",
      "domain": "finance.yahoo.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": null,
      "recency_weight": 1.0,
      "content": "Yahoo is part of theYahoo family of brandsThe sites and apps that we own and operate, including Yahoo, AOL, Engadget, In The Know and Makers.Yahoofamily of brands.\nIf you do not want us and our partners to use cookies and personal data for these additional purposes, click 'Reject all'.\nIf you would like to customise your choices, click 'Manage privacy settings'.\nYou can withdraw your consent or change your choices at any time by clicking on the 'Privacy & cookie settings' or 'Privacy dashboard' links on our sites and apps. Find out more about how we use your personal data in ourprivacy policyandcookie policy."
    },
    {
      "url": "https://www.benzinga.com/insights/news/24/12/42679436/heres-how-much-you-would-have-made-owning-apple-stock-in-the-last-15-years",
      "url_mobile": "",
      "title": "Here How Much You Would Have Made Owning Apple Stock In The Last 15 Years - Apple ( NASDAQ : AAPL ) ",
      "seendate": "20241226T014500Z",
      "socialimage": "https://cdn.benzinga.com/files/images/story/2023/valuestock_image_1.jpeg?&fit=crop",
      "domain": "benzinga.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": null,
      "recency_weight": 1.0,
      "content": "Apple (NASDAQ:AAPL) has outperformed the market over the past 15 years by 14.69% on an annualized basis producing an average annual return of 26.58%. Currently, Apple has a market capitalization of $3.90 trillion.\nBuying $100 In AAPL:If an investor had bought $100 of AAPL stock 15 years ago, it would be worth$3,415.99today based on a price of $258.10 for AAPL at the time of writing.\nFinally -- what's the point of all this? The key insight to take from this article is to note how much of a difference compounded returns can make in your cash growth over a period of time.\nThis article was generated by Benzinga's automated content engine and reviewed by an editor.\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\nA newsletter built for market enthusiasts by market enthusiasts. Top stories, top movers, and trade ideas delivered to your inbox every weekday before and after the market closes."
    },
    {
      "url": "https://biztoc.com/x/9583572110a7bfcd",
      "url_mobile": "",
      "title": "Top analyst revisits Apple stock price target on march to $4 trillion",
      "seendate": "20241226T134500Z",
      "socialimage": "https://biztoc.com/cdn/9583572110a7bfcd_s.webp",
      "domain": "biztoc.com",
      "language": "English",
      "sourcecountry": "",
      "coverage_count": 1,
      "days_ago": null,
      "recency_weight": 1.0,
      "content": "Airbus ordered an immediate software rollback across its A320 fleet after an incident exposed corrupted flight data, grounding thousands of jets and threatening widespread holiday travel chaos.\nMarkets closed the holiday week on a cautious, mixed note: the S&P 500 eked out gains while the Nasdaq led on AI-related strength and the Dow lagged amid travel-sector weakness. Volatility ticked up after the Airbus recall and safe-haven flows supported gold. Tech and AI names remain the main catalysts, offsetting weakness in energy and airlines.\nAirbus ordered an emergency recall after a mid-air incident exposed a software vulnerability in A320-family jets. The move forces rapid software rollbacks and threatens major holiday travel disruptions for carriers worldwide.\n11.8B - Record US online Black Friday spending reported by Adobe.\nAirlines raced to apply the mandated A320 software fix, causing cancellations and delays at major hubs. Carriers and airports scrambled to restore schedules as regulators monitored safety compliance.\nTop FDA officials signalled tougher vaccine approval standards after an internal review raised safety questions. The agency said it will tighten pre-approval hurdles for new and annual vaccines.\nRegenix, a mid‑cap biotech, beat revenue and profit expectations and raised full‑year guidance after strong adoption of its flagship therapy—shares jump on the outlook.\nSenior FDA staff publicly questioned COVID vaccine safety without releasing full data, provoking calls for transparency. Agency leaders defended conclusions while public-health experts demanded access to the evidence.\nPresident Trump declared the airspace above and around Venezuela closed, intensifying regional tensions and sowing confusion for carriers. Airlines and foreign governments face fresh security and diplomatic uncertainty.\nElectric-vehicle maker Electra Motors slashed its production targets and cut forward guidance after supply-chain setbacks, triggering a steep sell-off in the stock.\nThe White House signaled plans to pardon former Honduran president Juan Orlando Hernández, provoking bipartisan backlash. The move has immediate diplomatic and legal implications amid regional drug-trafficking prosecutions.\nUkraine released footage of kamikaze naval drones striking Russia-linked tankers, underscoring rising maritime risks in the Black Sea. The strikes threaten energy logistics and escalate naval confrontation between Kyiv and Moscow.\nFDA signals tighter vaccine-approval standards; China doubles down on crypto curbs and stablecoin controls; U.S. halts asylum decisions and pauses visa processing amid security review.\nA corruption probe triggered the resignation of a top Zelensky aide, deepening Ukraine’s political turmoil. Reports say the sacked official relocated to the front line amid mounting investigations.\nGaza’s health authorities reported the Palestinian death toll has exceeded 70,000 since the start of the Israel-Hamas war. Human-rights allegations have emerged after raids in contested areas.\n\"This is the single biggest short-term shock to global travel since 9/11.\"— Mark Lewis — Aviation analyst\nHong Kong’s deadliest fire in decades has sparked probes into renovation practices and possible corruption. Beijing ordered nationwide building safety inspections as scrutiny intensifies.\nBlack Friday online sales surged to record levels as shoppers leaned on e-commerce and AI-driven search. Retailers and analytics firms reported strong digital receipts despite broader economic unease.\nCompanies supplying data centers and chips to AI giants have borrowed heavily, creating a $96 billion debt pile tied to OpenAI-led demand. Analysts warn the leverage could amplify risks if AI revenue growth slows.\nMicron confirmed plans for a major $9.6 billion investment in western Japan to secure high-bandwidth memory capacity for AI workloads. The move aims to diversify supply amid geopolitical risk to Taiwan-based manufacturing.\nGold surged this year while Bitcoin slumped, highlighting a sharp safe-haven rotation and liquidity preferences. Investors and central banks favored metal for trust and stability amid market stress.\nA long trading streak above the 50-day moving average ended, prompting warnings about higher downside risk. Yet markets staged a Thanksgiving-week rally, leaving analysts split on December momentum.\nChina’s central bank and regulators signalled a renewed crackdown on crypto activity, flagging stablecoin risks and curbing token issuance. The moves tighten the policy backdrop for global crypto markets.\nFloods and landslides in Indonesia have killed hundreds and left many missing, stretching emergency services. Rescue efforts continue as weather improves and bodies are recovered across hard-hit regions.\nOil logistics in the Black Sea and Russian refinery operations were hit by drone attacks and loading halts, tightening near-term supply flows. Energy firms and traders are monitoring potential knock-on effects on prices.\nArmed conflicts and attacks\nDisasters and accidents\nSports"
    },
    {
      "url": "https://www.insidermonkey.com/blog/dan-niles-on-apple-aapl-data-is-somewhat-disappointing-and-stock-is-pretty-expensive-1413968/",
      "url_mobile": "https://www.insidermonkey.com/blog/dan-niles-on-apple-aapl-data-is-somewhat-disappointing-and-stock-is-pretty-expensive-1413968/?amp=1",
      "title": "Dan Niles on Apple ( AAPL ): Data is  Somewhat Disappointing  and Stock is  Pretty Expensive",
      "seendate": "20241226T223000Z",
      "socialimage": "https://d2gr5kl7dt2z3t.cloudfront.net/blog/wp-content/uploads/2023/09/13040841/AAPL-imagemaker-1694592519294.jpg",
      "domain": "insidermonkey.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": null,
      "recency_weight": 1.0,
      "content": "We recently published a list of10 AI Stocks Wall Street is Talking About. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against other AI stocks Wall Street is talking about.\nDefiance ETFs CEO and CIO Sylvia Jablonski said in a recent program on Bloomberg that there are trillions of dollars of cash waiting on the sidelines ready to be invested in AI amid demand that is at an all-time high.\n“There’s a biggest wealth transfer of our generation happening as we speak. And you know, Gen Z, you know, Gen Z, Millennial, Gen X kind of, you know, the younger traders are, this is where they’re allocating their funds to. And, you know, retail has definitely spoken, and institutions have definitely spoken, and they’re looking for that, that fourth industrial revolution allocation.”\nSylvia also talked about the relationship between quantum computing and AI and explained how this technology would improve AI systems:\n“So chatbot AI is, you know, kind of version one. Quantum is taking everything to the next level. So you need quantum in order for it to be efficient. You need to process that data quickly. It will help, you know, essentially health care, cryptography, aerospace and defense, you know, blockchain technology. Anything you can think of will be better, too, with quantum supercomputing power.”\nREAD ALSO:7 Best Stocks to Buy For Long-Termand8 Cheap Jim Cramer Stocks to Invest In\nFor this article, we chose 10 AI stocks that are currently buzzing on the back of latest news and analyst ratings. With each stock we have mentioned the number of hedge fund investors. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points(see more details here).\nAn Apple store displaying the latest in consumer electronics, from smartphones to wearables.\nNumber of Hedge Fund Investors: 158\nDan Niles of Niles Investment Management said while talking to Schwab Network in a latest program that the data around Apple Inc’s (NASDAQ:AAPL) new iPhone has been “disappointing.”\n“Relative to three months ago, the data, if you actually take a look at it, has been somewhat disappointing, with the rollout being much slower. In other words, you’re going to get another update to Apple Intelligence, which is their AI features, in December. You don’t get a rollout in Europe until next year, hopefully in the first quarter, and for China, we still don’t know when they’re going to roll out AI features. With the stock now trading at a multiple that just keeps expanding—now in the low 30 PE range compared to the S&P at about 22 times—it’s looking pretty expensive. So for me, Apple Inc (NASDAQ:AAPL) is not one I would really be that bullish on right here. It’s just going up with the tape, but I think as we get closer to them having to report and guide, you may have an issue.”\nApple Inc (NASDAQ:AAPL) has been seeing a long-term decline in mobile carrier upgrade rates, especially postpaid, for several years. This suggests that people are holding onto their devices longer, likely due to economic factors, satisfaction with current technology, or a lack of exciting new features in recent models\nIn the latest earnings call, Apple Inc (NASDAQ:AAPL) CEO Tim Cook highlighted new features for the iPhone, such as a more comfortable watch band and sleep apnea detection, but none appeared to be major demand drivers for new customers.\nMar Vista Strategic Growth Strategy stated the following regarding Apple Inc. (NASDAQ:AAPL) in itsQ3 2024 investor letter:\n“Apple Inc.(NASDAQ:AAPL) stock was strong in the quarter as investors viewed the company’s generative AI roadmap and iPhone 16 product cycle positively. The market was reminded of the strength of the Apple ecosystem as management demonstrated how generative AI solutions would be integrated into its iOS 18 operating system, which was broadly released in the iPhone 16 late in calendar Q3. We believe Apple’s generative AI-enabled products should spur a meaningful iPhone upgrade cycle and create new avenues of monetization through its app store and advertising offerings. We believe this will support intrinsic value growth that will range between high single digits and low double-digits over our investment horizon.”\nOverall, AAPLranks 4thon our list of AI stocks Wall Street is talking about. While we acknowledge the potential of AAPL, our conviction lies in the belief that under the radar AI stocks hold greater promise for delivering higher returns, and doing so within a shorter time frame. If you are looking for an AI stock that is more promising than AAPL but that trades at less than 5 times its earnings, check out our report about thecheapest AI stock.\nREAD NEXT:8 Best Wide Moat Stocks to Buy Nowand30 Most Important AI Stocks According to BlackRock\nDisclosure: None. This article is originally published atInsider Monkey.\nYahoo Finance\nReturns since its inception in May 2014 (through August 15th, 2025)\n30 day money back guarantee. Cancel anytime.\nWarren Buffett\nBerkshire Hathaway\n$293,447,417,000\nDavid Einhorn\nGreenlight Capital\n$1,491,303,000\nGeorge Soros\nSoros Fund Management\n$5,416,602,000\nJim Simons\nRenaissance Technologies\n$77,426,184,000\nLeon Cooperman\nOmega Advisors\n$1,886,381,000\nCarl Icahn\nIcahn Capital LP\n$22,521,664,000\nSteve Cohen\nPoint72 Asset Management\n$22,767,998,000\nJohn Paulson\nPaulson & Co\n$3,510,256,000\nDavid Tepper\nAppaloosa Management LP\n$4,198,712,000\nPaul Tudor Jones\nTudor Investment Corp\n$6,160,740,000"
    },
    {
      "url": "https://www.benzinga.com/insights/analyst-ratings/24/12/42692271/what-14-analyst-ratings-have-to-say-about-apple",
      "url_mobile": "",
      "title": "What 14 Analyst Ratings Have To Say About Apple - Apple ( NASDAQ : AAPL ) ",
      "seendate": "20241226T201500Z",
      "socialimage": "https://cdn.benzinga.com/files/images/story/2023/analyst_ratings_image_0.jpeg?&fit=crop",
      "domain": "benzinga.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": null,
      "recency_weight": 1.0,
      "content": "Throughout the last three months, 14 analysts have evaluated Apple (NASDAQ:AAPL), offering a diverse set of opinions from bullish to bearish.\nSummarizing their recent assessments, the table below illustrates the evolving sentiments in the past 30 days and compares them to the preceding months.\nAnalysts' evaluations of 12-month price targets offer additional insights, showcasing an average target of $245.14, with a high estimate of $325.00 and a low estimate of $184.00. A decline of 0.04% from the prior average price target is evident in the current average.\nThe standing of Apple among financial experts becomes clear with a thorough analysis of recent analyst actions. The summary below outlines key analysts, their recent evaluations, and adjustments to ratings and price targets.\nAnalyzing these analyst evaluations alongside relevant financial metrics can provide a comprehensive view of Apple's market position. Stay informed and make data-driven decisions with the assistance of our Ratings Table.\nStay up to date on Apple analyst ratings.\nApple is among the largest companies in the world, with a broad portfolio of hardware and software products targeted at consumers and businesses. Apple's iPhone makes up a majority of the firm sales, and Apple's other products like Mac, iPad, and Watch are designed around the iPhone as the focal point of an expansive software ecosystem. Apple has progressively worked to add new applications, like streaming video, subscription bundles, and augmented reality. The firm designs its own software and semiconductors while working with subcontractors like Foxconn and TSMC to build its products and chips. Slightly less than half of Apple's sales come directly through its flagship stores, with a majority of sales coming indirectly through partnerships and distribution.\nMarket Capitalization Analysis:Above industry benchmarks, the company's market capitalization emphasizes a noteworthy size, indicative of a strong market presence.\nRevenue Growth:Apple's revenue growth over a period of 3 months has been noteworthy. As of 30 September, 2024, the company achieved a revenue growth rate of approximately6.07%. This indicates a substantial increase in the company's top-line earnings. As compared to its peers, the revenue growth lags behind its industry peers. The company achieved a growth rate lower than the average among peers in Information Technology sector.\nNet Margin:Apple's net margin excels beyond industry benchmarks, reaching15.52%. This signifies efficient cost management and strong financial health.\nReturn on Equity (ROE):Apple's ROE stands out, surpassing industry averages. With an impressive ROE of23.83%, the company demonstrates effective use of equity capital and strong financial performance.\nReturn on Assets (ROA):Apple's ROA stands out, surpassing industry averages. With an impressive ROA of4.23%, the company demonstrates effective utilization of assets and strong financial performance.\nDebt Management:With a high debt-to-equity ratio of1.87, Apple faces challenges in effectively managing its debt levels, indicating potential financial strain.\nAnalysts work in banking and financial systems and typically specialize in reporting for stocks or defined sectors. Analysts may attend company conference calls and meetings, research company financial statements, and communicate with insiders to publish \"analyst ratings\" for stocks. Analysts typically rate each stock once per quarter.\nBeyond their standard evaluations, some analysts contribute predictions for metrics like growth estimates, earnings, and revenue, furnishing investors with additional guidance. Users of analyst ratings should be mindful that this specialized advice is shaped by human perspectives and may be subject to variability.\nBreaking: Wall Street's Next Big Mover\nBenzinga's #1 analyst just identified a stock poised for explosive growth. This under-the-radar company could surge 200%+ as major market shifts unfold.Click here for urgent details.\nThis article was generated by Benzinga's automated content engine and reviewed by an editor.\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\nA newsletter built for market enthusiasts by market enthusiasts. Top stories, top movers, and trade ideas delivered to your inbox every weekday before and after the market closes."
    },
    {
      "url": "https://wallstreetpit.com/121765-apples-4-trillion-dream-ai-hype-or-real-growth/",
      "url_mobile": "",
      "title": "Apple $4 Trillion Dream : AI Hype or Real Growth ? ",
      "seendate": "20241225T000000Z",
      "socialimage": "https://wallstreetpit.com/wp-content/uploads/2016/08/apple-iphone-keyboard.jpg",
      "domain": "wallstreetpit.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 2,
      "days_ago": null,
      "recency_weight": 1.0,
      "content": "December 24, 2024Ari Haruni\nApple‘s(AAPL)stock has recently soared to new all-time highs/$258.21, inching closer to a$4 trillionmarket capitalization, driven largely by the optimism surrounding AI’s potential to spark a significant upgrade cycle for the iPhone. During a discussion on CNBC’s ‘Squawk on the Street’,Tom Forte, a senior consumer internet analyst at Maxim Group, shared his perspectives on this surge and his ongoing hold rating on Apple’s stock.\nForte attributes the recent run-up in Apple’s stock to an AI-fueled rally, with expectations high that AI enhancements will lead to a major iPhone upgrade cycle. Despite this, he maintains a ‘hold’ rating on the stock due to valuation concerns. Currently trading well above 30 times its price-to-earnings (P/E) ratio, Apple’s valuation is at or above its peers who are also benefiting from the AI surge. Forte points out that even with an anticipated upgrade cycle, Apple’s earnings per share (EPS) growth over the next couple of years looks to be in the mid to high single digits, suggesting that the stock might be overpriced relative to its growth prospects.\nWhen questioned about his skepticism regarding an immediate upgrade cycle, Forte highlights a timing mismatch between hardware and software releases. The iPhone 16 lineup was introduced in September, but the AI-related software updates are being rolled out incrementally, extending into December for the U.S. and potentially April for Europe. This staggered rollout might lead consumers to wait for the next generation model, the iPhone 17, rather than upgrading immediately, thus potentially delaying or diluting the expected upgrade cycle. He also notes the ongoing education of consumers by companies like Google (GOOG) and Apple about the benefits of AI in smartphones, indicating that the demand for AI-driven upgrades is not yet a certainty.\nForte has maintained his ‘hold’ rating since Apple’s developers conference where they unveiled their AI strategy, observing the market’s reaction but waiting for clear evidence of how AI will translate into earnings growth for Apple. Despite the stock’s impressive performance since the conference, he remains cautious.\nDiscussing Apple’s potential move into home security with a new camera akin to Amazon’s Ring, Forte acknowledges Apple’s extensive installed base with the iPhone but expresses doubt about the impact of this venture on Apple’s financials. Given Apple’s size, he suggests that while such a product might add marginal earnings, perhaps around 10 cents per share, it wouldn’t significantly move the needle, especially when the iPhone still constitutes about half of Apple’s revenue.\nIn essence, while the market celebrates Apple’s AI advancements and the potential for an upgrade cycle, Forte’s analysis suggests a more measured approach, focusing on valuation, the timing and impact of AI integration, and the comparative scale of new product entries against Apple’s massive revenue base.\nDisclaimer: This page containsaffiliate links. If you choose to make a purchase after clicking a link, we may receive a commission at no additional cost to you. Thank you for your support!"
    },
    {
      "url": "https://www.investors.com:443/research/apple-stock-meta-taiwan-semi-stock/",
      "url_mobile": "",
      "title": "Apple Stock And Two Other 2024 Winners Are On Fund Manager Radars",
      "seendate": "20241224T023000Z",
      "socialimage": "https://www.investors.com/wp-content/uploads/2024/09/Stock-Apple-iPhone16f-company.jpg",
      "domain": "investors.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": null,
      "recency_weight": 1.0,
      "content": "Investors are not alone as they look toward 2025 by looking back on the leaders of 2024. Big funds are leaning toward leaders such as Apple (AAPL), which outperformed during the year as well. IBD's screen of stocks funds are buying shows Taiwan Semiconductor (TSM,) Meta Platforms (META) and Apple among those getting the most demand. Taiwan Semiconductor is breaking…"
    },
    {
      "url": "http://baystreet.ca/stockstowatch/19857/Todays-Stock-News-on-Honda-Apple-and-Energy-Stocks",
      "url_mobile": "/amp/articles/stockstowatch.aspx?articleid=106916",
      "title": "Baystreet . ca - Today Stock News on Honda , Apple , and Energy Stocks",
      "seendate": "20241224T171500Z",
      "socialimage": "http://baystreet.ca/images/articlegroups/original/7/private/apple.jpg",
      "domain": "baystreet.ca",
      "language": "English",
      "sourcecountry": "Canada",
      "coverage_count": 1,
      "days_ago": null,
      "recency_weight": 1.0,
      "content": "The automotive industry is shaking up as it tries to catch up with Tesla’s (TSLA) lead in electric vehicles. Honda (HMC) jumped by 12.72% to start this week’s trade after announcing merger talks with Nissan (NSANY).\nNSANY stock already last week on Dec. 17 in anticipation of the news. The merger would create the third-largest automaker as measured by sales. The two firms would be behind Toyota (TM) and Volkswagen (VLKAF). Honda said the merger creates a competitive edge that the current collaboration framework does not offer.\nBe wary of HMC stock from here. The deal creates operational headwinds. Toyota will widen its lead in hybrid vehicles while Tesla continues to dominate the EV market.\nApple (AAPL) closed at a fresh all-time high on Monday. At 3.931 trillion dollars in market cap, the $4 trillion level is next. While the rise is inevitable, AAPL stock risks pulling back. The firm’s iPhone does not offer compelling features that would ignite an upgrade supercycle among its customers.\nEnergy stocks are in a downward trend that is due to end. Wait for WTI crude prices to stabilize. When it does, Occidental Petroleum (OXY) has the best risk-reward profile. The stock trades at a 13.11 times P/E multiple. Exxon Mobil (XOM) could also rebound after it fell from $122 last month to close recently at around $106.00."
    },
    {
      "url": "https://biztoc.com/x/97a8dfca8839489f",
      "url_mobile": "",
      "title": "Where Will Apple Stock Be in 1 Year ? ",
      "seendate": "20241224T023000Z",
      "socialimage": "https://biztoc.com/cdn/97a8dfca8839489f_s.webp",
      "domain": "biztoc.com",
      "language": "English",
      "sourcecountry": "",
      "coverage_count": 1,
      "days_ago": null,
      "recency_weight": 1.0,
      "content": "Airbus ordered an immediate software rollback across its A320 fleet after an incident exposed corrupted flight data, grounding thousands of jets and threatening widespread holiday travel chaos.\nMarkets closed the holiday week on a cautious, mixed note: the S&P 500 eked out gains while the Nasdaq led on AI-related strength and the Dow lagged amid travel-sector weakness. Volatility ticked up after the Airbus recall and safe-haven flows supported gold. Tech and AI names remain the main catalysts, offsetting weakness in energy and airlines.\nAirbus ordered an emergency recall after a mid-air incident exposed a software vulnerability in A320-family jets. The move forces rapid software rollbacks and threatens major holiday travel disruptions for carriers worldwide.\n11.8B - Record US online Black Friday spending reported by Adobe.\nAirlines raced to apply the mandated A320 software fix, causing cancellations and delays at major hubs. Carriers and airports scrambled to restore schedules as regulators monitored safety compliance.\nTop FDA officials signalled tougher vaccine approval standards after an internal review raised safety questions. The agency said it will tighten pre-approval hurdles for new and annual vaccines.\nRegenix, a mid‑cap biotech, beat revenue and profit expectations and raised full‑year guidance after strong adoption of its flagship therapy—shares jump on the outlook.\nSenior FDA staff publicly questioned COVID vaccine safety without releasing full data, provoking calls for transparency. Agency leaders defended conclusions while public-health experts demanded access to the evidence.\nPresident Trump declared the airspace above and around Venezuela closed, intensifying regional tensions and sowing confusion for carriers. Airlines and foreign governments face fresh security and diplomatic uncertainty.\nElectric-vehicle maker Electra Motors slashed its production targets and cut forward guidance after supply-chain setbacks, triggering a steep sell-off in the stock.\nThe White House signaled plans to pardon former Honduran president Juan Orlando Hernández, provoking bipartisan backlash. The move has immediate diplomatic and legal implications amid regional drug-trafficking prosecutions.\nUkraine released footage of kamikaze naval drones striking Russia-linked tankers, underscoring rising maritime risks in the Black Sea. The strikes threaten energy logistics and escalate naval confrontation between Kyiv and Moscow.\nFDA signals tighter vaccine-approval standards; China doubles down on crypto curbs and stablecoin controls; U.S. halts asylum decisions and pauses visa processing amid security review.\nA corruption probe triggered the resignation of a top Zelensky aide, deepening Ukraine’s political turmoil. Reports say the sacked official relocated to the front line amid mounting investigations.\nGaza’s health authorities reported the Palestinian death toll has exceeded 70,000 since the start of the Israel-Hamas war. Human-rights allegations have emerged after raids in contested areas.\n\"This is the single biggest short-term shock to global travel since 9/11.\"— Mark Lewis — Aviation analyst\nHong Kong’s deadliest fire in decades has sparked probes into renovation practices and possible corruption. Beijing ordered nationwide building safety inspections as scrutiny intensifies.\nBlack Friday online sales surged to record levels as shoppers leaned on e-commerce and AI-driven search. Retailers and analytics firms reported strong digital receipts despite broader economic unease.\nCompanies supplying data centers and chips to AI giants have borrowed heavily, creating a $96 billion debt pile tied to OpenAI-led demand. Analysts warn the leverage could amplify risks if AI revenue growth slows.\nMicron confirmed plans for a major $9.6 billion investment in western Japan to secure high-bandwidth memory capacity for AI workloads. The move aims to diversify supply amid geopolitical risk to Taiwan-based manufacturing.\nGold surged this year while Bitcoin slumped, highlighting a sharp safe-haven rotation and liquidity preferences. Investors and central banks favored metal for trust and stability amid market stress.\nA long trading streak above the 50-day moving average ended, prompting warnings about higher downside risk. Yet markets staged a Thanksgiving-week rally, leaving analysts split on December momentum.\nChina’s central bank and regulators signalled a renewed crackdown on crypto activity, flagging stablecoin risks and curbing token issuance. The moves tighten the policy backdrop for global crypto markets.\nFloods and landslides in Indonesia have killed hundreds and left many missing, stretching emergency services. Rescue efforts continue as weather improves and bodies are recovered across hard-hit regions.\nOil logistics in the Black Sea and Russian refinery operations were hit by drone attacks and loading halts, tightening near-term supply flows. Energy firms and traders are monitoring potential knock-on effects on prices.\nArmed conflicts and attacks\nDisasters and accidents\nSports"
    },
    {
      "url": "https://www.fool.com/investing/2024/12/23/where-will-apple-stock-be-in-1-year/?source=iedfolrf0000001",
      "url_mobile": "",
      "title": "Where Will Apple Stock Be in 1 Year ? | The Motley Fool",
      "seendate": "20241224T084500Z",
      "socialimage": "https://g.foolcdn.com/editorial/images/801668/apple-stock-price-outlook-2025.jpg",
      "domain": "fool.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": null,
      "recency_weight": 1.0,
      "content": "Apple(AAPL+0.47%)has done its part to lift the holiday spirits of its shareholders as 2024 comes to an end. At the time of this writing, the stock has surged 30% year to date, continuing the company's tradition of crushing Wall Street. Indeed, Apple's 269% return in just the past five years has more than tripled theS&P 500index's 82% gain over the same period.\nShould investors expect the rally to continue in 2025 with another record-breaking year for this consumer electronics juggernaut? Let's explore where Apple stock might be by this time next year.\nThere's a lot to like about Apple, which has cemented itself as one of the world's most influential consumer brands and technology innovators. The company's premium device lineup, from its flagship iPhone and Mac computers to its expanding collection of wearables and accessories, is recognized for its exceptional quality and fervent customer loyalty.\nIt's no coincidence that legendary investor Warren Buffett counts Apple as the single largest holding within thestock portfolioof his financial conglomerateBerkshire Hathaway. Buffett has long emphasized the importance of sticking with companies that offer a superior product that consumers love as a key trait for long-term success. By all indications, Apple will continue growing and hold its leadership position for decades. Individual investors will be hard-pressed to find another stock with Apple's fundamental strength and competitive moat.\nLooking ahead, Apple isn't simply resting on its past achievements. The company is advancing a strategic vision centered on leveraging newartificial intelligencecapabilities across its devices and broader services ecosystem.\nApple CEO Tim Cook believes the recently launched Apple Intelligence platform marks a \"new era\" for the company, integrating features like generative text and generative images, and a more advanced Siri voice assistant chatbot. The effort enhances the user experience with fun and productivity-boosting tools while also opening new growth channels. Overall, Apple has a strong operating and financial tailwind highlighting its positive outlook.\nImage source: Getty Images.\nWith more than 2.2 billion active Apple devices worldwide, Apple Intelligence stands to deliver the power of AI to the masses in a familiar and easy-to-use interface. The expectation is that the company will benefit not only from increased interest in the new technology kick-starting a refresh cycle but also from a resilient macroeconomic backdrop.\nCompared to Apple's completed fiscal 2024 (for the period ended Sept. 28) in which revenue increased by a modest 2%, Wall Street analysts are projecting a stronger 2025 with a 6% growth rate. Even more impressive is the 21.5% higher estimated earnings per share (EPS) this new year, driven by improving profitability margins from Apple's diverse group of high-growth services. Apple's results over the next few quarters, including the ongoing holiday shopping season, will be critical to Apple Intelligence's early impact.\nData source: Yahoo Finance. YOY = year over year.\nBefore investors get too excited about the company's potential in 2025, a couple of points warrant some caution.\nShares of Apple are trading at 34 times its consensus 2025 EPS, a level that is now well above the five-year average for the valuation multiple closer to 29 suggesting the stock is relatively expensive. While Apple's strengthening position as an AI-powered consumer brand with growing services revenue could justify that premium valuation, questions remain about how much higher the earnings multiple can expand. An argument could be made that the company's strong near-term outlook is already reflected in the stock price. Nevertheless, the bullish case for the stock is that Apple manages to outperform expectations.\nAAPL PE Ratio (Forward)data byYCharts\nIt likely won't be a straight line higher, but I see a good chance that Apple will be trading at a higher share price in one year. Unless there is some clear evidence that the circumstances have materially changed, the prudent move for investors is to stay the course. Apple remains a great stock that deserves a spot within a diversified portfolio.\nDan Victorhas no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple and Berkshire Hathaway. The Motley Fool has adisclosure policy.\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.\nRelated Articles\nInvest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services.\nMaking the world smarter, happier, and richer.\n©1995-2025The Motley Fool. All rights reserved.\nMarket data powered byXigniteandPolygon.io.\nAbout The Motley Fool\nOur Services\nAround the Globe\nFree Tools\nAffiliates & Friends"
    },
    {
      "url": "https://www.benzinga.com/markets/24/12/42668097/warren-buffett-heads-into-2025-with-325-billion-cash-pile-his-largest-in-over-three-decades-expert-says-it-will-provide-an-opportunity-for-the-successors-to-make-their-own-mark",
      "url_mobile": "",
      "title": "Warren Buffett Heads Into 2025 With $325 Billion Cash Pile , His Largest in Over Three Decades : Expert Says It  Will Provide An Opportunity For The Successors To Make Their Own Mark  - Apple ( NASDAQ : AAPL ), Bank of America ( NYSE : BAC ) ",
      "seendate": "20241224T140000Z",
      "socialimage": "https://cdn.benzinga.com/files/images/story/2024/12/24/1--Transformation-Of-Berkshire-Hathaway.jpeg?&fit=crop",
      "domain": "benzinga.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": null,
      "recency_weight": 1.0,
      "content": "Warren Buffettis entering 2025 with the largest cash reserve atBerkshire Hathaway(NYSE:BRK) (NYSE:BRK) in over three decades.\nWhat Happened: The conglomerate’s cash holdings have reached a staggering $325 billion, marking the highest percentage of total assets since 1990, CNBCreportedon Tuesday.\nThis cash accumulation comes as Buffett, 94, finds few attractive investment opportunities amid a highly valued market. The “Buffett indicator,” which compares the total market value of U.S. stocks to GDP, has soared to 209%, a level not seen since the 1929 market peak, according to Oppenheimer data.\nThroughout 2024, Buffett sold significant portions of his largest holdings, includingApple Inc.(NASDAQ:AAPL) andBank of America Corp.(NYSE:BAC), offloading $133 billion in stocks during the year’s first three quarters. Despite this, Berkshire’s shares rose 27% in 2024, its best performance since 2021.\nSee Also:Smith & Wesson’s Fate Hangs In The Balance As Supreme Court Weighs Mexico’s Gun Trafficking Lawsuit: SWBI Stock Down 27% Over Past Month, Here’s What’s Next\nBuffett’s strategy may involve waiting for a major acquisition opportunity, potentially benefiting his successor,Greg Abel. AnalystKevin Healfrom Argus Research suggests that some of the cash could be used for investments in distressed situations, allowing successors to leave their mark.\n\"This will also provide an opportunity for the successors to make their own mark when Mr. Buffett ocially hands over the reins.\"\nWhy It Matters: This substantial cash reserve positions Berkshire Hathaway for strategic maneuvers in the coming years. Recently, Buffett’s investment activities have shown a shift. In December, Berkshire significantly increased its stake inOccidental Petroleum Corp.(NYSE:OXY), acquiring approximately 8.9 million shares over a few days. This move, totaling around $405 million, raised Berkshire’s ownership to 28% of Occidental, valued at approximately $12 billion.\nPrice Action:As perBenzinga Pro, BRK.A’s YTD returns rose by 25.69% while that of BRK.B increased by 25.35%\nRead Next:\nDisclaimer: This content was partially produced with the help ofBenzinga Neuroand was reviewed and published by Benzinga editors.\nImage via Shutterstock\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\nA newsletter built for market enthusiasts by market enthusiasts. Top stories, top movers, and trade ideas delivered to your inbox every weekday before and after the market closes."
    },
    {
      "url": "https://www.investors.com:443/news/technology/apple-stock-record-high-strong-holiday-sales/",
      "url_mobile": "",
      "title": "Apple Stock Hits Record High Amid Strong Holiday Sales | Investor Business Daily",
      "seendate": "20241223T220000Z",
      "socialimage": "https://www.investors.com/wp-content/uploads/2024/12/Stock-Apple-Bags-company.jpg",
      "domain": "investors.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 2,
      "days_ago": null,
      "recency_weight": 1.0,
      "content": "Apple(AAPL) stock notched a record high on Monday after a Wall Street analyst said the consumer electronics giant is likely to have strong holiday season sales.\nWedbush Securities analyst Daniel Ives reiterated his outperform rating on Apple stock with a 12-month price target of 300.\nOn thestock market today, Apple stock jumped to a record high of 255.65 after the opening bell. It pulled back after hitting that milestone but recovered late in the day.\nApple stock ended the regular session up 0.3% to close at 255.27.\nIn a client note before the market open, Ives said he believes Apple will reach a $4 trillion market cap in early 2025. On Monday, its market cap was nearly $3.86 trillion.\nApple should benefit from an AI-driven upgrade cycle, which is just getting started with the iPhone 16, Ives said.\n\"We would characterize demand for iPhone 16 so far since its September launch as slightly ahead to generally in line with expectations globally,\" Ives said. \"We believe Apple is set to have a strong holiday season ahead as iPhone 16 upgrades across its installed base are trending well into Christmas, based on our recent Asia supply chain checks.\"\nApple has an installed base of 1.5 billion iPhones with about 300 million iPhones in the window of an upgrade opportunity, he said.\nIves noted that Apple is slowly rolling out artificial intelligence features for its iPhones, starting with English-language markets.\n\"Importantly, Apple Intelligence has not rolled out in China or many other countries with April the likely timetable for these AI launches along with a Chinese tech partner also named very soon to catalyze the timing of this rollout in this key region,\" Ives said.\nLast week, Reuters reported thatApple is in talks with Chinese tech firmsTencent(TCEHY) and ByteDance about using their AI models in its iPhones in China.\n\"This will be a multiyear AI journey that will define the future for Apple with its next-generation chip architecture, hardware releases, and future iPhone models built around the AI foundation that many consumers will ultimately embrace,\" Ives said.\nApple stock is on theIBD Tech Leaderslist.\nFollow Patrick Seitz on X, formerly Twitter, at@IBD_PSeitzfor more stories on consumer technology, software and semiconductor stocks.\nYOU MAY ALSO LIKE:\nNvidia, AI Chip Stocks Get Lift From Bullish Morgan Stanley Report\nAI Fueling Duolingo's Next Growth Phase, Analyst Says\nSee Stocks On The List Of Leaders Near A Buy Point\nFind Winning Stocks With MarketSurge Pattern Recognition & Custom Screens\nJoin IBD Live For Stock Ideas Each Morning Before The Open"
    },
    {
      "url": "https://qz.com/apple-appl-ai-intelligence-4-trillion-market-cap-2025-1851727371",
      "url_mobile": "",
      "title": "Apple could hit a $4 trillion market cap by early 2025",
      "seendate": "20241223T153000Z",
      "socialimage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/c5eb61acbf58c4ff2cb35e9b2161d79d.jpg",
      "domain": "qz.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": null,
      "recency_weight": 1.0,
      "content": "Apple’s (AAPL)artificial intelligence rolloutcould drive demand for the iPhone 16 this holiday season — and send the tech giant’s market value to a new record high.\nAnalysts at Wedbush, led by Dan Ives, said in a recentnotethat the Cupertino, California-based company “is set to have a strong holiday season ahead as iPhone 16 upgrades across its installed base are trending well into Christmas.”\nIn particular, Apple stands to sell upwards of 240 million iPhones in the 2025 fiscal year, fueled by AI-driven upgrades. The researchers said this could be “the highest iPhone unit sales year in Apple’s history.”\nShares of Apple closed at $254.49 each Friday, up nearly 2%. So far this year, the company’s stock has surged 37%, lifting its market capitalization to $3.85 trillion. That makes it the most valuable company in the world, followed by Nvidia (NVDA) and Microsoft (MSFT).\nWedbush maintained its $300 price target, and said Apple is on track to become the first company to hit a $4 trillion market cap by early 2025.\nAlthough iPhonesales jumped 6%year-over-year in the September quarter to $46.22 billion, the company’s annual revenue grew just 1% in the 2024 fiscal year.\nWhile the company has been banking on its new AI features, known as Apple Intelligence, to supercharge sales, some analysts have warned thatmore substantial innovationswill be needed to drive interest.\nWedbush said the “naysayers” are overlooking key opportunities within the company. With 2 billion iOS devices currently in use worldwide and 1.5 billion iPhones, Wedbush believes that there are  approximately 300 million iPhones that haven’t been upgraded within the past four years.\nThat, combined with a strong services business and the massive potential for Apple users to tap into AI through their iOS devices, could give Apple the boost it’s been gearing up for, the analysts said.\n“We believe the success of iPhone 16 with a strong holiday season ahead over the next week will be the launching pad for a renaissance of growth in Cupertino over the next 12 to 18 months,” they wrote."
    },
    {
      "url": "https://www.benzinga.com/24/12/42656752/5-tech-stocks-to-buy-as-ai-hype-fizzles",
      "url_mobile": "",
      "title": "5 Tech Stocks to Buy as AI Hype Fizzles - Apple ( NASDAQ : AAPL ), CACI International ( NYSE : CACI ) ",
      "seendate": "20241223T191500Z",
      "socialimage": "https://cdn.benzinga.com/files/images/story/2024/12/23/investor-charts-ai2.png?&fit=crop",
      "domain": "benzinga.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": null,
      "recency_weight": 1.0,
      "content": "Fed chair Powell dropped a big lump of coal in the market’s stocking last week as he reigned in the Fed’s rate cut projections for 2025. While the Fed cut its key benchmark rate by the expected 25 basis points, Powell tempered expectations on future rate cuts based on sticky inflation data and the continued robust spending from American consumers.\nThe Fed's so-called ‘dot plot,' which anticipates the frequency and strength of future rate activity, now indicates only two rate cuts in 2025, with a Fed funds rate at 3.75% – 4.00% by the end of next December.\nMarkets did not take kindly to the news, and major indices closed starkly lower after being flat for most of the day. Nasdaq led the losers, with the tech-heavy index dropping more than 3.5%.\nAfter hours, AI-darling Micron Technology added to the pain with a significant earnings miss, and the stock had itsworst performance since March 2020the following day. Add in a close-call government shutdown and low holiday trading volume, and it was the perfect storm for some year-end volatility. And it won’t stop there.\nA cautious Fed means cautious investors and a change in strategy is necessary for 2025.\nIs this the end of the AI-infused tech rally? The prospects of rate reductions slashing capital costs and juicing stock prices have diminished, and AI stocks are beginning to see some cracks form. Even the stalwart NVIDIA is in correction territory after touching the $152 mark earlier this month. While AI isn't exiting the investment landscape anytime soon, the big winners over the last two years look to be finally taking a breather. In their place, we've identified five tech stocks not dependent on AI that could lead the way in 2025.\nGoogle-parent Alphabet Inc. seems to battle antitrust action every few years, causing a drawdown that eventually rebounds once investors realize the company still makes boatloads of cash every quarter. GOOG revenue and earnings have increased every quarter since March 2023, and profit margins are finally back above 27% for the first time since March 2022. The stock slumped in the summer following a poor earnings report and again in November on (you guessed it)antitrust concerns, but it’s currently back near all-time highs.\nGoogle's recent quantum computing breakthrough unveiled a chip capable of speeds beyondany in the known universe, which could become an investment theme in 2025 (more on that later). Additionally, Waymo is one of the most significant success stories related to autonomous driving to date. The companyrecently announceda new service in Tokyo, its first international city, and recent testing data continues to show impressivesafety statistics. Alphabet is also the parent of YouTube, which is the dominant way people consume podcasts and short-length videos and its YouTubeTV streaming service has an impressive sports package (and little pushback to price increases).\nIt's been a tumultuous year for Uber. The company finally posted a positive annual net income figure in 2023, and the stock rallied from $25 to $80 between December 2022 and February 2024. But the rally stalled there, and the stock bounced between $60 and $80 for most of the last nine months.\nWe think this recent drawdown is overdone, and the stock could be poised for a rally in 2025. Despite the proliferation of Waymo, Uber is still the dominant force in rideshare, and its ride-hailing market share is actually expanding compared to its biggest rival, Lyft. From a technical standpoint, the stock is oversold according to the Relative Strength Index (RSI) and the 50-day moving average is still hovering above the 200-day MA. As long as the 50-day stays above the 200-day, UBER shares might be an interesting buy at this level.\n[End-of-Year Sale: Unlock Benzinga Pro for 60% Off]\nAs mentioned above, if AI takes a breather over the next few months, one investment theme that could emerge is quantum computing. Quantum computing stocks have rallied hard in the last month, led by the aptly named Quantum Computing Inc. (NASDAQ:QUBT). However, Quantum Computing Inc. used to be known as Innovative Beverage Group, which raises some questions about its dedication to the industry. There may be better choices to take advantage of this trend, like Rigetti Computing Inc.\nRGTI shares also experienced a meteoric rise over the last month, but not at the level of QUBT despite a much longer history in the quantum computing space. That could be a good development for investors, as Rigetti is better positioned to thrive if quantum computing takes off thanks to itsinnovative product lineand decade-plus history in the industry.\nCACI provides technology solutions as a defense contractor, and it could see tailwinds in the coming months due to an increased focus on defense spending in the incoming Trump administration and its sterling business reputation. CACI International provides cybersecurity, cyberspace and digital solutions for domestic and international clients.\nCACI shares may have been unfairly unloaded as the price plunged down to $400 after approaching $580 in early November. The RSI reading of 27 indicates an oversold stock, and the company has good fundamentals with a 19.9 P/E ratio and a consensus Buy rating from analysts.\nSometimes, you don't need to overthink it. Apple has been one of the biggest winners in the tech sector since Trump's election, and the company's cash pile is the envy of the business world. Despite already being one of the largest companies in the world by market cap, investors may have an opportunity here as the AI rally spins down.\nAAPL is a staple in any long-term investment portfolio, but the time is ripe to add more shares. The stock has been roaring upward since May 2024 and made another new all-time high as the third week of December came to a close. AAPL is now approaching a $4 trillion market cap, and its rally could continue in 2025 if the company is granted tariff exemptions similar to the ones it received during the first Trump administration.\nDon't let profit opportunities slip away in 2025. Get Benzinga Pro today and receive exclusive market news alerts 30 minutes ahead of the competition. Trade smarter with powerful tools at 60% off. Act now—this deal ends December 31!\nInage via Midjourney\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\nA newsletter built for market enthusiasts by market enthusiasts. Top stories, top movers, and trade ideas delivered to your inbox every weekday before and after the market closes."
    },
    {
      "url": "https://www.insidermonkey.com/blog/jim-cramer-on-apple-inc-aapl-i-say-own-it-dont-trade-it-its-so-far-the-biggest-position-in-our-trust-1411514/",
      "url_mobile": "https://www.insidermonkey.com/blog/jim-cramer-on-apple-inc-aapl-i-say-own-it-dont-trade-it-its-so-far-the-biggest-position-in-our-trust-1411514/?amp=1",
      "title": "Jim Cramer on Apple Inc . ( AAPL ):  I Say Own It Dont Trade It . . . It So Far The Biggest Position In Our Trust  ",
      "seendate": "20241221T130000Z",
      "socialimage": "https://d2gr5kl7dt2z3t.cloudfront.net/blog/wp-content/uploads/2023/09/19155253/AAPL-insidermonkey-1695153171712.jpg",
      "domain": "insidermonkey.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": null,
      "recency_weight": 1.0,
      "content": "We recently compiled a list of theJim Cramer Latest Stocks: 23 Stocks He Just Talked About.In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against the other stocks Jim Cramer recently talked about.\nWith the Federal Reserve’s December meeting over, Wall Street has now shifted into a new paradigm. While the central bank did cut interest rates by 25 basis points in a widely anticipated move, the bank also signaled that 2025 might be accompanied by fewer interest rate cuts than many might have anticipated. In fact, not only are markets convinced that the Fed will cut less in 2025, but some even believe that the interest rates might be hiked especially since the central bank’s median 2025 inflation outlook is 2.5% which is higher compared to the earlier 2.1%.\nWhile the Fed’s announcements and the press conference sent the flagship S&P index by 3.2%, Jim Cramer explained how the stock market as a whole isn’t doing that well. On the episode of Squawk On The Street the day of the interest cut, he stated “Look at the material stocks, look at anything related to industrial export. Look at the housing stocks. David, there are cohorts that are indeed rolling over. It isn’t like everything is just super strong and everything is quantum computing and Rocket Lab!”\nCramer added that while some believe that sections of the economy such as retail are strong, there might be a need to look deeper. “Look there’s this growing consensus not represented necessarily in these Fed fund futures but that just says why are they doing this? And I come back and say why are they doing this,” said Cramer, adding “So I think that the talking heads, and boy are there ever a lot of talking heads, have decided that look that if you look at what we’re seeing in some retailers, things are strong. By the way in retail, it’s not strong either if you count colds.”\nGoing against the trend, he stressed the need to look into the data to find the right stocks. According to him, “I don’t know where these people get that things are strong, they look at the aggregate numbers, I look at the individual companies, I am trying to find companies that are strong.” Cramer was also perplexed by the Atlanta Fed’s Q4 3.2% GDP growth estimates. He shared that he’s “trying to find why. I’m trying to find where that is. You know David that travel’s very strong yeah. Leisure’s very strong. Dining out’s very strong. These are strong and by the way, they’re very obvious, they look obvious to the Atlanta Fed. I don’t know what kind of weighting they have but wow.”\nThe American economy wasn’t the only economy on Cramer’s mind. While he might be having a hard time believing the GDP estimates, there isn’t a doubt in his mind that the US is the best place to invest. Cramer shared that he’s “trying to find countries, maybe Argentina making a comeback, but it’s very difficult to find a country that I would invest in,” but it’s very difficult to “find a country that isn’t upset in turmoil or something.”\nSpeaking of other countries, Cramer believes that China “is behind so much of what’s going wrong. But they are never, other than [BY] Peter Navarro, called out.” On how the “media and other coverage says that China is in a depression,” Cramer has “to believe it because I don’t believe a single number they send. We used to be able to look at their electric power. . . . .how about when they used to do employment of youth.”\nOne economic sector that he’s worried about is the automobile industry. Cramer doesn’t “understand why the problems with autos are not so visible among the cognoscenti,” something he believes is very important since autos “is a huge industry. Employs a lot of people. And the layoffs and the ramifications of what could happen here and other mergers.” China is “getting away with murder, they really are, they’re getting away with wiping out industries all over the world,” Cramer said, adding that “there’s only one guy who actually stands up them, and even he was saying that he has a good relationship with Xi. And that is President-elect Trump.”\nHowever, on an optimistic note, Cramer believes that the “Mag 7 seems almost immune even to China. Which they never really got into.”\nOur Methodology\nTo make our list of the latest stocks on Jim Cramer’s mind, we made a list of the stocks he talked about during a fresh episode of CNBC’s Squawk In The Morning.\nFor these stocks, we also mentioned the number of hedge fund investors. Why are we interested in the stocks that hedge funds invest in? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points. (see more details here).\nA wide view of an Apple store, showing the range of products the company offers.\nNumber of Hedge Fund Holders In Q3 2024: 158\nApple Inc. (NASDAQ:AAPL) is the most valuable consumer electronics firm in the world and one whose valuation could touch $4 trillion soon. As it generates 51.6% of its revenue from the iPhone, the iconic smartphone lineup is baked into Apple Inc. (NASDAQ:AAPL)’s hypothesis. The stock responds to even the slightest of credible news of the smartphone either facing reduced demand or Apple Inc. (NASDAQ:AAPL) deciding to lower its manufacturing orders to contract manufacturers. The high valuation approaching a $4 trillion market cap and the iPhone’s criticality was also on Cramer’s mind as he started by discussing how Apple Inc. (NASDAQ:AAPL)’s high P/E ratio hasn’t dissuaded buyers:\n“And people will not stop buying it. . . .Well David, I mean one of the things that’s happening is is there’s people who just say we’re getting away from the cellphone cycle.\n“I say own it don’t trade it. . . it’s so far the biggest position in our trust. But I do think that if we can just get away from the [IPHONE] 17, or the 17 and 18, the 19, get away from that and make this much more of a service story. Now Tim Cook bridles if you say look, it’s Razor, Razor Blade. Because this is a tech company with the highest satisfaction. But I do think that if you could make it so that the service revenue is the thing and you’ve got China, without China orders [inaudible] so Apple’s no longer dependent on just China orders. And you get a higher multiple, but this multiple has to be followed up by a dynamite 2025.\n“I mean I was going over my core holdings for tomorrow’s speech, and it’s still a core holding. I don’t know what to say. Would I come in and buy the stock right now? I mean I’d think I’d wait for a bit of a comeback, it’s just been, it trades like uh, Oklo. And it’s Apple. Unbelievably great company. I don’t know what to do. This is a total quandry for me. How do you tell people to buy Apple at that multiple when it doesn’t have that kind of consistency. And you have to believe that what they do have is a plan to be able to, so that they are out of the cycle business.”\nOverall AAPLranks 3rdon our list of the stocks Jim Cramer recently talked about. While we acknowledge the potential of AAPL as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than AAPL but that trades at less than 5 times its earnings, check out our report about thecheapest AI stock.\nREAD NEXT:8 Best Wide Moat Stocks to Buy Nowand30 Most Important AI Stocks According to BlackRock.\nDisclosure: None. This article is originally published atInsider Monkey.\nYahoo Finance\nReturns since its inception in May 2014 (through August 15th, 2025)\n30 day money back guarantee. Cancel anytime.\nWarren Buffett\nBerkshire Hathaway\n$293,447,417,000\nDavid Einhorn\nGreenlight Capital\n$1,491,303,000\nGeorge Soros\nSoros Fund Management\n$5,416,602,000\nJim Simons\nRenaissance Technologies\n$77,426,184,000\nLeon Cooperman\nOmega Advisors\n$1,886,381,000\nCarl Icahn\nIcahn Capital LP\n$22,521,664,000\nSteve Cohen\nPoint72 Asset Management\n$22,767,998,000\nJohn Paulson\nPaulson & Co\n$3,510,256,000\nDavid Tepper\nAppaloosa Management LP\n$4,198,712,000\nPaul Tudor Jones\nTudor Investment Corp\n$6,160,740,000"
    },
    {
      "url": "https://macdailynews.com/2024/12/20/apple-shares-hit-new-all-time-intraday-and-closing-highs-241220/",
      "url_mobile": "https://macdailynews.com/2024/12/20/apple-shares-hit-new-all-time-intraday-and-closing-highs-241220/amp/",
      "title": "Apple shares hit new all - time intraday and closing highs",
      "seendate": "20241220T221500Z",
      "socialimage": "",
      "domain": "macdailynews.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": null,
      "recency_weight": 1.0,
      "content": "In Nasdaq trading today, shares of Apple Inc. (AAPL) rose $4.70, or 1.87%, to $254.46, a new all-time closing high. Apple’s intraday high was also set today at $255.00.\nApple’s 52-week low stands at $164.08.\nMonday’s trading volume for AAPL shares was a raucous 125,429,724 versus Apple’s average trading volume of 42,989,052 shares.\nApple’s PE Ratio currently stands at 41.93.\nApple currently has a market value of $3.847 trillion, making it the world’s most valuable company.\nThe top five U.S. publicly-traded companies, based on market value:\nSelected companies’ current market values:\n• Meta Platforms (META) – $1.477T• Tesla (TSLA) – $1.352T• Taiwan Semi (TSM) – $1.023T\n• Berkshire Hathaway (BRK-A) – $980.375B• Walmart (WMT) – $741.080B\n• Netflix (NFLX) – $388.581B• Cisco (CSCO) – $233.071B• IBM (IBM) – $206.556B• Disney (DIS) – $202.825B• Adobe (ADBE) – $196.844B• Advanced Micro Devices (AMD) – $193.455B• Sony (SONY) – $128.988B\n• Spotify (SPOT) – $93.011B• Intel (INTC) – $84.190B• SoftBank (SFTBF) – $81.690B• Dell (DELL) – $81.162B• Hewlett-Packard (HPQ) – $30.891B• Nokia (NOK) – $23.873B• SiriusXM (SIRI) – $7.829B• BlackBerry (BB) – $2.180B• Sonos (SONO) – $1.773B\n• RealNetworks (RNWK) was delisted from U.S. exchanges on December 21, 2022 and is no longer publicly traded.\nApple all-time high (AAPL) via NASDAQhere.\nWe are currently about 1/4th of the way to being sustainable with Substack subscriptions.\nPlease tell your Apple-loving friends aboutMacDailyNews on Substackand, if you’re currently a free subscriber, please consider $5/mo. or $50/year to keep MacDailyNews going. Just hit the subscribe button. Thank you!\nRead on Substack\n‎Please help support MacDailyNews — and enjoy subscriber-only articles, comments, chat, and more — by subscribing to our Substack:macdailynews.substack.com. Thank you!\nSupport MacDailyNews at no extra cost to you byusing this link to shop at Amazon."
    },
    {
      "url": "https://www.insidermonkey.com/blog/dan-niles-says-apple-aapl-new-iphone-features-werent-particularly-good-highlights-slowing-growth-1410223/",
      "url_mobile": "https://www.insidermonkey.com/blog/dan-niles-says-apple-aapl-new-iphone-features-werent-particularly-good-highlights-slowing-growth-1410223/?amp=1",
      "title": "Dan Niles Says Apple ( AAPL ) New iPhone Features Werent  Particularly Good , Highlights Slowing Growth",
      "seendate": "20241219T184500Z",
      "socialimage": "https://d2gr5kl7dt2z3t.cloudfront.net/blog/wp-content/uploads/2023/09/19155253/AAPL-insidermonkey-1695153171712.jpg",
      "domain": "insidermonkey.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": null,
      "recency_weight": 1.0,
      "content": "We recently published a list ofWall Street Analysts Can’t Stop Talking About These 10 AI Stocks. In this article, we are going to take a look at where Apple Inc (NASDAQ:AAPL) stands against other stocks Wall Street analysts can’t stop talking about.\nHenry Ajder, Latent Space Advisory founder, said in a latest program on CNBC that lack of fresh data remains a key challenge for the performance of AI systems after a period of “huge” developments and fast learning.\n“I think data is the real problem here. We have a finite amount of data available on the internet and a limited number of sources for live, fresh data. I believe this is becoming an increasingly significant challenge, especially as legal issues surrounding how companies obtain and use data are becoming more prominent,” the analyst said.\nAjder believes there won’t be a complete “halt” to the progress in AI systems but in 2025 we are expected to see a slowdown. Answering a question about the AI’s ability to make up data, called synthetic data” to train itself, the analyst said this domain has shown promise but there are risks of synthetic data potentially corrupting the training models.\nREAD ALSO:7 Best Stocks to Buy For Long-Termand8 Cheap Jim Cramer Stocks to Invest In\nFor this article we picked 10 AI stocks currently trending based on latest news. With each stock we have mentioned the number of hedge fund investors. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points(see more details here).\nA wide view of an Apple store, showing the range of products the company offers.\nNumber of Hedge Fund Investors: 158\nDan Niles, Niles Investment Management founder and portfolio manager, said while talking to CNBC earlier this month that Apple Inc (NASDAQ:AAPL) is one of the stocks that should worry investors. He explained his case:\n“The company has grown revenues cumulatively, if you include this year’s calendar year, at 5% over the last 3 years. And every product, you know, people go, ‘Oh my God, Vision Pro is going to be terrific,’ and then you figure out, no, nobody’s going to wear ski goggles on their head. Then you look at what’s going on with the iPhone and the features they’ve rolled out, which surprised me because they weren’t particularly good to start with. They’re going to get upgraded in December in the US, but then you have to wait for next year for it to be upgraded in the rest of the world. And you’ve got a company that’s also trading at a 33 P/E for 5% revenue growth over the past three years combined. So that’s the other one where if people finally go, ‘You know what? The problem isn’t this. It’s market share losses to people like Huawei that have resurged in China.’”\nParnassus Growth Equity Fund stated the following regarding Apple Inc. (NASDAQ:AAPL) in itsQ3 2024 investor letter:\n“Apple Inc.(NASDAQ:AAPL) shares rose during the quarter, making our underweight position a relative detractor. Investors reacted positively to the new iPhone 16 lineup and its advanced features, including generative artificial intelligence, greater durability and increased processing power.”\nOverall, AAPLranks 6thon our list of stocks Wall Street analysts can’t stop talking about. While we acknowledge the potential of AAPL, our conviction lies in the belief that under the radar AI stocks hold greater promise for delivering higher returns, and doing so within a shorter time frame. If you are looking for an AI stock that is more promising than AAPL but that trades at less than 5 times its earnings, check out our report about thecheapest AI stock.\nREAD NEXT:8 Best Wide Moat Stocks to Buy Nowand30 Most Important AI Stocks According to BlackRock\nDisclosure: None. This article is originally published atInsider Monkey.\nYahoo Finance\nReturns since its inception in May 2014 (through August 15th, 2025)\n30 day money back guarantee. Cancel anytime.\nWarren Buffett\nBerkshire Hathaway\n$293,447,417,000\nDavid Einhorn\nGreenlight Capital\n$1,491,303,000\nGeorge Soros\nSoros Fund Management\n$5,416,602,000\nJim Simons\nRenaissance Technologies\n$77,426,184,000\nLeon Cooperman\nOmega Advisors\n$1,886,381,000\nCarl Icahn\nIcahn Capital LP\n$22,521,664,000\nSteve Cohen\nPoint72 Asset Management\n$22,767,998,000\nJohn Paulson\nPaulson & Co\n$3,510,256,000\nDavid Tepper\nAppaloosa Management LP\n$4,198,712,000\nPaul Tudor Jones\nTudor Investment Corp\n$6,160,740,000"
    },
    {
      "url": "https://www.investors.com:443/news/technology/apple-stock-lackluster-iphone-16-sales/",
      "url_mobile": "",
      "title": "Apple Stock Up Despite Lackluster iPhone 16 Sales | Investor Business Daily",
      "seendate": "20241218T184500Z",
      "socialimage": "https://www.investors.com/wp-content/uploads/2024/12/Stock-Apple-shanghai-iphone16pro-02-company.jpg",
      "domain": "investors.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 2,
      "days_ago": null,
      "recency_weight": 1.0,
      "content": "Despite hopes that artificial intelligence features would drive iPhone 16 sales,Apple's (AAPL) latest smartphones continue to underperform compared with last year's models, a Wall Street analyst says. Still, Apple stock is near record high territory.\nIn a client note Wednesday, JPMorgan analyst Samik Chatterjee said U.S. sales of the iPhone 16 are tracking below the iPhone 15 so far. He cited a survey from Wave7 Research about handset sales across U.S. carriers in October and November.\n\"The survey highlights that the lower momentum, reflected in the lower market share year over year, is likely led by the (still) lower consumer awareness for Apple Intelligence,\" Chatterjee said.\nApple Intelligence is Apple's branding of AI features.\nOn the plus side, Apple is seeing a mix shift toward its higher-end models, especially the iPhone 16 Pro Max, he said.\nChatterjee rates Apple stock as overweight with a price target of 265.\nOn thestock market today, Apple stock fell 2.1% to close at 248.05. Earlier in the session, it notched a record high of 254.28.\n\"Awareness about Apple Intelligence remains low,\" Chatterjee said. \"Based on a survey of carrier store representatives, 67% believe that iPhone users have low awareness of Apple Intelligence. Meanwhile, 24% indicated a 'medium' level of awareness, and only 10% reported a 'high' level of awareness among iPhone users.\"\nLast week, Apple released itssecond batch of artificial intelligence featuresfor newer iPhones and other Apple devices.\nThe new Apple Intelligence features include integration of OpenAI's generative AI chatbot ChatGPT with Apple's Siri digital assistant.\nElsewhere on Wall Street, Daiwa Securities raised its price target on Apple stock to 275 from 255 and kept its outperform rating.\nDaiwa expects Apple Intelligence to spur iPhone upgrades, but mainly in the second half of 2025.\nMeanwhile, Apple stock is on theIBD Tech Leaderslist.\nFollow Patrick Seitz on X, formerly Twitter, at@IBD_PSeitzfor more stories on consumer technology, software and semiconductor stocks.\nYOU MAY ALSO LIKE:\nVideo Game Industry Outlook For 2025 Features Blockbuster Title, New Console\nSoundHound Called 'Underappreciated Pure Play AI Company'\nSee Stocks On The List Of Leaders Near A Buy Point\nFind Winning Stocks With MarketSurge Pattern Recognition & Custom Screens\nJoin IBD Live For Stock Ideas Each Morning Before The Open"
    }
  ]
}