{
  "query": "apple",
  "ticker": "AAPL",
  "start_date": "01-01-2025",
  "end_date": "01-02-2025",
  "backward_start_date": "18-12-2024",
  "backward_end_date": "31-12-2024",
  "prediction_window_days": 31,
  "fetch_timestamp": "2026-02-07 20:18:48",
  "article_count": 46,
  "articles": [
    {
      "url": "https://wallstreetpit.com/121967-the-ai-stock-playbook-wall-streets-top-10-tech-bets-for-2025/",
      "url_mobile": "",
      "title": "The AI Stock Playbook : Wall Street Top 10 Tech Bets for 2025",
      "seendate": "20241231T171500Z",
      "socialimage": "https://wallstreetpit.com/wp-content/uploads/2022/03/tech-matrix2.jpg",
      "domain": "wallstreetpit.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 1,
      "recency_weight": 1.5,
      "content": "December 31, 2024Ari Haruni Wedbush Securitieshasprojecteda significant uptick in tech stock performance for 2025, estimating a 25% increase driven by multiple converging factors. The firm highlights a decrease in regulatory constraints anticipated under a Trump administration, suggesting that the days of stringent oversight by the Federal Trade Commission (FTC) under Lina Khan are behind us. This shift is expected to create a more favorable environment for Big Tech, particularly with enhanced AI initiatives from the government, which Wedbush describes as setting a “goldilocks foundation” for tech giants like Tesla and others. The core of Wedbush’s bullish outlook for 2025 centers on the ongoing AI Revolution, which they predict will inject over $2 trillion in additional capital expenditure into the tech sector over the next three years. This massive investment is expected to fuel growth across various tech companies, particularly those at the forefront of AI development and application. However, the journey to this growth isn’t expected to be without its challenges. Wedbush foresees “white-knuckle moments” due to concerns over Federal Reserve policies, potential escalations in U.S.-China trade relations concerning tariffs, and debates over the valuations of tech stocks which might be seen as stretched by some market observers. Despite these potential hurdles, these are viewed by Wedbush as opportunities to invest in key tech names, aligning with their investment strategy for the past two years. Wedbush has identified what they consider to be the top 10 tech companies poised to capitalize on the AI Revolution in 2025. Google (GOOGL) and Apple (AAPL) are noted for their comprehensive ecosystems where AI enhances user experiences across devices and services. MongoDB (MDB) and Snowflake (SNOW) are highlighted for their innovations in database management, crucial for handling the vast data sets AI requires. The integration of AI across these companies’ offerings – from hardware acceleration in Nvidia to enterprise software solutions in Salesforce -illustrates a tech sector increasingly defined by AI’s capabilities and potential. The predicted 25% growth in tech stocks underscores a belief in the enduring impact of AI, alongside a supportive political and economic backdrop, positioning these companies for significant gains in the near term. However, investors are advised to be prepared for volatility, as the road to such growth will likely be marked by both opportunities and risks. The views expressed in this article may reflect the author’s personal opinions and do not necessarily represent the views of Wall Street Pit. We encourage readers to conduct thorough research before making investment decisions. Any actions taken by readers are strictly at their own risk. Disclaimer: This page containsaffiliate links. If you choose to make a purchase after clicking a link, we may receive a commission at no additional cost to you. Thank you for your support!",
      "content_stats": {
        "total_sentences": 28,
        "relevant_sentences": 20,
        "relevance_ratio": 0.7143,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Specific FLS",
      "fls_confidence": 0.7103,
      "impact_horizon": "SHORT_TERM",
      "horizon_weight": 0.6937,
      "final_weight": 1.1775
    },
    {
      "url": "https://www.investors.com:443/news/stock-market-news-2024-economy-inflation/",
      "url_mobile": "",
      "title": "2024 Stock Market News : Economy Avoids Hard Landing",
      "seendate": "20241231T233000Z",
      "socialimage": "https://www.investors.com/wp-content/uploads/2024/12/StockMarketNews2024_thumb.jpg",
      "domain": "investors.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 1,
      "recency_weight": 1.5,
      "content": "Leading the stock market news of 2024, the S&P 500 and Nasdaq enjoyed one of their best years on record. Magnificent Seven stocks like Nvidia (NVDA), Apple (AAPL), Meta Platforms (META), Alphabet (GOOGL) and Tesla (TSLA) rode the continued artificial intelligence boom to all-time highs. Click here for an enlarged chart showing the 2024 stock market news. 100 Best Stocks Of…",
      "content_stats": {
        "total_sentences": 4,
        "relevant_sentences": 4,
        "relevance_ratio": 1.0,
        "condensed": false,
        "filter_action": "no_change"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.9664,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 1.0658
    },
    {
      "url": "https://www.fool.com/investing/2024/12/31/apples-stock-has-reached-historic-levels-in-one-me/?source=iedfolrf0000001",
      "url_mobile": "",
      "title": "Apple Stock Has Reached Historic Levels in One Metric . It a Clear Warning Sign for 2025 . ",
      "seendate": "20241231T133000Z",
      "socialimage": "https://g.foolcdn.com/editorial/images/801516/person-giving-a-thumbs-down-to-a-computer-screen.jpg",
      "domain": "fool.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 1,
      "recency_weight": 1.5,
      "content": null,
      "fls_label": "Not FLS",
      "fls_confidence": 0.9635,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 1.0658
    },
    {
      "url": "https://www.benzinga.com/analyst-ratings/analyst-color/24/12/42736753/jensen-huangs-nvidia-printing-money-like-apple-in-early-iphone-days-says-tesla-bull-ross-gerber",
      "url_mobile": "",
      "title": "Jensen Huang Nvidia  Printing Money Like Apple  In Early iPhone Days , Says Tesla Bull Ross Gerber - NVIDIA ( NASDAQ : NVDA ) ",
      "seendate": "20241231T100000Z",
      "socialimage": "https://cdn.benzinga.com/files/images/story/2024/12/31/Nvidia-CEO-Jensen-Huang.jpeg?&fit=crop",
      "domain": "benzinga.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 2,
      "days_ago": 1,
      "recency_weight": 1.5,
      "content": "A newsletter built for market enthusiasts by market enthusiasts. Top stories, top movers, and trade ideas delivered to your inbox every weekday before and after the market closes. What Happened: InvestorRoss GerbercomparedJensen Huang‘s chip giant current financial trajectory toApple Inc.(NASDAQ:AAPL) during the early iPhone years, highlighting the immense potential in AI, Yahoo Financereportedon Tuesday. Gerber, a decade-long investor in Nvidia andTesla, sees the company’s growth driven by the global development of AI infrastructure, largely supported by Nvidia’s cutting-edge chips. Nvidia’s valuationsurpassed $3 trillion, rivalingApple Inc., fueled by the AI boom. Benzinga does not provide investment advice. All rights reserved. To addBenzinga Newsas your preferred source on Google,click here. Additionally,Ibiden Co., akey supplier for Nvidia, is considering expanding its production capacity to meet the surging demand for AI chip package substrates. This move underscores the robust demand for AI-use substrates, with all available stock being quickly acquired by customers. Ibiden’s new substrate factory in Gifu, Japan, is expected to begin operations at 25% capacity by late 2025, eventually reaching 50% by March 2026.",
      "content_stats": {
        "total_sentences": 22,
        "relevant_sentences": 11,
        "relevance_ratio": 0.5,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.9662,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 1.0658
    },
    {
      "url": "https://www.fool.com/investing/2024/12/28/warren-buffett-sell-apple-stock-buy-stock-up-3100/?source=iedfolrf0000001",
      "url_mobile": "",
      "title": "Warren Buffett Sells Apple Stock and Buys a Restaurant Stock Up 3 , 100 % Since Its IPO",
      "seendate": "20241228T101500Z",
      "socialimage": "https://g.foolcdn.com/editorial/images/802206/investor-16.jpg",
      "domain": "fool.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 4,
      "recency_weight": 1.0,
      "content": null,
      "fls_label": "Not FLS",
      "fls_confidence": 0.9848,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.7658
    },
    {
      "url": "https://www.insidermonkey.com/blog/analyst-says-apple-aapl-stock-is-expensive-amid-slow-developing-upgrade-cycle-1414601/",
      "url_mobile": "https://www.insidermonkey.com/blog/analyst-says-apple-aapl-stock-is-expensive-amid-slow-developing-upgrade-cycle-1414601/?amp=1",
      "title": "Analyst Says Apple ( AAPL ) Stock is Expensive Amid  Slow - Developing  Upgrade Cycle",
      "seendate": "20241228T000000Z",
      "socialimage": "https://d2gr5kl7dt2z3t.cloudfront.net/blog/wp-content/uploads/2023/09/19155253/AAPL-insidermonkey-1695153171712.jpg",
      "domain": "insidermonkey.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 2,
      "days_ago": 4,
      "recency_weight": 1.0,
      "content": "We recently published a list ofAnalysts Are Talking About These 10 AI Stocks. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against other stocks analysts are talking about. He used the analogy of a child raised in a library, now ready to step out into the world. “What if they, we make them interact with sensory data, with vision data, with, uh, you know, like basically opening that door of the library and making this child walk into the real world? I think this creation of word models, like they’re called generally in the industry, where you combine multimodal information, that is not only text but is also videos, but is also sensory data. Despite high hopes, a potential plateau in performance improvements in AI systems, high energy consumption of AI data centers and transparency remain key issues tech companies will continue to grapple with in 2025. READ ALSO:7 Best Stocks to Buy For Long-Termand8 Cheap Jim Cramer Stocks to Invest In For this article, we picked 10 AI stocks currently trending based on latest news and analyst ratings. The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points(see more details here). A wide view of an Apple store, showing the range of products the company offers. “If you look at the valuation, it’s trading well north of 30 times on a PE basis, which is at or above its peers who are also taking advantage of this AI-fueled rally. When you look at the next couple of years for Apple Inc (NASDAQ:AAPL), on what looks to be a very slow-developing upgrade cycle, if there is a major upgrade cycle, you’re looking at mid to high single-digit EPS growth. So, north of 30 times PE, mid single-digit to high single-digit EPS growth—I think it’s, you know, an expensive stock.” Apple Inc (NASDAQ:AAPL) is desperately in need of new catalysts. The company’s revenue in China fell 8% in fiscal year 2024, following a 2% decline the previous year. The Chinese market accounts for about 15% of Apple’s total revenue, so this downtrend cannot be ignored. Investors had hopes for the Wearables, Home, and Accessories segment, but so far its performance has been weak. Vision Pro faces tough competition from Meta’s $500 Quest and the more affordable Quest 3S, making it hard to justify its $3,500 price tag. The failure of Apple’s HomePod, unable to compete with Amazon’s and Google’s lower-priced offerings, further highlights the challenges in this market. Apple’s iPhone 16 has not shown promising growth prospects yet and investors are still in a wait-and-see mode on the AI platform. While the company is projected to achieve 9.5% EPS growth this fiscal year and 12.3% growth in the next, much of this growth is already priced in, as the stock trades at nearly 30 times the expected EPS for the fiscal year ending September 2026. Parnassus Growth Equity Fund stated the following regarding Apple Inc. Investors reacted positively to the new iPhone 16 lineup and its advanced features, including generative artificial intelligence, greater durability and increased processing power.” Overall, AAPLranks 5thon our list of stocks analysts are talking about. While we acknowledge the potential of AAPL, our conviction lies in the belief that under the radar AI stocks hold greater promise for delivering higher returns, and doing so within a shorter time frame. If you are looking for an AI stock that is more promising than AAPL but that trades at less than 5 times its earnings, check out our report about thecheapest AI stock. This article is originally published atInsider Monkey. Cancel anytime.",
      "content_stats": {
        "total_sentences": 36,
        "relevant_sentences": 27,
        "relevance_ratio": 0.75,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.9316,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.7658
    },
    {
      "url": "https://wallstreetpit.com/121846-wedbush-maps-apples-road-to-a-5-trillion-milestone/",
      "url_mobile": "",
      "title": "Wedbush Maps Apple Road to a $5 Trillion Milestone",
      "seendate": "20241227T230000Z",
      "socialimage": "https://wallstreetpit.com/wp-content/uploads/2016/11/apple-iphone-15.jpg",
      "domain": "wallstreetpit.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 5,
      "recency_weight": 1.0,
      "content": "December 27, 2024Ron Haruni On CNBC’s “Closing Bell Overtime,”Dan Ives,Wedbush‘s global head of technology research, shared his insights on Apple’s recent performance and its potential path to a $5 trillion market cap, primarily driven by an anticipated AI upgrade cycle. Ives recentlyraisedhis price target for Apple (AAPL) to a Street-High of $325 from $300, maintaining an ‘Outperform’ rating on the shares, attributing his optimism to recent channel checks indicating a robust holiday season, projecting Apple to sell 240 million iPhones this year. Despite Apple’s stock trading at high multiples compared to its earnings, Ives dismissed concerns about overvaluation. He argued that Apple’s services business alone could justify a $2 trillion valuation, and with AI integration, revenue could increase significantly, potentially adding $5 to $10 billion annually. This, combined with what he believes will be an underestimated growth in iPhone sales, could push Apple’s valuation far beyond current expectations. Ives addressed concerns about consumer behavior amidst inflation, noting that while it might affect upgrades marginally, the real driver for upgrades is the vast number of iPhones—300 million out of 1.5 billion globally—that haven’t been upgraded in over four years. He emphasized thatApple Intelligence, part of the iOS 18.2 update, would catalyze this cycle, with hundreds of new AI-driven apps expected to enhance the iPhone ecosystem. Responding to comparisons with the lukewarm reception to AI PCs by companies like HP (HPE) and Dell (DELL), Ives highlighted the unique upgrade cycle for smartphones, which typically occurs every 2.5 to 3 years but has now extended to 4 years, creating pent-up demand. He believes that the integration of AI will not only drive iPhone upgrades but also extend across Apple’s entire product line, including iPads and Macs, marking the beginning of a multi-year AI-driven upgrade super cycle. Ives concluded that the current market cap of Apple, around $3.92 trillion, does not reflect the potential growth from AI monetization. He predicts that as AI penetration in Apple’s ecosystem grows from 15% to 25-30%, the company could feasibly reach a$5 trillion valuationwithin the next 12 to 18 months. His vision is for Apple to lead the consumer AI revolution, countering any skepticism with a firm belief in Apple’s strategic position and future growth trajectory. Disclaimer: This page containsaffiliate links. If you choose to make a purchase after clicking a link, we may receive a commission at no additional cost to you. Thank you for your support!",
      "content_stats": {
        "total_sentences": 15,
        "relevant_sentences": 15,
        "relevance_ratio": 1.0,
        "condensed": false,
        "filter_action": "no_change"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.9767,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.7658
    },
    {
      "url": "https://www.insidermonkey.com/blog/analyst-on-nvidia-nvda-investors-should-be-very-vigilant-amid-rising-competition-1414553/",
      "url_mobile": "https://www.insidermonkey.com/blog/analyst-on-nvidia-nvda-investors-should-be-very-vigilant-amid-rising-competition-1414553/?amp=1",
      "title": "Analyst on NVIDIA ( NVDA ): Investors Should Be  Very Vigilant  Amid Rising Competition",
      "seendate": "20241227T190000Z",
      "socialimage": "https://d2gr5kl7dt2z3t.cloudfront.net/blog/wp-content/uploads/2023/09/19153615/NVDA-insidermonkey-1695152172066.jpg",
      "domain": "insidermonkey.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 5,
      "recency_weight": 1.0,
      "content": "We recently published a list ofTop 10 AI Stocks That Should Be On Your Watchlist for 2025. Investors are looking for new growth horizons in the AI industry to gauge whether the current market rally can continue for the years to come. Chetan Puttagunta, Benchmark general partner, said he’s noticed a lot of innovation in the past few weeks focused on improving the efficiency of algorithms. “In the last six to eight weeks, we’ve seen a tremendous amount of innovation, especially at the model layer, and then for the last two years at the application layer, taking advantage of all the advances in the AI models. The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points(see more details here). A close-up of a colorful high-end graphics card being plugged in to a gaming computer. “I think 2025 is going to be the year where all bets are off—or rather, all gloves are off—in AI competition. Last week, atThe Information, we reported that Broadcom is now working with Apple on an AI chip for inference. An EPS surprise of 8.5% was not able to help the stock. A similar trend occurred following the second-quarter earnings after a 5.6% EPS surprise. It’s difficult to see Nvidia maintaining a mid-70s gross margin by the end of 2026. Over the last two quarters, Nvidia has already reported a drop in its gross margin from 78% to 74.5%. Then there’s competition. The chip is expected to be twice as fast with 40% more power efficiency than the previous generation, manufactured on TSMC’s (TSM) cutting-edge N3 technology. Reportedly, technology giant Apple (AAPL) will be a consumer of Amazon’s new silicon. It hit an eye-opening market capitalization of $3 trillion in June, less than four months after it eclipsed the $2 trillion mark. Enthusiasm for everything AI-related, especially for the primary chip maker whose products are essential to powering AI technology, continues to fuel the market. While we acknowledge the potential of NVDA, our conviction lies in the belief that under the radar AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than NVDA but that trades at less than 5 times its earnings, check out our report about thecheapest AI stock. This article is originally published atInsider Monkey. Cancel anytime.",
      "content_stats": {
        "total_sentences": 42,
        "relevant_sentences": 22,
        "relevance_ratio": 0.5238,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.9565,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.7658
    },
    {
      "url": "https://www.insidermonkey.com/blog/apple-inc-aapl-billionaire-d-e-shaw-is-bullish-on-this-stock-right-now-1414574/",
      "url_mobile": "https://www.insidermonkey.com/blog/apple-inc-aapl-billionaire-d-e-shaw-is-bullish-on-this-stock-right-now-1414574/?amp=1",
      "title": "Apple Inc . ( AAPL ): Billionaire D . E . Shaw Is Bullish On This Stock Right Now",
      "seendate": "20241227T171500Z",
      "socialimage": "https://d2gr5kl7dt2z3t.cloudfront.net/blog/wp-content/uploads/2023/09/19155253/AAPL-insidermonkey-1695153171712.jpg",
      "domain": "insidermonkey.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 5,
      "recency_weight": 1.0,
      "content": "We recently compiled a list of the10 Best Stocks to Buy According to Billionaire D.E. Shaw.In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against the other stocks. Equity market pricing is never perfect due to supply and demand imbalances, emotional reactions, and errors. Billionaire investor David Elliot Shaw excels at detecting and exploiting these inefficiencies to generate shareholder value. Unlike most hedge fund managers who rely on intuition, Shaw uses sophisticated mathematical models and algorithms for investment decisions. Over the years, he has developed software and hardware to gain an edge in investment opportunities. Born in 1951, David E. Shaw became a successful billionaire scientist and hedge fund manager. After earning a PhD from Stanford in 1980, he foundedD.E. Shaw & Co.in 1988 with six employees and $28 million in capital. The hedge fund has averaged a 12.5% return since inception, with only one down year. Shaw’s firm uses powerful computers and advanced algorithms for quick market responses and risk management, returning over $51 billion to investors. Likewise, it generated a net return of 11.88% between 2001 and 2011. READ ALSO:10 Best Stocks to Buy According to Billionaire David EinhornandBillionaire Paul Singer’s Top 12 Long-Term Stock Picks. D.E. In 2023, they raised money for D.E. Last year, the firm also raised $1.1 billion for two new private investment vehicles: D.E. Shaw Voltaic Fund and D.E. Shaw Diopter Fund. In June 2024, D.E. They filed a private placement notice for D.E. Shaw Diopter Fund II, but the amount wasn’t disclosed. Bloomberg reported that D.E. Shaw’s largest hedge fund, the D.E. Shaw Composite Fund, gained 9.6% in 2023, outperforming the HFR Global Hedge Fund Index, which was up about 2.5% through December 15. Reuters added that D.E. Shaw’s macro-oriented fund, the Oculus Fund, gained 7.8% in 2023, beating its macroeconomic peers. According to Bloomberg, the Oculus Fund has never had a negative year since it started. Diversification is another vital arsenal that D.E. Shaw & Co. relies on to spread risk and reduce market volatility. The firm is highly diversified with a portfolio value of about $116.49 billion. While technology stocks account for the most significant share in the equity market at 24.6%, the hedge fund also has stakes in Services at 17.5% and the financial sector at 7.7%. Billionaire D.E. Shaw suggests investing in resilient companies, even as the US Federal Reserve signals fewer interest rate cuts in 2025. Despite three cuts reducing the benchmark rate to 4.25%-4.5%, economic slowdown concerns persist, especially in the labor market. Job growth is mainly in government and health care, while growth in manufacturing, business, and professional services has stagnated. Our Methodology To make the list of best stocks to buy according to billionaire D.E. Shaw, we scanned D.E. Shaw & Co investment portfolio. We then settled on the hedge fund’s largest holdings analyzing why they stand out and the number of hedge funds that hold stakes in them. Shaw & Co stake value. At Insider Monkey, we are obsessed with the stocks that hedge funds pile into. The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here). A wide view of an Apple store, showing the range of products the company offers. D.E. Shaw & Co’s Stake Value: $2 Billion Number of Hedge Fund Holders: 158 Apple Inc. (NASDAQ:AAPL) is a technology company that designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories. It is one of the best-performing stocks in the D. E. The strong performance comes from investors rallying behind the company’s innovative product lineup and strong financial performance that affirms underlying growth. Similarly, it is one of the best stocks to buy, according to billionaire D.E. Shaw, given the investments it is making in AI. Apple Inc. (NASDAQ:AAPL) is investing in Apple Intelligence, an AI-driven initiative that is expected to bolster the iPhone product line. While iPhone sales have appeared subdued in recent years, the integration of AI features is one factor expected to give people a reason to upgrade, strengthening Apple’s revenue base. Consequently, iPhone shipments are projected to grow 12% year-over-year to 258 million units in fiscal 2026. The growth would be propelled by features like upgraded Siri, AI image tools, and ChatGPT integration. While the hardware business has been a key growth driver over the years, the service segment also affirms Apple Inc.’s (NASDAQ:AAPL) long-term prospects. The segment is projected to achieve a double-digit growth rate driven by strong pricing power, expanding adoption and new offerings The introduction of AI services is projected to contribute between $7 and $14 billion in incremental services revenue. Likewise, the expectation is high that Apple Inc.’s (NASDAQ:AAPL) gross margin will improve next year owing to cost efficiencies and faster-growing service revenue, allowing the company to generate more shareholder value. Overall AAPLranks 2ndon our list of the best stocks to buy according to Billionaire D. E. Shaw. While we acknowledge the potential of AAPL as an investment, our conviction lies in the belief that under the radar AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than AAPL but that trades at less than 5 times its earnings, check out our report about thecheapest AI stock. This article is originally published atInsider Monkey. Cancel anytime.",
      "content_stats": {
        "total_sentences": 81,
        "relevant_sentences": 70,
        "relevance_ratio": 0.8642,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.9355,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.7658
    },
    {
      "url": "http://baystreet.ca/stockstowatch/19860/Stock-Market-Warning-Yields-Rising",
      "url_mobile": "/amp/articles/stockstowatch.aspx?articleid=106930",
      "title": "Baystreet . ca - Stock Market Warning : Yields Rising",
      "seendate": "20241227T160000Z",
      "socialimage": "http://baystreet.ca/images/articlegroups/original/7/private/NVIDIA.jpg",
      "domain": "baystreet.ca",
      "language": "English",
      "sourcecountry": "Canada",
      "coverage_count": 1,
      "days_ago": 5,
      "recency_weight": 1.0,
      "content": "When the Federal Reserve lowered interest rates again by 25 basis points, stock markets expected it. However, U.S. treasury bond prices continued to weaken. The rally in shares of the magnificent seven, which includes Microsoft (MSFT), Apple (AAPL), and Nvidia (NVDA) are at risk of stagnating. Yields for the 30-year T-bill are especially notable. The 30-year yield is 4.77% while the 10-year T-bill is at 4.59%. This will increase mortgage rates, hurting the demand for homes. Since peaking in August, D.H. DHI stock is down by 29% from its high for the year. Yields are rising because the Fed changed from a dovish, rate-cutting tone it set in the summer. In December, Fed Chair Powell said that the central bank needs to beware of inflation that U.S. tariffs cause. When the U.S. imposes 25% tariffs against Mexico and Canadian imports, those countries will retaliate. This increases the price of consumer goods for Americans. The U.S. government is hoping that neither trading partner will counter with similarly sized tariffs. Watch out for the risk of the Santa Claus rally fading quickly to start 2025. Markets trade at a premium since they are not pricing in the trade war risks.",
      "content_stats": {
        "total_sentences": 22,
        "relevant_sentences": 19,
        "relevance_ratio": 0.8636,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.8768,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.7658
    },
    {
      "url": "https://www.benzinga.com/markets/futures/24/12/42699993/us-stocks-to-open-lower-as-index-future-decline-analysts-remain-upbeat-about-santa-rally",
      "url_mobile": "",
      "title": "US Stocks To Open Lower As Index Future Decline : Analysts Remain Upbeat About Santa Rally - Apple ( NASDAQ : AAPL ), Evaxion Biotech ( NASDAQ : EVAX ) ",
      "seendate": "20241227T131500Z",
      "socialimage": "https://cdn.benzinga.com/files/images/story/2024/12/27/Wall-Street_2.jpeg?&fit=crop",
      "domain": "benzinga.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 5,
      "recency_weight": 1.0,
      "content": "A newsletter built for market enthusiasts by market enthusiasts. Top stories, top movers, and trade ideas delivered to your inbox every weekday before and after the market closes. U.S. stock futures tumbled on Friday in premarket hours after a mixed Thursday. All four index futures slipped in trade. Analysts say that the full ‘Santa Claus Rally’ has never been lower. The 10-year and two-year Treasury notes yielded 4.61% and 4.33%, respectively. The probability of having no change in the interest rates for the upcoming Jan. 31, 2025 decision was at 89.3%, down from 91.4% a week ago, accordingtoCME Group’s FedWatch tool. Cues From The Last Session U.S. stock markets closed mixed on Thursday, following a Christmas break. Month-to-date performance varied across indices. The Nasdaq significantly outperformed, driven by strong gains inTesla Inc.(NASDAQ:TSLA) andApple Inc.(NASDAQ:AAPL), while the Dow Jones experienced a decline of around 3.5%. Economic data released on Thursday showed a slight decrease in initial jobless claims, coming in below market expectations. This suggests a continued strong labor market. Sector performance was mixed. Healthcare, financial, and real estate sectors led gains, while consumer discretionary and communication services sectors underperformed. Insights From Analysts According to the chief market strategist at Carson Research,Ryan Detrick, the final six days of the ‘Santa Claus Rally’ has been higher five out of seven, with two small losses. But even these six days have been higher by 1.7% on average. According toCharlie Bilello, the chief market strategist at Creative Planning the S&P 500’s 57 all-time highs in 2024 was the fifth highest in its history. New unemployment claims came in at 219,000, which was a bit lower than the four-week moving average of 226,500,” he added. The Dollar Index was up 0.01% to 108.138 level. Asian markets were mixed on Friday, as Hong Kong’s Hang Seng, China’s CSI 300, and South Korea’s Kospi index declined. Whereas, Japan’s Nikkei 225, Australia’s ASX 200, and India’s S&P BSE Sensex index rose. Most European markets traded higher. Benzinga does not provide investment advice. All rights reserved. To addBenzinga Newsas your preferred source on Google,click here.",
      "content_stats": {
        "total_sentences": 38,
        "relevant_sentences": 28,
        "relevance_ratio": 0.7368,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.9647,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.7658
    },
    {
      "url": "https://www.benzinga.com/24/12/42697989/dow-edges-higher-in-thin-holiday-trading-fear-declines-among-us-investors-but-fear-greed-index-remains-in-fear-zo",
      "url_mobile": "",
      "title": "Dow Edges Higher In Thin Holiday Trading As Tesla , Apple Surge : Investor Sentiment Improves , But Greed Index Remains In  Fear  Zone - Tesla ( NASDAQ : TSLA ) ",
      "seendate": "20241227T103000Z",
      "socialimage": "https://cdn.benzinga.com/files/images/story/2024/12/27/Market-Sentiment--Fear-And-Greed-Index--.jpeg?&fit=crop",
      "domain": "benzinga.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 5,
      "recency_weight": 1.0,
      "content": "A newsletter built for market enthusiasts by market enthusiasts. Top stories, top movers, and trade ideas delivered to your inbox every weekday before and after the market closes. U.S. stocks settled mixed on Thursday, with the Dow Jones index closing slightly higher during the session. The market was shut on Wednesday for Christmas Day. Month to date, the S&P 500 gained 0.1%, while the Nasdaq has surged 4.2%, driven by significant gains inTesla(NASDAQ:TSLA) andApple(NASDAQ:AAPL). On the economic data front, U.S. initial jobless claims fell by 1,000 from the previous week to a reading of 219,000 during the second week of December, compared to market estimates of 224,000. Most sectors on the S&P 500 closed on a positive note, with healthcare, financial, and real estate stocks recording the biggest gains on Thursday. At a current reading of 35.1, the index remained in the “Fear” zone on Thursday, versus a prior reading of 34. The Fear & Greed Index is a measure of the current market sentiment. It is based on the premise that higher fear exerts pressure on stock prices, while higher greed has the opposite effect. The index ranges from 0 to 100, where 0 represents maximum fear and 100 signals maximum greediness. Benzinga does not provide investment advice. All rights reserved. To addBenzinga Newsas your preferred source on Google,click here.",
      "content_stats": {
        "total_sentences": 24,
        "relevant_sentences": 16,
        "relevance_ratio": 0.6667,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.9534,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.7658
    },
    {
      "url": "https://www.insidermonkey.com/blog/analyst-predicts-nvidia-nvda-stock-will-hit-800-by-2030-1413970/",
      "url_mobile": "https://www.insidermonkey.com/blog/analyst-predicts-nvidia-nvda-stock-will-hit-800-by-2030-1413970/?amp=1",
      "title": "Analyst Predicts NVIDIA ( NVDA ) Stock Will Hit $800 By 2030",
      "seendate": "20241227T090000Z",
      "socialimage": "",
      "domain": "insidermonkey.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 5,
      "recency_weight": 1.0,
      "content": "We recently published a list of10 AI Stocks Wall Street is Talking About. Defiance ETFs CEO and CIO Sylvia Jablonski said in a recent program on Bloomberg that there are trillions of dollars of cash waiting on the sidelines ready to be invested in AI amid demand that is at an all-time high. “There’s a biggest wealth transfer of our generation happening as we speak. And you know, Gen Z, you know, Gen Z, Millennial, Gen X kind of, you know, the younger traders are, this is where they’re allocating their funds to. So you need quantum in order for it to be efficient. You need to process that data quickly. The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points(see more details here). “They reported $35 billion in one quarter, which is three months. They had a total of $27 billion over 12 months last year. That means in three months, they exceeded their entire 2023 earnings by $8 billion. I’m not sure there’s a stock in the history of the exchange that has driven that much in revenue, while also achieving 50% margins. If you do the math on that $35 billion a quarter, they’re already on a $140 billion annual clip in terms of revenue. In order to achieve the prediction of $800 by 2030, they need to be at $600 billion in revenue. An EPS surprise of 8.5% was not able to help the stock. A similar trend occurred following the second-quarter earnings after a 5.6% EPS surprise. It’s difficult to see Nvidia maintaining a mid-70s gross margin by the end of 2026. Over the last two quarters, Nvidia has already reported a drop in its gross margin from 78% to 74.5%. Then there’s competition. The chip is expected to be twice as fast with 40% more power efficiency than the previous generation, manufactured on TSMC’s (TSM) cutting-edge N3 technology. Reportedly, technology giant Apple (AAPL) will be a consumer of Amazon’s new silicon. While the earnings came in higher than expectations, investors were concerned that the company did not guide earnings high enough, signaling a potential slowdown in AI buildout. The question that remains is whether the company can meet the demand for its AI processors and connectivity chips. While we acknowledge the potential of NVDA, our conviction lies in the belief that under the radar AI stocks hold greater promise for delivering higher returns, and doing so within a shorter time frame. If you are looking for an AI stock that is more promising than NVDA but that trades at less than 5 times its earnings, check out our report about thecheapest AI stock. This article is originally published atInsider Monkey. Cancel anytime.",
      "content_stats": {
        "total_sentences": 46,
        "relevant_sentences": 27,
        "relevance_ratio": 0.587,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.6827,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.7658
    },
    {
      "url": "https://www.themarketsdaily.com/2024/12/27/equities-research-analysts-updated-eps-estimates-for-december-26th-aapl-acva-avxl-celh-crvl-kmpr-mcy-nke-pb-pypd.html",
      "url_mobile": "",
      "title": "Equities Research Analyst Updated EPS Estimates for December 26th ( AAPL , ACVA , AVXL , CELH , CRVL , KMPR , MCY , NKE , PB , PYPD ) ",
      "seendate": "20241227T061500Z",
      "socialimage": "",
      "domain": "themarketsdaily.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 5,
      "recency_weight": 1.0,
      "content": null,
      "fls_label": "Not FLS",
      "fls_confidence": 0.9868,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.7658
    },
    {
      "url": "https://www.insidermonkey.com/blog/dan-niles-on-apple-aapl-data-is-somewhat-disappointing-and-stock-is-pretty-expensive-1413968/",
      "url_mobile": "https://www.insidermonkey.com/blog/dan-niles-on-apple-aapl-data-is-somewhat-disappointing-and-stock-is-pretty-expensive-1413968/?amp=1",
      "title": "Dan Niles on Apple ( AAPL ): Data is  Somewhat Disappointing  and Stock is  Pretty Expensive",
      "seendate": "20241226T223000Z",
      "socialimage": "https://d2gr5kl7dt2z3t.cloudfront.net/blog/wp-content/uploads/2023/09/13040841/AAPL-imagemaker-1694592519294.jpg",
      "domain": "insidermonkey.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 6,
      "recency_weight": 1.0,
      "content": "We recently published a list of10 AI Stocks Wall Street is Talking About. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against other AI stocks Wall Street is talking about. Defiance ETFs CEO and CIO Sylvia Jablonski said in a recent program on Bloomberg that there are trillions of dollars of cash waiting on the sidelines ready to be invested in AI amid demand that is at an all-time high. “There’s a biggest wealth transfer of our generation happening as we speak. And you know, Gen Z, you know, Gen Z, Millennial, Gen X kind of, you know, the younger traders are, this is where they’re allocating their funds to. So you need quantum in order for it to be efficient. You need to process that data quickly. The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points(see more details here). An Apple store displaying the latest in consumer electronics, from smartphones to wearables. Number of Hedge Fund Investors: 158 Dan Niles of Niles Investment Management said while talking to Schwab Network in a latest program that the data around Apple Inc’s (NASDAQ:AAPL) new iPhone has been “disappointing.” “Relative to three months ago, the data, if you actually take a look at it, has been somewhat disappointing, with the rollout being much slower. You don’t get a rollout in Europe until next year, hopefully in the first quarter, and for China, we still don’t know when they’re going to roll out AI features. With the stock now trading at a multiple that just keeps expanding—now in the low 30 PE range compared to the S&P at about 22 times—it’s looking pretty expensive. So for me, Apple Inc (NASDAQ:AAPL) is not one I would really be that bullish on right here. It’s just going up with the tape, but I think as we get closer to them having to report and guide, you may have an issue.” Apple Inc (NASDAQ:AAPL) has been seeing a long-term decline in mobile carrier upgrade rates, especially postpaid, for several years. This suggests that people are holding onto their devices longer, likely due to economic factors, satisfaction with current technology, or a lack of exciting new features in recent models In the latest earnings call, Apple Inc (NASDAQ:AAPL) CEO Tim Cook highlighted new features for the iPhone, such as a more comfortable watch band and sleep apnea detection, but none appeared to be major demand drivers for new customers. Mar Vista Strategic Growth Strategy stated the following regarding Apple Inc. (NASDAQ:AAPL) in itsQ3 2024 investor letter: “Apple Inc.(NASDAQ:AAPL) stock was strong in the quarter as investors viewed the company’s generative AI roadmap and iPhone 16 product cycle positively. The market was reminded of the strength of the Apple ecosystem as management demonstrated how generative AI solutions would be integrated into its iOS 18 operating system, which was broadly released in the iPhone 16 late in calendar Q3. We believe Apple’s generative AI-enabled products should spur a meaningful iPhone upgrade cycle and create new avenues of monetization through its app store and advertising offerings. We believe this will support intrinsic value growth that will range between high single digits and low double-digits over our investment horizon.” Overall, AAPLranks 4thon our list of AI stocks Wall Street is talking about. While we acknowledge the potential of AAPL, our conviction lies in the belief that under the radar AI stocks hold greater promise for delivering higher returns, and doing so within a shorter time frame. If you are looking for an AI stock that is more promising than AAPL but that trades at less than 5 times its earnings, check out our report about thecheapest AI stock. This article is originally published atInsider Monkey. Cancel anytime.",
      "content_stats": {
        "total_sentences": 36,
        "relevant_sentences": 26,
        "relevance_ratio": 0.7222,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.9556,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.7658
    },
    {
      "url": "https://www.benzinga.com/insights/analyst-ratings/24/12/42692271/what-14-analyst-ratings-have-to-say-about-apple",
      "url_mobile": "",
      "title": "What 14 Analyst Ratings Have To Say About Apple - Apple ( NASDAQ : AAPL ) ",
      "seendate": "20241226T201500Z",
      "socialimage": "https://cdn.benzinga.com/files/images/story/2023/analyst_ratings_image_0.jpeg?&fit=crop",
      "domain": "benzinga.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 6,
      "recency_weight": 1.0,
      "content": "A newsletter built for market enthusiasts by market enthusiasts. Top stories, top movers, and trade ideas delivered to your inbox every weekday before and after the market closes. Throughout the last three months, 14 analysts have evaluated Apple (NASDAQ:AAPL), offering a diverse set of opinions from bullish to bearish. Summarizing their recent assessments, the table below illustrates the evolving sentiments in the past 30 days and compares them to the preceding months. Analysts' evaluations of 12-month price targets offer additional insights, showcasing an average target of $245.14, with a high estimate of $325.00 and a low estimate of $184.00. A decline of 0.04% from the prior average price target is evident in the current average. The standing of Apple among financial experts becomes clear with a thorough analysis of recent analyst actions. Analyzing these analyst evaluations alongside relevant financial metrics can provide a comprehensive view of Apple's market position. Stay informed and make data-driven decisions with the assistance of our Ratings Table. Market Capitalization Analysis:Above industry benchmarks, the company's market capitalization emphasizes a noteworthy size, indicative of a strong market presence. Net Margin:Apple's net margin excels beyond industry benchmarks, reaching15.52%. This signifies efficient cost management and strong financial health. Return on Equity (ROE):Apple's ROE stands out, surpassing industry averages. With an impressive ROE of23.83%, the company demonstrates effective use of equity capital and strong financial performance. Return on Assets (ROA):Apple's ROA stands out, surpassing industry averages. With an impressive ROA of4.23%, the company demonstrates effective utilization of assets and strong financial performance. Debt Management:With a high debt-to-equity ratio of1.87, Apple faces challenges in effectively managing its debt levels, indicating potential financial strain. Analysts may attend company conference calls and meetings, research company financial statements, and communicate with insiders to publish analyst ratings for stocks. Beyond their standard evaluations, some analysts contribute predictions for metrics like growth estimates, earnings, and revenue, furnishing investors with additional guidance. Users of analyst ratings should be mindful that this specialized advice is shaped by human perspectives and may be subject to variability. This under-the-radar company could surge 200%+ as major market shifts unfold.Click here for urgent details. This article was generated by Benzinga's automated content engine and reviewed by an editor. © 2026 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. To addBenzinga Newsas your preferred source on Google,click here. Apple is among the largest companies in the world, with a broad portfolio of hardware and software products targeted at consumers and businesses. Apple's iPhone makes up a majority of the firm sales, and Apple's other products like Mac, iPad, and Watch are designed around the iPhone as the focal point of an expansive software ecosystem. Apple has progressively worked to add new applications, like streaming video, subscription bundles, and augmented reality. The firm designs its own software and semiconductors while working with subcontractors like Foxconn and TSMC to build its products and chips. Slightly less than half of Apple's sales come directly through its flagship stores, with a majority of sales coming indirectly through partnerships and distribution. Revenue Growth:Apple's revenue growth over a period of 3 months has been noteworthy. As of 30 September, 2024, the company achieved a revenue growth rate of approximately6.07%. This indicates a substantial increase in the company's top-line earnings. As compared to its peers, the revenue growth lags behind its industry peers. The company achieved a growth rate lower than the average among peers in Information Technology sector.",
      "content_stats": {
        "total_sentences": 41,
        "relevant_sentences": 36,
        "relevance_ratio": 0.878,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.9812,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.7658
    },
    {
      "url": "https://www.investopedia.com/dow-jones-today-12262024-8766566",
      "url_mobile": "",
      "title": "Dow Jones Today : Stocks Slip in Early Trading as Santa Clause Rally Stumbles ; Bitcoin Slumps",
      "seendate": "20241226T161500Z",
      "socialimage": "https://www.investopedia.com/thmb/EXMCLruzLRDT2kmPAFuhifPyPes=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-2188999255-98d7adacd05b41909fa6592d4923a0af.jpg",
      "domain": "investopedia.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 6,
      "recency_weight": 1.0,
      "content": "David Dee Delgado / AFP / Getty Images Stocks turned in a mixed performance on Thursday as the rally that kicked off the holiday-abbreviated trading week lost momentum. market rebounded fromlast week's downturn. Apple (AAPL), which isinching closer to becoming the first companyto ever achieve $4 trillion in market value, rose 0.3% to a record closing high, while Nvidia (NVDA), Microsoft (MSFT), Alphabet (GOOGL), Amazon (AMZN), Meta Platforms (META) and Tesla (TSLA) all lost ground. The yield on 10-year Treasurys, which is correlated with expectations about where interest rates are headed, was at 4.59%, after moving as high as 4.64% this morning and trading at its highest levels since May. The company said Thursday that it bought 217.18 bitcoins at an average price of $96,556 per bitcoin. The move comes after the company said earlier this month it was launching a Bitcoin Treasury strategy that called for allocating up to 90% of its surplus cash to the digital currency. Its shares have surged nearly 500% since the start of the year. Moody’s analystsapplaudedthe move, arguing that it would be “credit positive” if done properly. Investopedia / Photo Illustration by Alice Morgan / Getty Images This year's runup started with demand associated with thespot bitcoin exchange-traded funds(ETFs) that began trading in January, followed bya halvingthat limited supply of new bitcoin and then the hope for crypto-supportive policies after the reelection of Donald Trump, seemingly reinforced by several of his post-election appointments. While the Federal Reserve's latest projections for cutting interest rates next year shook the crypto markets, some of the aforementioned reasons for optimism remain on the table—though if the Fed slows its rate-cutting campaign, experts say, Treasury yields could remain elevated, shifting investors away from bitcoin and other risk assets. -Kyle Torpey Apple Set for 'Golden Era of Growth,' Analyst Says Wedbush analysts led by Dan Ives, long an Apple (AAPL)bull, told clients in a note Thursday that the iPhone maker could be headed for a “golden era of growth” in 2025, driven by demand forartificial intelligence (AI). The analysts raised their price target for Apple's stock by $25 to $325 and maintained an outperform rating, anticipating a multi-year iPhone upgrade cycle driven by AI that “is still being underestimated by the Street. That's a lot higher than the average analyst price target compiled by Visible Alpha at about $244. Just over half or nine of the 15 analysts polled hold buy or equivalent ratings for the stock, with four hold and two sell ratings. Apple shares were up slightly in midday trading after hitting a fresh all-time high of just over $260. Wedbush's target boost comes as the firm projects Apple could sell more than 240 million iPhones in fiscal year 2025, “as this AI-driven upgrade cycle takes hold and this will be the highest iPhone unit sales year in Apple's history.” TradingView Apple shares have gained over one-third of their value since the start of the year, as the company'smarket capitalizationnears $4 trillion. The stock has outpaced the S&P 500 in 2024. (See chart above) Wedbush expects Apple could soon reach that $4 trillion threshold, which would make it the first company in the world to do so. At present, there are only three companies with a market caps over $3 trillion, including Apple, Nvidia (NVDA), and Microsoft (MSFT). Does that mean he got something nice? Has something to give? Likes nicely wrapped boxes? Predictably, people are wondering—and watching, with the message at recent count seen some 4 million times, according to X, with thousands of responses, retweets and likes. Shares of the company, meanwhile, are up nearly 80% in 2024, though below prices seen at the top of spikeslargely inspired by Gillearlier this year. With its gains so far this week, the S&P 500 has moved into positive territory for the month. The Nasdaq is also higher for the month, while the Dow is on track to finish December with losses. TradingView S&P 500 futures were also off 0.3%. TradingView Nasdaq 100 futures slipped 0.4%. TradingView",
      "content_stats": {
        "total_sentences": 55,
        "relevant_sentences": 28,
        "relevance_ratio": 0.5091,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.9697,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.7658
    },
    {
      "url": "https://finance.yahoo.com/news/apple-stock-touches-intraday-high-after-nod-of-confidence-from-wall-street-154221679.html",
      "url_mobile": "",
      "title": "Apple stock touches intraday high after nod of confidence from Wall Street",
      "seendate": "20241226T161500Z",
      "socialimage": "https://s.yimg.com/ny/api/res/1.2/4wJKpYVJFN2GTURC48Hlcw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2024-12/50bf8b80-bca9-11ef-bada-38725b6ea9b9",
      "domain": "finance.yahoo.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 6,
      "recency_weight": 1.0,
      "content": null,
      "content_stats": {
        "total_sentences": 5,
        "relevant_sentences": 4,
        "relevance_ratio": 0.8,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.9842,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.7658
    },
    {
      "url": "https://www.investopedia.com/tesla-stock-leads-magnificent-seven-shares-higher-update-8766292",
      "url_mobile": "",
      "title": "Tesla Stock Leads Magnificent Seven Shares Higher",
      "seendate": "20241226T161500Z",
      "socialimage": "https://www.investopedia.com/thmb/7gdaijqGeHU5eG_O31nWIT6opbg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-2155471226-fd13ca370a6a4cc98f8e8461f7142e88.jpg",
      "domain": "investopedia.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 6,
      "recency_weight": 1.0,
      "content": "Shares of the EV maker finished the day up more than 7%, making them the best performer sin the benchmark index—ahead of Super Micro Computer (SMCI), which rose about 6%. Meta Platforms (META) added 1.3%. Apple (AAPL), Microsoft (MSFT) and Alphabet (GOOGL) were also in the green. All of the S&P 500's 11 sectors were in the green today. This article has been updated to reflect new share price information.",
      "content_stats": {
        "total_sentences": 9,
        "relevant_sentences": 5,
        "relevance_ratio": 0.5556,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.9753,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.7658
    },
    {
      "url": "https://biztoc.com/x/9583572110a7bfcd",
      "url_mobile": "",
      "title": "Top analyst revisits Apple stock price target on march to $4 trillion",
      "seendate": "20241226T134500Z",
      "socialimage": "https://biztoc.com/cdn/9583572110a7bfcd_s.webp",
      "domain": "biztoc.com",
      "language": "English",
      "sourcecountry": "",
      "coverage_count": 1,
      "days_ago": 6,
      "recency_weight": 1.0,
      "content": null,
      "fls_label": "Not FLS",
      "fls_confidence": 0.9791,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.7658
    },
    {
      "url": "https://www.benzinga.com/insights/news/24/12/42679436/heres-how-much-you-would-have-made-owning-apple-stock-in-the-last-15-years",
      "url_mobile": "",
      "title": "Here How Much You Would Have Made Owning Apple Stock In The Last 15 Years - Apple ( NASDAQ : AAPL ) ",
      "seendate": "20241226T014500Z",
      "socialimage": "https://cdn.benzinga.com/files/images/story/2023/valuestock_image_1.jpeg?&fit=crop",
      "domain": "benzinga.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 6,
      "recency_weight": 1.0,
      "content": "A newsletter built for market enthusiasts by market enthusiasts. Top stories, top movers, and trade ideas delivered to your inbox every weekday before and after the market closes. Apple (NASDAQ:AAPL) has outperformed the market over the past 15 years by 14.69% on an annualized basis producing an average annual return of 26.58%. Currently, Apple has a market capitalization of $3.90 trillion. Buying $100 In AAPL:If an investor had bought $100 of AAPL stock 15 years ago, it would be worth$3,415.99today based on a price of $258.10 for AAPL at the time of writing. Finally -- what's the point of all this? This article was generated by Benzinga's automated content engine and reviewed by an editor. © 2026 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. To addBenzinga Newsas your preferred source on Google,click here.",
      "content_stats": {
        "total_sentences": 12,
        "relevant_sentences": 11,
        "relevance_ratio": 0.9167,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.9813,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.7658
    },
    {
      "url": "https://wallstreetpit.com/121765-apples-4-trillion-dream-ai-hype-or-real-growth/",
      "url_mobile": "",
      "title": "Apple $4 Trillion Dream : AI Hype or Real Growth ? ",
      "seendate": "20241225T000000Z",
      "socialimage": "https://wallstreetpit.com/wp-content/uploads/2016/08/apple-iphone-keyboard.jpg",
      "domain": "wallstreetpit.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 2,
      "days_ago": 7,
      "recency_weight": 1.0,
      "content": "December 24, 2024Ari Haruni Apple‘s(AAPL)stock has recently soared to new all-time highs/$258.21, inching closer to a$4 trillionmarket capitalization, driven largely by the optimism surrounding AI’s potential to spark a significant upgrade cycle for the iPhone. During a discussion on CNBC’s ‘Squawk on the Street’,Tom Forte, a senior consumer internet analyst at Maxim Group, shared his perspectives on this surge and his ongoing hold rating on Apple’s stock. Forte attributes the recent run-up in Apple’s stock to an AI-fueled rally, with expectations high that AI enhancements will lead to a major iPhone upgrade cycle. Currently trading well above 30 times its price-to-earnings (P/E) ratio, Apple’s valuation is at or above its peers who are also benefiting from the AI surge. Forte points out that even with an anticipated upgrade cycle, Apple’s earnings per share (EPS) growth over the next couple of years looks to be in the mid to high single digits, suggesting that the stock might be overpriced relative to its growth prospects. When questioned about his skepticism regarding an immediate upgrade cycle, Forte highlights a timing mismatch between hardware and software releases. The iPhone 16 lineup was introduced in September, but the AI-related software updates are being rolled out incrementally, extending into December for the U.S. and potentially April for Europe. This staggered rollout might lead consumers to wait for the next generation model, the iPhone 17, rather than upgrading immediately, thus potentially delaying or diluting the expected upgrade cycle. He also notes the ongoing education of consumers by companies like Google (GOOG) and Apple about the benefits of AI in smartphones, indicating that the demand for AI-driven upgrades is not yet a certainty. Forte has maintained his ‘hold’ rating since Apple’s developers conference where they unveiled their AI strategy, observing the market’s reaction but waiting for clear evidence of how AI will translate into earnings growth for Apple. Despite the stock’s impressive performance since the conference, he remains cautious. Discussing Apple’s potential move into home security with a new camera akin to Amazon’s Ring, Forte acknowledges Apple’s extensive installed base with the iPhone but expresses doubt about the impact of this venture on Apple’s financials. Given Apple’s size, he suggests that while such a product might add marginal earnings, perhaps around 10 cents per share, it wouldn’t significantly move the needle, especially when the iPhone still constitutes about half of Apple’s revenue. In essence, while the market celebrates Apple’s AI advancements and the potential for an upgrade cycle, Forte’s analysis suggests a more measured approach, focusing on valuation, the timing and impact of AI integration, and the comparative scale of new product entries against Apple’s massive revenue base. Disclaimer: This page containsaffiliate links. If you choose to make a purchase after clicking a link, we may receive a commission at no additional cost to you. Thank you for your support!",
      "content_stats": {
        "total_sentences": 19,
        "relevant_sentences": 18,
        "relevance_ratio": 0.9474,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.9818,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.7658
    },
    {
      "url": "https://qz.com/apple-appl-ai-intelligence-4-trillion-market-cap-2025-1851727371",
      "url_mobile": "",
      "title": "Apple could hit a $4 trillion market cap by early 2025",
      "seendate": "20241223T153000Z",
      "socialimage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/c5eb61acbf58c4ff2cb35e9b2161d79d.jpg",
      "domain": "qz.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 9,
      "recency_weight": 0.5,
      "content": null,
      "fls_label": "Specific FLS",
      "fls_confidence": 0.8603,
      "impact_horizon": "SHORT_TERM",
      "horizon_weight": 0.6937,
      "final_weight": 0.5775
    },
    {
      "url": "https://www.investopedia.com/microstrategy-stock-is-up-400-this-year-what-you-need-to-know-about-the-bitcoin-proxy-8756621",
      "url_mobile": "",
      "title": "MicroStrategy Stock Is Up 400 % This Year What You Need to Know About the Bitcoin Proxy",
      "seendate": "20241223T111500Z",
      "socialimage": "https://www.investopedia.com/thmb/efIIROSHlrME1_WH1c300fqqBWg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/MicroStrategyitschairmanMichaelSaylorandbitcoin-7ff7439c8a2543dd96b43baac69d2f55.jpg",
      "domain": "investopedia.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 9,
      "recency_weight": 0.5,
      "content": "Stock Will Join Nasdaq 100 Index on Monday Mrinalini Krishna is a former Senior Editor of investing news at Investopedia. Shares of the company have gained more than 400% since the start of 2024, as bitcoin has surged to record highs above $100,000 amid optimism that the digital currency will benefit from policies that the incoming Trump administration and a crypto-supportive Congress are likely to put in place. MicroStrategy, little known to most investors before this year's rally, is now stepping further into the spotlight as itjoins the Nasdaq 100 Index, which comprises many of the largest, most actively traded companies in the world, including Nvidia (NVDA), Apple (AAPL) and Tesla (TSLA). As a result, exchange-traded funds that track the index, such as the Invesco QQQ Trust (QQQ), have to adjust their portfolios to include MicroStrategy. However, some investors have said the blockbuster stock price gains aren't sustainable, in part because of the leverage. The strategy of using leverage, however, has translated into stock price gains that have far outpaced bitcoin, which is up about 125% since the start of the year. The company, which hasn't turned a profit in any quarter this year, purchased its first batch of bitcoin in 2020, when it was trading close to $11,000. At the end of last year MicroStrategy held 189,150 bitcoins and its assumed diluted shares outstanding figure was 207,636, making the ratio 0.91. As of Dec. But then over the course of the five years, we double or quadruple the investment, because we're buying an asset which is appreciating faster than the S&P, Saylor told CNBC. The stock is currently trading around $360. The analysts say the longer tenure of the debt gives the company some cushion against immediate repayment or volatility in bitcoin prices. Not everyone is convinced MicroStrategy's performance is sustainable. Update, Dec. X. @saylor, 8:18 PM, Dec 18, 2013. Businesswire. MicroStrategy’s Michael Saylor: We want to bridge traditional capital markets with crypto economy. U.S. Securities and Exchange Commission.",
      "content_stats": {
        "total_sentences": 44,
        "relevant_sentences": 18,
        "relevance_ratio": 0.4091,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Specific FLS",
      "fls_confidence": 0.4624,
      "impact_horizon": "SHORT_TERM",
      "horizon_weight": 0.6937,
      "final_weight": 0.5775
    },
    {
      "url": "https://www.investopedia.com/5-things-to-know-before-the-stock-market-opens-december-18-2024-8763275",
      "url_mobile": "",
      "title": "5 Things to Know Before the Stock Market Opens",
      "seendate": "20241218T174500Z",
      "socialimage": "https://www.investopedia.com/thmb/2ZjQwsuStWnlYHTp1LFIL5VjgmM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-2175611126-9f7c5490e6634d83b69d2d7a73bb0c80.jpg",
      "domain": "investopedia.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 14,
      "recency_weight": 0.5,
      "content": "News of the day for Dec. 18, 2024 Terry Lane is a writer for Investopedia with 25 years of experience in journalism and communications. Valerie Plesch / picture alliance via Getty Images Investors are expecting today'sFederal Reservemeeting to end with the announcement of another interest-rate cut; U.S. Investors will be closely watchingtoday's interest-rate announcementafter the two-dayFederal Open Markets Committee (FOMC)meeting concludes. Officials arewidely expected to lowerthefederal funds rateby a quarter-percentage point to a range of 4.25% to 4.5%. Market watchers also are anticipating the release of the Fed's economic projections, which show where officials believe inflation and interest rates are heading. U.S. stock futures are higher ahead of the FOMC decision and comments from Fed chair Powell. Crude oil futures are 0.6% higher. Nissan shares soared about 24% and those of Honda slipped 3% in Tokyo trading Wednesday after the Japanese automakers confirmed aNikkeireport that said they arein discussions to merge.The companies intend to sign a memorandum of understanding to negotiate shared equity in a holding company that would house the combined automaker, according toNikkei, potentially putting pressure on domestic rival Toyota (TM).Meanwhile,Dow Jones Newswiresreported that Foxconn, the Taiwanese company that makes Apple (AAPL) products, has also expressed interest in taking over Nissan. as part of theCHIPS and Science Act of 2022.",
      "content_stats": {
        "total_sentences": 27,
        "relevant_sentences": 11,
        "relevance_ratio": 0.4074,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Specific FLS",
      "fls_confidence": 0.5376,
      "impact_horizon": "SHORT_TERM",
      "horizon_weight": 0.6937,
      "final_weight": 0.5775
    },
    {
      "url": "http://baystreet.ca/stockstowatch/19857/Todays-Stock-News-on-Honda-Apple-and-Energy-Stocks",
      "url_mobile": "/amp/articles/stockstowatch.aspx?articleid=106916",
      "title": "Baystreet . ca - Today Stock News on Honda , Apple , and Energy Stocks",
      "seendate": "20241224T171500Z",
      "socialimage": "http://baystreet.ca/images/articlegroups/original/7/private/apple.jpg",
      "domain": "baystreet.ca",
      "language": "English",
      "sourcecountry": "Canada",
      "coverage_count": 1,
      "days_ago": 8,
      "recency_weight": 0.5,
      "content": "NSANY stock already last week on Dec. 17 in anticipation of the news. The merger would create the third-largest automaker as measured by sales. The deal creates operational headwinds. Apple (AAPL) closed at a fresh all-time high on Monday. At 3.931 trillion dollars in market cap, the $4 trillion level is next. While the rise is inevitable, AAPL stock risks pulling back. The firm’s iPhone does not offer compelling features that would ignite an upgrade supercycle among its customers. Wait for WTI crude prices to stabilize. The stock trades at a 13.11 times P/E multiple.",
      "content_stats": {
        "total_sentences": 19,
        "relevant_sentences": 10,
        "relevance_ratio": 0.5263,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.9378,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.4658
    },
    {
      "url": "https://www.benzinga.com/markets/24/12/42668097/warren-buffett-heads-into-2025-with-325-billion-cash-pile-his-largest-in-over-three-decades-expert-says-it-will-provide-an-opportunity-for-the-successors-to-make-their-own-mark",
      "url_mobile": "",
      "title": "Warren Buffett Heads Into 2025 With $325 Billion Cash Pile , His Largest in Over Three Decades : Expert Says It  Will Provide An Opportunity For The Successors To Make Their Own Mark  - Apple ( NASDAQ : AAPL ), Bank of America ( NYSE : BAC ) ",
      "seendate": "20241224T140000Z",
      "socialimage": "https://cdn.benzinga.com/files/images/story/2024/12/24/1--Transformation-Of-Berkshire-Hathaway.jpeg?&fit=crop",
      "domain": "benzinga.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 8,
      "recency_weight": 0.5,
      "content": "A newsletter built for market enthusiasts by market enthusiasts. Top stories, top movers, and trade ideas delivered to your inbox every weekday before and after the market closes. Warren Buffettis entering 2025 with the largest cash reserve atBerkshire Hathaway(NYSE:BRK) (NYSE:BRK) in over three decades. What Happened: The conglomerate’s cash holdings have reached a staggering $325 billion, marking the highest percentage of total assets since 1990, CNBCreportedon Tuesday. This cash accumulation comes as Buffett, 94, finds few attractive investment opportunities amid a highly valued market. The “Buffett indicator,” which compares the total market value of U.S. stocks to GDP, has soared to 209%, a level not seen since the 1929 market peak, according to Oppenheimer data. Throughout 2024, Buffett sold significant portions of his largest holdings, includingApple Inc.(NASDAQ:AAPL) andBank of America Corp.(NYSE:BAC), offloading $133 billion in stocks during the year’s first three quarters. AnalystKevin Healfrom Argus Research suggests that some of the cash could be used for investments in distressed situations, allowing successors to leave their mark. This will also provide an opportunity for the successors to make their own mark when Mr. Buffett ocially hands over the reins. Why It Matters: This substantial cash reserve positions Berkshire Hathaway for strategic maneuvers in the coming years. Recently, Buffett’s investment activities have shown a shift. This move, totaling around $405 million, raised Berkshire’s ownership to 28% of Occidental, valued at approximately $12 billion. Benzinga does not provide investment advice. All rights reserved. To addBenzinga Newsas your preferred source on Google,click here.",
      "content_stats": {
        "total_sentences": 21,
        "relevant_sentences": 16,
        "relevance_ratio": 0.7619,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.4952,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.4658
    },
    {
      "url": "https://www.investors.com:443/research/apple-stock-meta-taiwan-semi-stock/",
      "url_mobile": "",
      "title": "Apple Stock And Two Other 2024 Winners Are On Fund Manager Radars",
      "seendate": "20241224T023000Z",
      "socialimage": "https://www.investors.com/wp-content/uploads/2024/09/Stock-Apple-iPhone16f-company.jpg",
      "domain": "investors.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 8,
      "recency_weight": 0.5,
      "content": "Investors are not alone as they look toward 2025 by looking back on the leaders of 2024. Big funds are leaning toward leaders such as Apple (AAPL), which outperformed during the year as well. IBD's screen of stocks funds are buying shows Taiwan Semiconductor (TSM,) Meta Platforms (META) and Apple among those getting the most demand.",
      "content_stats": {
        "total_sentences": 4,
        "relevant_sentences": 3,
        "relevance_ratio": 0.75,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.9693,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.4658
    },
    {
      "url": "https://www.sharecast.com/news/market-report-us-close/us-close-stocks-push-higher-despite-mixed-economic-data--18379740.html",
      "url_mobile": "",
      "title": "US close : Stocks push higher despite mixed economic data",
      "seendate": "20241224T023000Z",
      "socialimage": "",
      "domain": "sharecast.com",
      "language": "English",
      "sourcecountry": "United Kingdom",
      "coverage_count": 1,
      "days_ago": 8,
      "recency_weight": 0.5,
      "content": "US stocks finished Monday's session higher despite a batch of mixed economic data, with the Dow rising for the third straight day as indices continue their attempted recovery from last week's sell-off. Nevertheless, Wall Street trading was expected to be somewhat muted this week, with the NYSE shutting up shop early on Tuesday for the festive break and not opening again until Thursday. Orders were down 1.1% in November, after a 0.8% gain in October, worse than the 0.4% decline expected by the market. Elsewhere, consumer sentiment in the US unexpectedly declined in December, pulling back after strong gains over the previous two months as concerns about the future outlook returned. The Conference Board's closely followed consumer confidence index fell to 104.7 this month from 112.8 in November, surprising analysts who had forecast a small improvement to 112.9. Meanwhile, new home sales rose by 5.9% to 664,000 in November, slightly ahead of the 650,000 consensus estimate, but only partially rebounding after the revised 14.8% slump registered the month before. Under the terms of the deal, shareholders will receive $24.25 a share in cash, a 42% premium to the closing price on 18 March – the day before M&A speculation began – though this was slightly below Friday's closing price. Inc. (JPM)$238.390.33%Apple Inc. (AAPL)$255.270.31%Travelers Company Inc. (INTC)$20.203.48%KLA-Tencor Corp. (BIDU)$88.463.10%KLA-Tencor Corp. (ILMN)$134.99-0.76%",
      "content_stats": {
        "total_sentences": 70,
        "relevant_sentences": 13,
        "relevance_ratio": 0.1857,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.6807,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.4658
    },
    {
      "url": "https://www.investors.com:443/news/technology/apple-stock-record-high-strong-holiday-sales/",
      "url_mobile": "",
      "title": "Apple Stock Hits Record High Amid Strong Holiday Sales | Investor Business Daily",
      "seendate": "20241223T220000Z",
      "socialimage": "https://www.investors.com/wp-content/uploads/2024/12/Stock-Apple-Bags-company.jpg",
      "domain": "investors.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 2,
      "days_ago": 9,
      "recency_weight": 0.5,
      "content": "Apple (AAPL) stock notched a record high on Monday after a Wall Street analyst said the consumer electronics giant is likely to have strong holiday season sales. Wedbush Securities analyst Daniel Ives reiterated his outperform rating on Apple stock with a 12-month price target of 300. On the stock market today, Apple stock jumped to a record high of 255.65…",
      "content_stats": {
        "total_sentences": 3,
        "relevant_sentences": 3,
        "relevance_ratio": 1.0,
        "condensed": false,
        "filter_action": "no_change"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.9755,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.4658
    },
    {
      "url": "https://www.benzinga.com/24/12/42656752/5-tech-stocks-to-buy-as-ai-hype-fizzles",
      "url_mobile": "",
      "title": "5 Tech Stocks to Buy as AI Hype Fizzles - Apple ( NASDAQ : AAPL ), CACI International ( NYSE : CACI ) ",
      "seendate": "20241223T191500Z",
      "socialimage": "https://cdn.benzinga.com/files/images/story/2024/12/23/investor-charts-ai2.png?&fit=crop",
      "domain": "benzinga.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 9,
      "recency_weight": 0.5,
      "content": "A newsletter built for market enthusiasts by market enthusiasts. Top stories, top movers, and trade ideas delivered to your inbox every weekday before and after the market closes. Fed chair Powell dropped a big lump of coal in the market’s stocking last week as he reigned in the Fed’s rate cut projections for 2025. While the Fed cut its key benchmark rate by the expected 25 basis points, Powell tempered expectations on future rate cuts based on sticky inflation data and the continued robust spending from American consumers. The Fed's so-called ‘dot plot,' which anticipates the frequency and strength of future rate activity, now indicates only two rate cuts in 2025, with a Fed funds rate at 3.75% – 4.00% by the end of next December. Markets did not take kindly to the news, and major indices closed starkly lower after being flat for most of the day. Nasdaq led the losers, with the tech-heavy index dropping more than 3.5%. After hours, AI-darling Micron Technology added to the pain with a significant earnings miss, and the stock had itsworst performance since March 2020the following day. Add in a close-call government shutdown and low holiday trading volume, and it was the perfect storm for some year-end volatility. And it won’t stop there. A cautious Fed means cautious investors and a change in strategy is necessary for 2025. Is this the end of the AI-infused tech rally? The prospects of rate reductions slashing capital costs and juicing stock prices have diminished, and AI stocks are beginning to see some cracks form. While AI isn't exiting the investment landscape anytime soon, the big winners over the last two years look to be finally taking a breather. In their place, we've identified five tech stocks not dependent on AI that could lead the way in 2025. seems to battle antitrust action every few years, causing a drawdown that eventually rebounds once investors realize the company still makes boatloads of cash every quarter. The stock slumped in the summer following a poor earnings report and again in November on (you guessed it)antitrust concerns, but it’s currently back near all-time highs. The company finally posted a positive annual net income figure in 2023, and the stock rallied from $25 to $80 between December 2022 and February 2024. But the rally stalled there, and the stock bounced between $60 and $80 for most of the last nine months. CACI International provides cybersecurity, cyberspace and digital solutions for domestic and international clients. CACI shares may have been unfairly unloaded as the price plunged down to $400 after approaching $580 in early November. The RSI reading of 27 indicates an oversold stock, and the company has good fundamentals with a 19.9 P/E ratio and a consensus Buy rating from analysts. Sometimes, you don't need to overthink it. Apple has been one of the biggest winners in the tech sector since Trump's election, and the company's cash pile is the envy of the business world. Despite already being one of the largest companies in the world by market cap, investors may have an opportunity here as the AI rally spins down. AAPL is a staple in any long-term investment portfolio, but the time is ripe to add more shares. The stock has been roaring upward since May 2024 and made another new all-time high as the third week of December came to a close. AAPL is now approaching a $4 trillion market cap, and its rally could continue in 2025 if the company is granted tariff exemptions similar to the ones it received during the first Trump administration. Don't let profit opportunities slip away in 2025. Get Benzinga Pro today and receive exclusive market news alerts 30 minutes ahead of the competition. Trade smarter with powerful tools at 60% off. Act now—this deal ends December 31! Benzinga does not provide investment advice. All rights reserved. To addBenzinga Newsas your preferred source on Google,click here. Additionally, Waymo is one of the most significant success stories related to autonomous driving to date. The companyrecently announceda new service in Tokyo, its first international city, and recent testing data continues to show impressivesafety statistics. We think this recent drawdown is overdone, and the stock could be poised for a rally in 2025. Despite the proliferation of Waymo, Uber is still the dominant force in rideshare, and its ride-hailing market share is actually expanding compared to its biggest rival, Lyft. From a technical standpoint, the stock is oversold according to the Relative Strength Index (RSI) and the 50-day moving average is still hovering above the 200-day MA. As long as the 50-day stays above the 200-day, UBER shares might be an interesting buy at this level. As mentioned above, if AI takes a breather over the next few months, one investment theme that could emerge is quantum computing. used to be known as Innovative Beverage Group, which raises some questions about its dedication to the industry. There may be better choices to take advantage of this trend, like Rigetti Computing Inc. RGTI shares also experienced a meteoric rise over the last month, but not at the level of QUBT despite a much longer history in the quantum computing space. That could be a good development for investors, as Rigetti is better positioned to thrive if quantum computing takes off thanks to itsinnovative product lineand decade-plus history in the industry.",
      "content_stats": {
        "total_sentences": 57,
        "relevant_sentences": 46,
        "relevance_ratio": 0.807,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.9797,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.4658
    },
    {
      "url": "https://www.insidermonkey.com/blog/top-10-ai-stocks-to-watch-right-now-1410644/",
      "url_mobile": "https://www.insidermonkey.com/blog/top-10-ai-stocks-to-watch-right-now-1410644/?amp=1",
      "title": "Top 10 AI Stocks to Watch Right Now - Insider Monkey",
      "seendate": "20241223T124500Z",
      "socialimage": "https://d2gr5kl7dt2z3t.cloudfront.net/blog/wp-content/uploads/2022/06/22081724/pexels-alphatradezone-5831269.jpg",
      "domain": "insidermonkey.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 9,
      "recency_weight": 0.5,
      "content": "Tom Hancock, GMO U.S. quality ETF portfolio manager, said in a latest program on CNBC that the NASDAQ has become “risky” bet amid a lot of volatility. “It’s become not really an index; it’s become a single bet. So it it’s a very risky thing to invest in. It’s not what I think you would want from a sort of diversified investor. It’s probably going to give you more volatile returns next year, and I’d a little bit worry that the AI rally has extended itself. He thinks AI stocks have become a “hype trade” and any “hiccup” in the economy could result in these stocks crashing. Hancock believes AI gains are now set to broaden out to smaller companies that have not received a lot of attention so far. READ ALSO7 Best Stocks to Buy For Long-Termand8 Cheap Jim Cramer Stocks to Invest In For this article we picked 10 AI stocks currently trending based on latest news. The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points(see more details here). The firm sees significant potential in the application-specific integrated circuit (ASIC) market, largely driven by the rapid growth of artificial intelligence. The research firm highlighted that companies involved in AI compute, networking, and storage benefited in 2024 due to strong infrastructure development, resulting in notable share price outperformance and positive earnings revisions. The firm sees significant potential in the application-specific integrated circuit (ASIC) market, largely driven by the rapid growth of artificial intelligence. The research firm highlighted that companies involved in AI compute, networking, and storage benefited in 2024 due to strong infrastructure development, resulting in notable share price outperformance and positive earnings revisions. We believe Marvell has among the broadest range of intellectual property in technological areas (e.g., high-bandwidth data switching and storage applications) that position it well for the growing requirements of data centers, wireless networks and autos. Several of the company’s product lines (e.g., custom silicon, optical connectivity and switching) are benefiting from the growth of AI data centers. And we believe a significant opportunity exists for the company to help design and manufacture cost-effective custom data center chips that would help cloud providers reduce their reliance on expensive graphics processing units (GPUs). And ultimately, those are AI products. I believe that the market itself is doing a bit of a repricing, but you know, ultimately we’re talking about the future of transportation here. And when we look out, ultimately, we believe the dominant automotive platform will be EVs paired with autonomy. The legacy OEMs are either cutting or removing both their EV and autonomy programs. How? What about the $30,000 price tag claim? Musk has indicated that the Cybercab will have a production cost of approximately $30,000. Operating within the robotaxi fleet is projected to cost around $0.20 per mile. With a production cost of $30,000, the retail price of the Cybercab is likely to exceed this figure. For instance, if the Cybercab is priced at $30,000 per unit, that translates to $15,000 per seat. Regarding operational costs, while the Cybercab is expected to cost $0.20 per mile, charging the Model 3 is estimated at under $0.10 per mile, leaving a significant margin to cover maintenance and downtime. What are these challenges? Meanwhile, competitors are rolling out more advanced models. Chinese competitor BYD is also gaining ground in Europe, despite talk of tariffs. In short, the market seems to be pricing in a lot of positive optionality for this company in the near-to-intermediate term (and particularly a fully autonomous fleet of electric vehicles in the medium term). What exists today is an automobile manufacturer limited to the higher-income segment that is increasingly challenged to sell vehicles when interest rates are not zero. “You have to be a little careful with these sort of first-party benchmarks, but they believe that they will compete well versus a subset of Nvidia’s parts. But the issue is those parts that they’re competing at with Nvidia are already here, right? So, I mean, it’s growing off of that. But I can clearly see where the dollars are really flowing in the space. According to Goldman Sachs Research, global data center demand could surge by 160% by 2030. In the U.S., data centers are projected to use 8% of total power by 2030, up from 3% in 2022. McKinsey estimates that adding the required U.S. capacity will need over $500 billion in infrastructure investment by the decade’s end. However, the stock could face the impact of what Nvidia is facing today: too high expectations. The company has narrowly exceeded revenue expectations by less than 5% in most cases. Some analysts suggest Broadcom’s growth rates will moderate to below 20% CAGR starting the first quarter of 2025. In fiscal Q4, it was +50% topline growth. The market won’t be kind to the stock when the revenue growth rate slows. Broadcom has about $58 billion in net debt, which is relatively high. With an enticing combination of custom chip offerings as well as networking assets, Broadcom remains one of the best positioned companies as part of the AI revolution. The company’s dominant market position in its end markets, along with durable growth, strong margins and best-in-class capital allocation, presents an opportunity to compound capital over time.” Number of Hedge Fund Investors: 158 Investment firm J.P. Morgan recently said that the latest Wave7 Research survey indicates Apple’s (NASDAQ:AAPL) iPhone 16 is lagging in market share compared to the previous cycle, potentially due to limited awareness of Apple Intelligence. “Recent surveys from Wave7 Research into US sales trends across various carriers in Oct/Nov-24 highlight that average share for iPhone 16 cycle continues to track lower y/y (relative to share for iPhone 15 in the same period) despite better than seasonal trends in the latest month of survey data,” J.P. “The survey highlights that the lower momentum, reflected in the lower market share y/y, is likely led by the (still) lower consumer awareness for Apple Inc (NASDAQ:AAPL) Intelligence, despite expectations for the feature set to be a key driver for an upgrade cycle.” Chatterjee maintains an Overweight rating on Apple shares. Apple Inc (NASDAQ:AAPL) has been seeing a long-term decline in mobile carrier upgrade rates, especially postpaid, for several years. This suggests that people are holding onto their devices longer, likely due to economic factors, satisfaction with current technology, or a lack of exciting new features in recent models. In the latest earnings call, Apple Inc (NASDAQ:AAPL) CEO Tim Cook highlighted new features for the iPhone, such as a more comfortable watch band and sleep apnea detection, but none appeared to be major demand drivers for new customers. Parnassus Growth Equity Fund stated the following regarding Apple Inc. Investors reacted positively to the new iPhone 16 lineup and its advanced features, including generative artificial intelligence, greater durability and increased processing power.” HeadlineNASDAQ:ADINASDAQ:AMDNASDAQ:AAPLNASDAQ:NVDANASDAQ:METANASDAQ:GOOGNASDAQ:AVGONASDAQ:AMZNDaily NewsletterApple Inc (NASDAQ:AAPL)Tesla Inc. Cancel anytime.",
      "content_stats": {
        "total_sentences": 123,
        "relevant_sentences": 59,
        "relevance_ratio": 0.4797,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.8965,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.4658
    },
    {
      "url": "https://www.fool.co.uk/2024/12/22/how-to-target-a-100000-second-income-starting-with-just-1000/",
      "url_mobile": "",
      "title": "How to target a £100 , 000 second income starting with just £1 , 000",
      "seendate": "20241222T153000Z",
      "socialimage": "https://www.fool.co.uk/wp-content/uploads/2024/07/Hill-climbing-1200x800.jpg",
      "domain": "fool.co.uk",
      "language": "English",
      "sourcecountry": "United Kingdom",
      "coverage_count": 1,
      "days_ago": 10,
      "recency_weight": 0.5,
      "content": "You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today toget instant access to our top analyst recommendations, in-depth research, investing resources, and more.Learn More. Zaven Boyrazian explains the various strategies investors can use to try and earn a £100,000 second income in the stock market. Image source: Getty Images You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today toget instant access to our top analyst recommendations, in-depth research, investing resources, and more.Learn More. Building a £100,000 second income is no easy feat. At least, not for those who don’t already have a seven-figure net worth. But by leveraging the power ofcompounding returnsin the stock market, building a passive income of this size in the long run is more achievable than most would think, even when starting with just £1,000. Let’s start by figuring out exactly how much a portfolio would need to grow to generate a six-figure income. On average, British dividend stocks offer a yield of 4%. But by being a bit more selective, it’s possible to push this to 5% without taking on too much extra risk. Yet, even with this slight boost, an investor would still need a £2m portfolio to hit the £100,000 income target. So how can investors turn £1,000 into £2m? One method is to dive into the realm of penny stocks. However, given enough time, they could develop into future industry leaders. Fun fact: a £1,000 investment inApple(NASDAQ:AAPL) when it was a penny stock in 1986 is now worth over £3.1m. So all investors have to do is find the next Apple. Sadly, the vast majority of penny stocks fail to deliver, and investors are often left with nothing. In other words, this is an exceptionally high-risk strategy. No investment in thestock marketis risk-free. However, there are significantly safer ways to invest than penny stocks. And in many cases, these can still be highly lucrative if investors are willing to drip feed more money over time. For example, theFTSE 100’s generated a long-term average return of around 8%. However, by selecting individual high-quality stocks, it’s possible to boost this return. Even a 2% boost can make an enormous difference in the long run. And investing £500 a month on top of the £1,000 starting capital at 10% can build a £2m portfolio in about 35 years. Then it’s just a matter of switching strategies around from growth to dividends to start earning a £100,000 second income. Of course, this introduces a new challenge. Let’s zoom in again on Apple. What made it so successful? The firm’s cultivated enormous pricing power driven by a cult-like following from its customers. After all, it’s not uncommon to see massive queues lining up outside its stores whenever a newiPhone’s released. Such behaviour also signals a reputation for quality to non-Apple customers. And that might just be the convincing factor to convert a newiPhoneuser. This is just one of many competitive advantages Apple has leveraged over the years. Even Apple’s exposed to risks today, such as the brewing trade war between the US and China, where the firm manufactures most of its products. Nevertheless, filtering out companies that don’t have a discernible advantage over their rivals can quickly eliminate a lot of losing investments from consideration. Zaven Boyrazian has no position in any of the shares mentioned. The Motley Fool UK has recommended Apple. Views expressed on the companies mentioned in this article are those of the writer and therefore may differ from the official recommendations we make in our subscription services such as Share Advisor, Hidden Winners and Pro.",
      "content_stats": {
        "total_sentences": 47,
        "relevant_sentences": 40,
        "relevance_ratio": 0.8511,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.9636,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.4658
    },
    {
      "url": "https://www.insidermonkey.com/blog/jim-cramer-on-apple-inc-aapl-i-say-own-it-dont-trade-it-its-so-far-the-biggest-position-in-our-trust-1411514/",
      "url_mobile": "https://www.insidermonkey.com/blog/jim-cramer-on-apple-inc-aapl-i-say-own-it-dont-trade-it-its-so-far-the-biggest-position-in-our-trust-1411514/?amp=1",
      "title": "Jim Cramer on Apple Inc . ( AAPL ):  I Say Own It Dont Trade It . . . It So Far The Biggest Position In Our Trust  ",
      "seendate": "20241221T130000Z",
      "socialimage": "https://d2gr5kl7dt2z3t.cloudfront.net/blog/wp-content/uploads/2023/09/19155253/AAPL-insidermonkey-1695153171712.jpg",
      "domain": "insidermonkey.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 11,
      "recency_weight": 0.5,
      "content": "(NASDAQ:AAPL) stands against the other stocks Jim Cramer recently talked about. With the Federal Reserve’s December meeting over, Wall Street has now shifted into a new paradigm. While the central bank did cut interest rates by 25 basis points in a widely anticipated move, the bank also signaled that 2025 might be accompanied by fewer interest rate cuts than many might have anticipated. In fact, not only are markets convinced that the Fed will cut less in 2025, but some even believe that the interest rates might be hiked especially since the central bank’s median 2025 inflation outlook is 2.5% which is higher compared to the earlier 2.1%. David, there are cohorts that are indeed rolling over. It isn’t like everything is just super strong and everything is quantum computing and Rocket Lab!” Cramer added that while some believe that sections of the economy such as retail are strong, there might be a need to look deeper. “Look there’s this growing consensus not represented necessarily in these Fed fund futures but that just says why are they doing this? And I come back and say why are they doing this,” said Cramer, adding “So I think that the talking heads, and boy are there ever a lot of talking heads, have decided that look that if you look at what we’re seeing in some retailers, things are strong. According to him, “I don’t know where these people get that things are strong, they look at the aggregate numbers, I look at the individual companies, I am trying to find companies that are strong.” Cramer was also perplexed by the Atlanta Fed’s Q4 3.2% GDP growth estimates. He shared that he’s “trying to find why. I’m trying to find where that is. You know David that travel’s very strong yeah. Leisure’s very strong. Dining out’s very strong. These are strong and by the way, they’re very obvious, they look obvious to the Atlanta Fed. While he might be having a hard time believing the GDP estimates, there isn’t a doubt in his mind that the US is the best place to invest. We used to be able to look at their electric power. . . . Employs a lot of people. The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points. (see more details here). A wide view of an Apple store, showing the range of products the company offers. Number of Hedge Fund Holders In Q3 2024: 158 Apple Inc. (NASDAQ:AAPL) is the most valuable consumer electronics firm in the world and one whose valuation could touch $4 trillion soon. As it generates 51.6% of its revenue from the iPhone, the iconic smartphone lineup is baked into Apple Inc. (NASDAQ:AAPL)’s hypothesis. The stock responds to even the slightest of credible news of the smartphone either facing reduced demand or Apple Inc. (NASDAQ:AAPL) deciding to lower its manufacturing orders to contract manufacturers. The high valuation approaching a $4 trillion market cap and the iPhone’s criticality was also on Cramer’s mind as he started by discussing how Apple Inc. (NASDAQ:AAPL)’s high P/E ratio hasn’t dissuaded buyers: “And people will not stop buying it. . . .Well David, I mean one of the things that’s happening is is there’s people who just say we’re getting away from the cellphone cycle. “I say own it don’t trade it. . . it’s so far the biggest position in our trust. But I do think that if we can just get away from the [IPHONE] 17, or the 17 and 18, the 19, get away from that and make this much more of a service story. Now Tim Cook bridles if you say look, it’s Razor, Razor Blade. Because this is a tech company with the highest satisfaction. But I do think that if you could make it so that the service revenue is the thing and you’ve got China, without China orders [inaudible] so Apple’s no longer dependent on just China orders. And you get a higher multiple, but this multiple has to be followed up by a dynamite 2025. “I mean I was going over my core holdings for tomorrow’s speech, and it’s still a core holding. Would I come in and buy the stock right now? I mean I’d think I’d wait for a bit of a comeback, it’s just been, it trades like uh, Oklo. And it’s Apple. Unbelievably great company. I don’t know what to do. This is a total quandry for me. How do you tell people to buy Apple at that multiple when it doesn’t have that kind of consistency. And you have to believe that what they do have is a plan to be able to, so that they are out of the cycle business.” Overall AAPLranks 3rdon our list of the stocks Jim Cramer recently talked about. While we acknowledge the potential of AAPL as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than AAPL but that trades at less than 5 times its earnings, check out our report about thecheapest AI stock. READ NEXT:8 Best Wide Moat Stocks to Buy Nowand30 Most Important AI Stocks According to BlackRock. This article is originally published atInsider Monkey. Cancel anytime.",
      "content_stats": {
        "total_sentences": 78,
        "relevant_sentences": 59,
        "relevance_ratio": 0.7564,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.9752,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.4658
    },
    {
      "url": "https://www.sharecast.com/news/market-report-us-close/us-close-stocks-higher-following-november-pce-reading--18365704.html",
      "url_mobile": "",
      "title": "US close : Stocks higher following November PCE reading",
      "seendate": "20241221T031500Z",
      "socialimage": "",
      "domain": "sharecast.com",
      "language": "English",
      "sourcecountry": "United Kingdom",
      "coverage_count": 1,
      "days_ago": 11,
      "recency_weight": 0.5,
      "content": "Wall Street stocks closed higher on Friday as the blue-chip clawed back some of this week's heavy losses. Friday's primary focus was November's personal consumption expenditures index, which revealed Americans continued to spend at a steady clip last month, while prices rose slightly less than anticipated. According tothe Department of Commerce, in seasonally adjusted terms, personal incomes rose at a month-on-month clip of 0.3% during November, while personal spending increased by 0.4%. On the inflation front, the annual rate of increase in the price deflator for personal consumption expenditures ticked higher from 2.3% to 2.4%. Core PCE prices meanwhile were steady at 2.8% year-on-year (consensus: 2.9%). Elsewhere on the macro front, Consumer confidence in the US rose modestly, although inflation expectations were mixed, the results of a closely followed survey revealed. A final reading onthe University of Michigan's consumer confidence index for the month of December came in at 74.0, which was up from 71.8 one month before - in line with a preliminary reading and consensus forecasts. Also drawing some investor attention, the yield on the benchmark 10-year Treasury note was more than five basis points lower at 4.519% after breaking above the 4.5% barrier earlier in the week. (AXP)$298.651.90%Apple Inc. (AAPL)$254.491.88% Dow Jones - Fallers Merck & Co. Inc. Inc. (MU)$90.123.48%Mercadolibre Inc. (INTC)$19.522.41%Workday, Inc. (JD)$35.64-0.75%",
      "content_stats": {
        "total_sentences": 60,
        "relevant_sentences": 15,
        "relevance_ratio": 0.25,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.9784,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.4658
    },
    {
      "url": "https://macdailynews.com/2024/12/20/apple-shares-hit-new-all-time-intraday-and-closing-highs-241220/",
      "url_mobile": "https://macdailynews.com/2024/12/20/apple-shares-hit-new-all-time-intraday-and-closing-highs-241220/amp/",
      "title": "Apple shares hit new all - time intraday and closing highs",
      "seendate": "20241220T221500Z",
      "socialimage": "",
      "domain": "macdailynews.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 12,
      "recency_weight": 0.5,
      "content": "In Nasdaq trading today, shares of Apple Inc. (AAPL) rose $4.70, or 1.87%, to $254.46, a new all-time closing high. Apple’s intraday high was also set today at $255.00. Apple’s 52-week low stands at $164.08. Monday’s trading volume for AAPL shares was a raucous 125,429,724 versus Apple’s average trading volume of 42,989,052 shares. Apple’s PE Ratio currently stands at 41.93. Apple currently has a market value of $3.847 trillion, making it the world’s most valuable company. The top five U.S. publicly-traded companies, based on market value: Selected companies’ current market values: • Meta Platforms (META) – $1.477T• Tesla (TSLA) – $1.352T• Taiwan Semi (TSM) – $1.023T • Berkshire Hathaway (BRK-A) – $980.375B• Walmart (WMT) – $741.080B • Netflix (NFLX) – $388.581B• Cisco (CSCO) – $233.071B• IBM (IBM) – $206.556B• Disney (DIS) – $202.825B• Adobe (ADBE) – $196.844B• Advanced Micro Devices (AMD) – $193.455B• Sony (SONY) – $128.988B • Spotify (SPOT) – $93.011B• Intel (INTC) – $84.190B• SoftBank (SFTBF) – $81.690B• Dell (DELL) – $81.162B• Hewlett-Packard (HPQ) – $30.891B• Nokia (NOK) – $23.873B• SiriusXM (SIRI) – $7.829B• BlackBerry (BB) – $2.180B• Sonos (SONO) – $1.773B • RealNetworks (RNWK) was delisted from U.S. Apple all-time high (AAPL) via NASDAQhere. We are currently about 1/4th of the way to being sustainable with Substack subscriptions. Please tell your Apple-loving friends aboutMacDailyNews on Substackand, if you’re currently a free subscriber, please consider $5/mo. or $50/year to keep MacDailyNews going. Just hit the subscribe button. Thank you! Read on Substack ‎Please help support MacDailyNews — and enjoy subscriber-only articles, comments, chat, and more — by subscribing to our Substack:macdailynews.substack.com. Thank you! Support MacDailyNews at no extra cost to you byusing this link to shop at Amazon.",
      "content_stats": {
        "total_sentences": 19,
        "relevant_sentences": 18,
        "relevance_ratio": 0.9474,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.9736,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.4658
    },
    {
      "url": "https://www.fool.com.au/2024/12/21/if-an-investor-put-5000-in-nvidia-shares-5-years-ago-heres-what-theyd-have-now/",
      "url_mobile": "",
      "title": "If an investor put $5 , 000 in Nvidia shares 5 years ago , here what theyd have now",
      "seendate": "20241220T211500Z",
      "socialimage": "https://www.fool.com.au/wp-content/uploads/2020/06/Cash-dividends-16.9-1200x675.jpg",
      "domain": "fool.com.au",
      "language": "English",
      "sourcecountry": "Australia",
      "coverage_count": 1,
      "days_ago": 12,
      "recency_weight": 0.5,
      "content": "You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today toget instant access to our top analyst recommendations, in-depth research, investing resources, and more.Learn More Just how could have the returns been since back in 2019? Let's find out. Image source: Getty Images You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. While the California-based chip designer was certainly not an unknown and had many admirers, few would have predicted that it would go on to surpassApple(NASDAQ: AAPL) and become the world's most valuable company last month. And while a pullback in December means that it has now given back this crown to the iPhone maker, this doesn't make its last five years any less impressive. Seemingly out of nowhere in November 2022, ChatGPT was launched by OpenAI and showed the world just how revolutionary AI could be. Soon after launch, the generative AI chatbot quickly became the fastest-growing consumer app in history by achieving a staggering 100 million monthly active users within two months. As a result, this has put a rocket under demand for its chips and underpinned stellar revenue and earnings growth. Let's find out. As a result, the real price that investors would have paid to buy its shares in 2019 will be different to the adjusted price. This means that with a US$5,000 investment, investors would have ended up with 836 shares in their portfolio. This means that those 836 shares now have a market value of approximatelyUS$109,250. That's almost US$105,000 more than they started with. In fact, their original US$5,000 investment accounts for just 4.6% of their holding now. The rest is pure profit. The good news is that there could be more gains to come as well. This implies potential upside of almost 42% for investors at the time of writing. Here's hoping this is the start of more great returns for shareholders of this high-quality company. The Motley Fool Australia's parent company Motley Fool Holdings Inc. has positions in and has recommended Apple and Nvidia. The Motley Fool Australia has recommended Apple and Nvidia. The Motley Fool has adisclosure policy. Authorised by Scott Phillips.",
      "content_stats": {
        "total_sentences": 35,
        "relevant_sentences": 24,
        "relevance_ratio": 0.6857,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.956,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.4658
    },
    {
      "url": "https://www.defenseworld.net/2024/12/20/apple-inc-nasdaqaapl-shares-sold-by-rcs-financial-planning-llc.html",
      "url_mobile": "",
      "title": "Apple Inc . ( NASDAQ : AAPL ) Shares Sold by RCS Financial Planning LLC",
      "seendate": "20241220T120000Z",
      "socialimage": "",
      "domain": "defenseworld.net",
      "language": "English",
      "sourcecountry": "Russia",
      "coverage_count": 1,
      "days_ago": 12,
      "recency_weight": 0.5,
      "content": null,
      "fls_label": "Not FLS",
      "fls_confidence": 0.9887,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.4658
    },
    {
      "url": "https://www.insidermonkey.com/blog/dan-niles-says-apple-aapl-new-iphone-features-werent-particularly-good-highlights-slowing-growth-1410223/",
      "url_mobile": "https://www.insidermonkey.com/blog/dan-niles-says-apple-aapl-new-iphone-features-werent-particularly-good-highlights-slowing-growth-1410223/?amp=1",
      "title": "Dan Niles Says Apple ( AAPL ) New iPhone Features Werent  Particularly Good , Highlights Slowing Growth",
      "seendate": "20241219T184500Z",
      "socialimage": "https://d2gr5kl7dt2z3t.cloudfront.net/blog/wp-content/uploads/2023/09/19155253/AAPL-insidermonkey-1695153171712.jpg",
      "domain": "insidermonkey.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 13,
      "recency_weight": 0.5,
      "content": "We recently published a list ofWall Street Analysts Can’t Stop Talking About These 10 AI Stocks. In this article, we are going to take a look at where Apple Inc (NASDAQ:AAPL) stands against other stocks Wall Street analysts can’t stop talking about. Henry Ajder, Latent Space Advisory founder, said in a latest program on CNBC that lack of fresh data remains a key challenge for the performance of AI systems after a period of “huge” developments and fast learning. “I think data is the real problem here. We have a finite amount of data available on the internet and a limited number of sources for live, fresh data. Ajder believes there won’t be a complete “halt” to the progress in AI systems but in 2025 we are expected to see a slowdown. READ ALSO:7 Best Stocks to Buy For Long-Termand8 Cheap Jim Cramer Stocks to Invest In For this article we picked 10 AI stocks currently trending based on latest news. The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points(see more details here). A wide view of an Apple store, showing the range of products the company offers. He explained his case: “The company has grown revenues cumulatively, if you include this year’s calendar year, at 5% over the last 3 years. And every product, you know, people go, ‘Oh my God, Vision Pro is going to be terrific,’ and then you figure out, no, nobody’s going to wear ski goggles on their head. Then you look at what’s going on with the iPhone and the features they’ve rolled out, which surprised me because they weren’t particularly good to start with. They’re going to get upgraded in December in the US, but then you have to wait for next year for it to be upgraded in the rest of the world. And you’ve got a company that’s also trading at a 33 P/E for 5% revenue growth over the past three years combined. So that’s the other one where if people finally go, ‘You know what? It’s market share losses to people like Huawei that have resurged in China.’” Parnassus Growth Equity Fund stated the following regarding Apple Inc. Investors reacted positively to the new iPhone 16 lineup and its advanced features, including generative artificial intelligence, greater durability and increased processing power.” Overall, AAPLranks 6thon our list of stocks Wall Street analysts can’t stop talking about. While we acknowledge the potential of AAPL, our conviction lies in the belief that under the radar AI stocks hold greater promise for delivering higher returns, and doing so within a shorter time frame. If you are looking for an AI stock that is more promising than AAPL but that trades at less than 5 times its earnings, check out our report about thecheapest AI stock. This article is originally published atInsider Monkey. Cancel anytime.",
      "content_stats": {
        "total_sentences": 32,
        "relevant_sentences": 22,
        "relevance_ratio": 0.6875,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.9241,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.4658
    },
    {
      "url": "https://www.investopedia.com/sandp-500-gains-losses-today-index-drops-fed-cuts-rates-signals-caution-tesla-broadcom-8763705",
      "url_mobile": "",
      "title": "S & P 500 Gains and Losses Today : Index Drops as Fed Cuts Rates but Signals Caution",
      "seendate": "20241219T031500Z",
      "socialimage": "https://www.investopedia.com/thmb/gyXLS6XcOCoWOCaIMkF1KLXtI9A=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-2190484741-c29990ca004a4fbfb76ef2e78de3a42a.jpg",
      "domain": "investopedia.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 13,
      "recency_weight": 0.5,
      "content": "Michael Bromberg is a finance editor with a decade of experience. Michael received a Bachelor of Arts in literature from the University of Wisconsin-Madison and a master's in linguistics from the Universidad de Antioquia in Medellin, Colombia. Cheng Xin/Getty Images Major U.S. equities indexes plunged as the Federal Reserve concluded its final policy meeting of the year. Thecentral bank loweredbenchmark interest rates by a quarter of a percentage point, as expected, but policymakers suggested that persistent inflation could require a more restrained approach in 2025. After trading higher for much of the day, the S&P 500 changed course following the rate-cut announcement and as Fed Chair Jerome Powell addressed the press, ending with a daily loss of 3%. The Dow finished the session down 2.6%, extending its streak of down days to double digits for the first time in four decades. The Nasdaq dropped 3.6% as concerns about the interest-rate outlook weighed on the tech sector. Analysts have touted tailwinds for the electric vehicle company's autonomous driving and artificial intelligence initiatives under the incoming presidential administration. The pullback for the stock on Wednesday followed reports that Tesla CEO Elon Musk and his SpaceX business are the subject of federal reviews related to national security concerns. While the company has seen metrics improve for its markets on the East Coast and in Central Business Districts, underperformance has persisted in West Coast and suburban markets, pointing to an uneven recovery for office real estate that presents a challenge for REITs with geographically diverse workplace property portfolios. The Apple (AAPL) suppliertopped sales and profit forecastsfor its fiscal first quarter of 2025 and lifted its full-year guidance, pointing to robust demand for its cloud, data center infrastructure, and digital commerce products. Shares of several healthcare companies bounced higher on Wednesday, clawing back some of the heavy losses posted in recent sessions as political headwinds against thepharmacy benefit management (PBM)business gathered force. Although the industry has been the subject of bipartisan criticism and could be required to transform its business model, analysts suggested that growth outlook remains healthy.",
      "content_stats": {
        "total_sentences": 26,
        "relevant_sentences": 14,
        "relevance_ratio": 0.5385,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.9775,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.4658
    },
    {
      "url": "https://www.kiplinger.com/investing/stocks/stock-market-today-dow-dives-1-123-points-after-fed",
      "url_mobile": "",
      "title": "Stock Market Today : Dow Dives 1 , 123 Points After Fed",
      "seendate": "20241219T000000Z",
      "socialimage": "https://cdn.mos.cms.futurecdn.net/8t9B7gi8ZB9dgYn8VCKzhd-1200-80.jpg",
      "domain": "kiplinger.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 2,
      "days_ago": 13,
      "recency_weight": 0.5,
      "content": "Market participants reacted predictably to a well-telegraphed hawkish turn by the Federal Reserve. When you purchase through links on our site, we may earn an affiliate commission.Here’s how it works. Profit and prosper with the best of Kiplinger's advice on investing, taxes, retirement, personal finance and much more. Delivered daily. Enter your email in the box and click Sign Me Up. You are now subscribed Your newsletter sign-up was successful Want to add more newsletters? Profit and prosper with the best of Kiplinger's advice on investing, taxes, retirement, personal finance and much more delivered daily. Smart money moves start here. Get practical help to make better financial decisions in your everyday life, from spending to savings on top deals. Get today's biggest financial and investing headlines delivered to your inbox every day the U.S. stock market is open. Financial pros across the country share best practices and fresh tactics to preserve and grow your wealth. Trim your federal and state tax bills with practical tax-planning and tax-cutting strategies. Your twice-a-week guide to planning and enjoying a financially secure and richly rewarding retirement Insights for advisers, wealth managers and other financial professionals. Your step-by-step six-part series on how to invest for retirement, from devising a successful strategy to exactly which investments to choose. Treasury yield is still heading higher. It wasn't the 25 basis points that had investors and traders itching for Wednesday – it was the wording of the FOMC statement, the look of the dot-plot and Fed Chair Jerome Powell's press conference. Subscribe from just$107.88$24.99, plus get up to 4 Special Issues Profit and prosper with the best of expert advice on investing, taxes, retirement, personal finance and more - straight to your e-mail. Profit and prosper with the best of expert advice - straight to your e-mail. As for the dot-plot, at the median the total number of cuts in 2025 is down to two from the four the Fed forecast in September. The central bank also updated its forecast for 2025 gross domestic product (GDP) growth, boosting it to 2.1% from 2.0% in September, and the unemployment rate will be lower, 4.3% vs 4.4%. The Fed now sees the annual rate of growth for the Personal Consumption Expenditure Price Index (PCE) at 2.5%, up from 2.1% in September. And core PCE will be 2.5%, up from 2.2%. Interest rate expectations have changed. And the bond market has been showing it for weeks. The yield on the benchmark 10-year Treasury note hit a 2024 peak of 4.739% on April 25 but headed lower from there as incoming data began to show inflation pressures were easing. It bottomed at 3.618% on September 16, two days before the FOMC started the rate-cutting cycle with a double move. From there, the 10-year climbed to a post-election peak of 4.463% on November 13, tracked back to 4.126% on December 6 and turned up again to where it closed on Tuesday, 4.395%. This morning the 10-year yield reached 4.424%. It popped after the FOMC meeting to 4.512% as of the closing bell. And it could be headed higher from here. Is a 6% 10-year Treasury yield possible? Why not? writesArif Husain, the chief investment officer of fixed income at T. Rowe Price, in a research note. The transition period in U.S. politics is an opportunity to position for increasing longer-term Treasury yields and a steeper yield curve. The last time the 10-year U.S. Treasury yield reached 6% was in 2000. During the Dow's 10-day losing streak, NVDA is down 11.1%. And the index has declined 6%. Also, it's been the anchor for a big-name index's historic submergence. This is a tech stock'stech stockand then some: Jabil's customers include a literal A-list ofMagnificent 7names –Apple(AAPL),Amazon.com(AMZN) and Google parentAlphabet(GOOGL) – as well as a growing list of electric vehicle makers.Dow Jones stocksJohnson & Johnson(JNJ) andCoca-Cola(KO) also count themselves as Jabil clients. Delivered daily. Enter your email in the box and click Sign Me Up. David Dittman is the former managing editor and chief investment strategist of Utility Forecaster, which was named one of 10 investment newsletters to read besides Buffett's in 2015. A graduate of the University of California, San Diego, and the Villanova University School of Law, and a former stockbroker, David has been working in financial media for more than 20 years. The S&P 500 and Nasdaq also had strong finishes to a volatile week, with beaten-down tech stocks outperforming. The S&P 500 and Nasdaq also had strong finishes to a volatile week, with beaten-down tech stocks outperforming. Precious metals ETFs provide a hedge against monetary debasement and exposure to industrial-related tailwinds from emerging markets. For retirees with a pension, traditional withdrawal rules could be too restrictive. You need a tailored income plan that is much more flexible and realistic. This is when you should be shifting your focus from growing your portfolio to designing an income and tax strategy that aligns your resources with your purpose. To be confident about retirement, consider building a safety net by dividing assets into distinct layers and establishing a regular review process. Here's how. A dismal round of jobs data did little to lift sentiment on Thursday. The key to successful estate planning for HNW families isn't just drafting these four documents, but ensuring they're current and immediately accessible. Couples who talk openly about finances, including estate planning, are more likely to head into retirement joyfully. How can you get the conversation going?",
      "content_stats": {
        "total_sentences": 80,
        "relevant_sentences": 57,
        "relevance_ratio": 0.7125,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.9644,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.4658
    },
    {
      "url": "https://www.insidermonkey.com/blog/wall-street-analysts-cant-stop-talking-about-these-10-ai-stocks-1408082/",
      "url_mobile": "https://www.insidermonkey.com/blog/wall-street-analysts-cant-stop-talking-about-these-10-ai-stocks-1408082/?amp=1",
      "title": "Wall Street Analysts Cant Stop Talking About These 10 AI Stocks",
      "seendate": "20241218T211500Z",
      "socialimage": "https://d2gr5kl7dt2z3t.cloudfront.net/blog/wp-content/uploads/2021/05/18051557/pascal-bernardon-zt0HWquGXlQ-unsplash.jpg",
      "domain": "insidermonkey.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 14,
      "recency_weight": 0.5,
      "content": "In this article, we will take a detailed look at:Wall Street Analysts Can’t Stop Talking About These 10 AI Stocks. Henry Ajder, Latent Space Advisory founder, said in a latest program on CNBC that lack of fresh data remains a key challenge for the performance of AI systems after a period of “huge” developments and fast learning. “I think data is the real problem here. We have a finite amount of data available on the internet and a limited number of sources for live, fresh data. Ajder believes there won’t be a complete “halt” to the progress in AI systems but in 2025 we are expected to see a slowdown. READ ALSO7 Best Stocks to Buy For Long-Termand8 Cheap Jim Cramer Stocks to Invest In For this article we picked 10 AI stocks currently trending based on latest news. The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points(see more details here). I mean, they’re just a category killer. They also have almost a 400 PE, which has done a little too fast, too soon. Its technologies are actually solving the problems of businesses. Palantir’s data technology Ontology is solving the famous hallucination problem for AI systems, thanks to the company’s years of experience with military and defense systems. This software and services firm, which operates in both government and commercial segments, saw strong growth during the quarter, largely driven by its “AIP” – or Artificial Intelligence Platform – offering. In early August, the company reported Q2 financial results that mostly met somewhat lofty expectations. My analyst, Jesus, and I went out to go see Iron Maiden in San Diego. Everything about that car, I hate. Every general manager, some of them are clients that run auto dealerships, you can make a lot of money doing auto dealerships, let me tell you, they all say the same thing: People are coming in and saying, “Is it morally okay if I switch back to gas?” Because people don’t want electric cars, they want a Tesla. It’s an old design. It’s up 50% since the election. I’m sorry, Elon Musk is going to make bank hanging out being a bro with Trump on SpaceX. How? What about the $30,000 price tag claim? Musk has indicated that the Cybercab will have a production cost of approximately $30,000. Operating within the robotaxi fleet is projected to cost around $0.20 per mile. With a production cost of $30,000, the retail price of the Cybercab is likely to exceed this figure. For instance, if the Cybercab is priced at $30,000 per unit, that translates to $15,000 per seat. Regarding operational costs, while the Cybercab is expected to cost $0.20 per mile, charging the Model 3 is estimated at under $0.10 per mile, leaving a significant margin to cover maintenance and downtime. What are these challenges? Meanwhile, competitors are rolling out more advanced models. Chinese competitor BYD is also gaining ground in Europe, despite talk of tariffs. In short, the market seems to be pricing in a lot of positive optionality for this company in the near-to-intermediate term (and particularly a fully autonomous fleet of electric vehicles in the medium term). What exists today is an automobile manufacturer limited to the higher-income segment that is increasingly challenged to sell vehicles when interest rates are not zero. KeyBanc analysts are enthusiastic about Agentforce’s potential. (NYSE:CRM) in itsQ3 2024 investor letter: “In the third quarter, we purchased new positions in Apple and Oracle and eliminated our small positions in Nike andSalesforce, Inc.(NYSE:CRM). We exited our position in Salesforce to fund better opportunities in Shopify and MSCI. Salesforce is seeing slower revenue growth than we would have expected, given the weakening macroeconomic environment. They reported $12.2 billion for the year, which translates to roughly $37 billion for the quarter. The guidance was around $35 billion, so the AI performance for the quarter exceeded expectations. Even though the revenue outlook for fiscal Q1 is roughly in line with expectations, investors were worried about things like wireless seasonality into Q1 and some potential lumpiness in AI. However, the stock could face the impact of what Nvidia is facing today: too high expectations. The company has narrowly exceeded revenue expectations by less than 5% in most cases. Some analysts suggest Broadcom’s growth rates will moderate to below 20% CAGR starting the first quarter of 2025. In fiscal Q4, it was +50% topline growth. The market won’t be kind to the stock when the revenue growth rate slows. Broadcom has about $58 billion in net debt, which is relatively high. With an enticing combination of custom chip offerings as well as networking assets, Broadcom remains one of the best positioned companies as part of the AI revolution. The company’s dominant market position in its end markets, along with durable growth, strong margins and best-in-class capital allocation, presents an opportunity to compound capital over time.” Number of Hedge Fund Investors: 158 Dan Niles, Niles Investment Management founder and portfolio manager, said while talking to CNBC earlier this month that Apple Inc (NASDAQ:AAPL) is one of the stocks that should worry investors. He explained his case: “The company has grown revenues cumulatively, if you include this year’s calendar year, at 5% over the last 3 years. And every product, you know, people go, ‘Oh my God, Vision Pro is going to be terrific,’ and then you figure out, no, nobody’s going to wear ski goggles on their head. Then you look at what’s going on with the iPhone and the features they’ve rolled out, which surprised me because they weren’t particularly good to start with. They’re going to get upgraded in December in the US, but then you have to wait for next year for it to be upgraded in the rest of the world. And you’ve got a company that’s also trading at a 33 P/E for 5% revenue growth over the past three years combined. So that’s the other one where if people finally go, ‘You know what? It’s market share losses to people like Huawei that have resurged in China.’” Parnassus Growth Equity Fund stated the following regarding Apple Inc. Investors reacted positively to the new iPhone 16 lineup and its advanced features, including generative artificial intelligence, greater durability and increased processing power.” Number of Hedge Fund Investors: 193 Howard Chan from Kurv Investment Management said while talking to Schwab Network in a recent program that Wall Street’s high expectations with NVIDIA Corp (NASDAQ:NVDA) are a concern for him despite the company being a “very strong” player in the AI infrastructure market. “We think they are a very strong player and maybe a dominant player in the infrastructure space. But, you know, I have to mention that they had a pretty good earnings report this past quarter. An EPS surprise of 8.5% was not able to help the stock. A similar trend occurred following the second-quarter earnings after a 5.6% EPS surprise. It’s difficult to see Nvidia maintaining a mid-70s gross margin by the end of 2026. Over the last two quarters, Nvidia has already reported a drop in its gross margin from 78% to 74.5%. Then there’s competition. The chip is expected to be twice as fast with 40% more power efficiency than the previous generation, manufactured on TSMC’s (TSM) cutting-edge N3 technology. Reportedly, technology giant Apple (AAPL) will be a consumer of Amazon’s new silicon. Although the semiconductor company released robust quarterly sales figures and issued encouraging guidance for the current quarter, its stock declined amid investor skepticism that its rapid pace of growth can continue.” NYSE:CRMHeadlineNASDAQ:AMZNNASDAQ:AVGONASDAQ:TSLANASDAQ:PLTRNASDAQ:NVDANASDAQ:METANASDAQ:GOOGNASDAQ:ADBENASDAQ:AAPLDaily NewsletterApple Inc (NASDAQ:AAPL)Tesla Inc. Cancel anytime.",
      "content_stats": {
        "total_sentences": 121,
        "relevant_sentences": 66,
        "relevance_ratio": 0.5455,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.4319,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.4658
    },
    {
      "url": "https://www.investors.com:443/news/technology/apple-stock-lackluster-iphone-16-sales/",
      "url_mobile": "",
      "title": "Apple Stock Up Despite Lackluster iPhone 16 Sales | Investor Business Daily",
      "seendate": "20241218T184500Z",
      "socialimage": "https://www.investors.com/wp-content/uploads/2024/12/Stock-Apple-shanghai-iphone16pro-02-company.jpg",
      "domain": "investors.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 2,
      "days_ago": 14,
      "recency_weight": 0.5,
      "content": "Despite hopes that artificial intelligence features would drive iPhone 16 sales, Apple's (AAPL) latest smartphones continue to underperform compared with last year's models, a Wall Street analyst says. Still, Apple stock is near record high territory. In a client note Wednesday, JPMorgan analyst Samik Chatterjee said U.S. sales of the iPhone 16 are tracking below the iPhone 15 so far.…",
      "content_stats": {
        "total_sentences": 4,
        "relevant_sentences": 4,
        "relevance_ratio": 1.0,
        "condensed": false,
        "filter_action": "no_change"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.9553,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.4658
    },
    {
      "url": "https://www.investopedia.com/dow-jones-today-12182024-8763276",
      "url_mobile": "",
      "title": "Dow Jones Today : Stocks Inch Higher as Investors Await Fed Decision on Interest Rates ; Nvidia Shares Surge After Slump",
      "seendate": "20241218T174500Z",
      "socialimage": "https://www.investopedia.com/thmb/SZ49Tbrcn41Ozv93HhBWRnzQUyg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-21884945241-756fe739aad64129ae822222f0732329.jpg",
      "domain": "investopedia.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 14,
      "recency_weight": 0.5,
      "content": "Spencer Platt / Getty Images Stocks tumbled Wednesday after the Federal Reserve cut its benchmark lending rate, as had been expected, but indicated it will slow down the pace of future reductions. Stocks retreated immediately afterthe Fed announcementthis afternoon, and the losses accelerated during Fed Chair Jerome Powell's press conference.Powell saidthat inflation has been higher than expected while unemployment has been lower than anticipated, which sets the Fed up to take a cautious approach when it comes to future decisions on interest rates. The yield on 10-year Treasurys, which is tied to expectations about where interest rates are headed, rose to 4.51%, up from 4.39% before the Fed's announcement and trading at its highest level since May. The S&P 500's Consumer Discretionary and Real Estate sectors fell 4.7% and 4%, respectively. The Russell 2000 index of small-cap stocks slid 4.4%. Tesla (TSLA) was down 8.3%, giving back some of the post-election gains that have sent the stock to a series of record highs, while Apple (AAPL), Microsoft (MSFT), Amazon (AMZN), Alphabet (GOOGL), Meta Platforms (META) and Broadcom (AVGO) also lost ground. The stock dropped an additional 15% in after-hours trading. The memory chip maker and Nvidia (NVDA) partner projected fiscal second-quarter revenue of $7.9 billion, give or take $200 million, below the analyst consensus of $8.93 billion compiled by Visible Alpha. The company's forecast for dilutedearnings per share (EPS)of between $1.16 to $1.36 was also below estimates. In its fiscal first quarter, which ended Nov. Revenue rose 84% to a record $8.71 billion, just below analysts' estimates and just above the midpoint of management's earlier guidance. They were up nearly 22% for 2024 through Wednesday’s close. -Kara Greenberg S&P 500 and Dow Post Biggest One-Day Losses Since August Stocks had their worst day in months on Wednesday after the Fed policymakers scaled back their forecast for future rate cuts and noted their uncertainty about the path of inflation had increased over the past few months. The Dow and the S&P 500 each suffered their largest daily declinessince August 5, tumbling 2.6% and 3%, respectively. That was the day theyen carry trade, a leveraged investment strategy that was enormously popular on Wall Street, backfired and caused the worst stock market rout since 2022. We thought it was the best decision to foster achievement of both of our goals, maximum employment and price stability, Powell said. We see the risks as two-sided. Move too slowly and needlessly undermine economic activity in the labor market, or move too quickly and needlessly undermine our progress on inflation. So we're trying to steer between those two risks, and on balance, we decided to go ahead with a further cut. Powell Says Economy and Policy are Both in a Good Place Fed Chair Jerome Powell, speaking to reporters after the December meeting of the Fed's policy committee, said that the U.S. economy and monetary policy are both in a good place. He said that growth has been higher than expected lately, while unemployment has been lower than anticipated. At the same time, inflation has been higher than expected, even as the Fed has made progress in its efforts to tame it. Powell said the central bank is still working to balance its dual mandate of maximum employment and low inflation. With employment remaining stable and inflation staying stubborn, central bankers can be less aggressive in the upcoming year. We can, therefore, be more cautious as we consider further adjustments to our policy rate. Fed Cuts Key Rate But Expects to Slow Pace of Further Easing The Federal Reserve cut itsfederal funds rateby a quarter percentage point to a range of 4.25% to 4.5%. This is the third cut central bankers have made in as many meetings and brings the fed funds rate range to a full percentage point lower than it was at the start of the year. There was one dissenting vote to the policy move, cast by Cleveland Federal Reserve President Beth Hammack. Members of the policy-setting Federal Open Market Committee are now projecting just two additional cuts next year, according to the latest Summary of Economic Projections, compared to the four cuts they had previously expected. You can follow our coverage of the Fed decision, including Chair Jerome Powell's press conference, in theFed Meeting Live Blog. So why have these three major indexes, each containing the stocks of some of America’s largest companies, diverged lately? The killing of a UnitedHealth Group executive earlier this month has put a spotlight on the business of health care, weighing on stocks in the sector and, subsequently, the price-weighted Dow. Read thefull article here. The firm, which counts Apple (AAPL) as a customer, reported fiscal 2025 first-quarter adjustedearnings per share (EPS)of $2.00, with revenue falling nearly 17% year-over-year to $6.99 billion. Both beat consensus forecasts of analysts polled by Visible Alpha. It anticipates revenue of $27.3 billion, versus its previous estimate of $27.0 billion. The stock has now gained 16% since the start of the year, lagging the S&P 500's 27% increase over the period. Shares in the AI investor favorite were up 3.6% at around $135 in recent trading. The stock is down 13% from its record high last month but is still up about 175% since the start of 2024, asanalysts remain bullishon the company’s prospects heading into next year. Since setting a record high, the stock traded mostly sideways before falling below the 50-day moving average late last week, potentially setting the stage for further consolidation. Read the fulltechnical analysis piece here. Analysts had expected EUR48 million in net income on revenue of EUR437.2 million, according to estimates compiled by Visible Alpha. The stock is up 23% since the start of the year, lagging the 27% gain of the S&P 500 index. -Aaron McDade DJIA Levels to Watch as Index Rides 9-Day Losing Streak The Dow Jones Industrial Average enters trading Wednesday on a nine-day losing streak, the longest stretch of consecutive daily declines for the blue chip index since 1978. The slump, which equates to nearly 1,600points, comes after the index closed above the closely watched 45,000 level for the first time on Dec. 4 following an extended post-election rally fueled by expectations of a market-friendly White House and Congress. Despite the recent losing streak, the index is still up 15% in 2024. However, that return significantly underperforms theS&P 500’s27% gain and theNasdaq Composite’s34% jump over the same period due to the Dow's smaller exposure tomega captech companies. The index has continued to trend lower after running into resistance near the top trendline of an ascending channel earlier this month, raising the possibility of a potential breakdown. Read the fulltechnical analysis piece here. S&P 500 futures were up 0.3%. TradingView Nasdaq 100 futures also gained 0.3%. TradingView",
      "content_stats": {
        "total_sentences": 83,
        "relevant_sentences": 52,
        "relevance_ratio": 0.6265,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.9573,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.4658
    },
    {
      "url": "https://ghanaiantimes.com.gh/as-bitcoin-soars-luxury-brands-consider-accepting-crypto-payments/",
      "url_mobile": "https://ghanaiantimes.com.gh/as-bitcoin-soars-luxury-brands-consider-accepting-crypto-payments/amp/",
      "title": "As bitcoin soars , luxury brands consider accepting crypto payments",
      "seendate": "20241218T121500Z",
      "socialimage": "",
      "domain": "ghanaiantimes.com.gh",
      "language": "English",
      "sourcecountry": "Ghana",
      "coverage_count": 1,
      "days_ago": 14,
      "recency_weight": 0.5,
      "content": "“There have been quite a few calls – it’s generated interest,” said David Princay, president of Binance France, who said the company is in talks with other luxury labels. Dupont told Reuters it aims to accept cryptocurrency payments in two Paris stores before the holidays. Regulators have long warned that cryptocurrencies like bitcoin are high-risk assets, with limited uses in the real world. High volatility has been another barrier to wide adoption as a means of payment. But pledges of support from U.S. President-electDonald Trump, who is expected to bring in more friendly e-currency regulation, have fueledrecord-breaking rises for bitcoin. S&P analysts say the narrative is starting to shift, noting that blockchain innovation in financial markets could increase predictability for cryptocurrencies. Luxury labels have long sought to cater to affluent shoppers from the tech industry by opening stores in upscale Silicon Valley malls and issuing products like the Hermes(HRMS.PA),Apple Watch, for example, which combines signature, stitched leather straps of the French Birkin bag maker with tech giant Apple’s(AAPL.O),connected timepiece. The payment option remains largely symbolic. Retailers usually reconvert the funds to euros or dollars to offset risks of volatility, while for most shoppers, payment methods are seen overall as “something that’s been solved” already by such transaction platforms as PayPal(PYPL.O)or Venmo, said O’Neill. In a sign of growing interest from designer labels, Balenciaga recently issued a leather card holder designed to hold “Stax” hardware from crypto wallet company Ledger. The black leather accessory, which retails for 350 euros ($368), includes a keychain and Eiffel Tower charm, and an NFC chip fitted underneath the brand logo. The company’s “Flex” hardware, which resembles a mini Amazon Kindle, sells for $249 while the “Nano” version, which looks like a USB key, sells for $79. Bitcoin’s rise in late 2021 prompted an initial flurry of interest from luxury brands with Tag Heuer, headed at the time by LVMH luxury scion Frederic Arnault, as well as Gucci, accepting payments in cryptocurrency the following year for some purchases in the United States. One crypto advocate who recently used digital assets to make luxury purchases is Eunice Wong, an investor and influencer known as “Eunicorn.” Wong said she used cryptocurrency to buy several high-end watches this year including an Audemars Piguet Royal Oak model. But she is not interested in being drawn in by high end brands seeking to build a closer client relationship, preferring to bypass traditional retail stores and sales routines. That takes too much time, in her view. “If I will buy, I’ll buy on the secondary market, not through them,” she told Reuters. “I want it now.” Source: www.reuters.com",
      "content_stats": {
        "total_sentences": 32,
        "relevant_sentences": 19,
        "relevance_ratio": 0.5938,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.9741,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.4658
    },
    {
      "url": "https://www.thedailystar.net/business/global-economy/news/bitcoin-soars-luxury-brands-consider-accepting-crypto-payments-3779081",
      "url_mobile": "",
      "title": "As bitcoin soars , luxury brands consider accepting crypto payments",
      "seendate": "20241218T081500Z",
      "socialimage": "",
      "domain": "thedailystar.net",
      "language": "English",
      "sourcecountry": "Bangladesh",
      "coverage_count": 1,
      "days_ago": 14,
      "recency_weight": 0.5,
      "content": "In recent weeks, upscale French luxury department store Printemps announced it was teaming up with the world's largest crypto exchange, Binance, and French financial tech company Lyzi to accept cryptocurrencies including bitcoin and ethereum in its stores in France - becoming the first European department store to do so. There have been quite a few calls - it's generated interest, said David Princay, president of Binance France, who said the company is in talks with other luxury labels. Dupont told Reuters it aims to accept cryptocurrency payments in two Paris stores before the holidays. Regulators have long warned that cryptocurrencies like bitcoin are high-risk assets, with limited uses in the real world. High volatility has been another barrier to wide adoption as a means of payment. But pledges of support from U.S. President-elect Donald Trump, who is expected to bring in more friendly e-currency regulation, have fueled record-breaking rises for bitcoin. S&P analysts say the narrative is starting to shift, noting that blockchain innovation in financial markets could increase predictability for cryptocurrencies. SEEKING INNOVATIVE BRANDING Luxury labels have long sought to cater to affluent shoppers from the tech industry by opening stores in upscale Silicon Valley malls and issuing products like the Hermes HRMS.PA Apple Watch, for example, which combines signature, stitched leather straps of the French Birkin bag maker with tech giant Apple's AAPL.O connected timepiece. The payment option remains largely symbolic. Retailers usually reconvert the funds to euros or dollars to offset risks of volatility, while for most shoppers, payment methods are seen overall as something that's been solved already by such transaction platforms as PayPal PYPL.O or Venmo, said O'Neill. In a sign of growing interest from designer labels, Balenciaga recently issued a leather card holder designed to hold Stax hardware from crypto wallet company Ledger. The black leather accessory, which retails for 350 euros ($368), includes a keychain and Eiffel Tower charm, and an NFC chip fitted underneath the brand logo. The company's Flex hardware, which resembles a mini Amazon Kindle, sells for $249 while the Nano version, which looks like a USB key, sells for $79. REACHING YOUNGER CLIENTELE Gregory Boutte, chief client and digital officer for luxury conglomerate Kering, has described the group's strategy when it comes to technology as test and learn rather than wait and see. He emphasized the embrace of new technologies as key to reaching younger and Asian clientele. Bitcoin's rise in late 2021 prompted an initial flurry of interest from luxury brands with Tag Heuer, headed at the time by LVMH luxury scion Frederic Arnault, as well as Gucci, accepting payments in cryptocurrency the following year for some purchases in the United States. One crypto advocate who recently used digital assets to make luxury purchases is Eunice Wong, an investor and influencer known as Eunicorn. Wong said she used cryptocurrency to buy several high-end watches this year including an Audemars Piguet Royal Oak model. But she is not interested in being drawn in by high end brands seeking to build a closer client relationship, preferring to bypass traditional retail stores and sales routines. That takes too much time, in her view. If I will buy, I'll buy on the secondary market, not through them, she told Reuters. I want it now.",
      "content_stats": {
        "total_sentences": 32,
        "relevant_sentences": 21,
        "relevance_ratio": 0.6562,
        "condensed": false,
        "filter_action": "filtered"
      },
      "fls_label": "Not FLS",
      "fls_confidence": 0.9726,
      "impact_horizon": "IMMEDIATE",
      "horizon_weight": 0.4144,
      "final_weight": 0.4658
    }
  ]
}