{
  "query": "eli lilly",
  "start_date": "01-01-2025",
  "end_date": "01-02-2025",
  "backward_start_date": "18-12-2024",
  "backward_end_date": "31-12-2024",
  "fetch_timestamp": "2026-01-30 10:12:16",
  "article_count": 13,
  "articles": [
    {
      "url": "https://www.insidermonkey.com/blog/is-eli-lilly-and-company-lly-the-best-low-volatility-stock-to-buy-right-now-1416742/",
      "url_mobile": "https://www.insidermonkey.com/blog/is-eli-lilly-and-company-lly-the-best-low-volatility-stock-to-buy-right-now-1416742/?amp=1",
      "title": "Is Eli Lilly and Company ( LLY ) the Best Low Volatility Stock to Buy Right Now ? ",
      "seendate": "20241231T121500Z",
      "socialimage": "https://d2gr5kl7dt2z3t.cloudfront.net/blog/wp-content/uploads/2023/09/19175126/LLY-insidermonkey-1695160284252.jpg",
      "domain": "insidermonkey.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 1,
      "recency_weight": 1.5,
      "content": "We recently published a list of 8 Best Low Volatility Stocks To Buy Right Now . In this article, we are going to take a look at where Eli Lilly and Company (NYSE:LLY) stands against other best low volatility stocks to buy right now.\nThe market has shown strong performance overall, with the S&P 500 up nearly 26% year to date. However, in the past thirty days, it has experienced a slight decline of 1%. A notable sell-off occurred between December 17 and 19, which contributed to some volatility. Since then, the market has been fluctuating, with prices rising and falling as investors continue to navigate the uncertainty.\nIn a CNBC interview, Alan Rechtschaffen, Senior Portfolio Manager at UBS Global Wealth, stressed that he maintains a positive outlook on market growth, emphasizing that the current market sell-off is driven by a lack of faith rather than fundamental issues. He noted that the positivity surrounding the market will improve as President Trump’s policies take effect.\nRechtschaffen acknowledged concerns over high interest rates and high debt levels but argued that the Fed’s goal of lowering rates, combined with efforts to reduce spending and increase efficiency, will lead to high growth. He is particularly optimistic about sectors like technology, utilities, and financials, which he believes will benefit from a focus on new energy sources and deregulation. Although valuations are higher than usual, Rechtschaffen believes that with the right efficiencies in place, the market could see a 10% rise, offering opportunities for investors willing to take risks in this promising period.\nThe path of rate cuts in 2025 is creating uncertainty for Wall Street as the Fed’s outlook shifted last week, now forecasting two cuts instead of four. The possibility of a rate hike has not been ruled out if inflation re-accelerates. San Francisco Fed President Mary Daly told Yahoo Finance’s Brian Sozzi that adjustments could be made depending on data, but she doesn’t see inflationary pressures at the moment. However, she isn’t ruling out anything.\nOn Yahoo Finance’s Catalysts, Max Wasserman of Miramar Capital said that he believes the economy is stronger than anticipated, with GDP growth around 3% and inflation at 2.7%, which reduces the need for aggressive rate cuts. He also suggested that a rate hike could become more likely in the second half of 2025 if inflation remains persistent.\nWasserman advised a more cautious approach in portfolio management, favoring de-risking strategies, such as taking profits from top-performing stocks and focusing on dividend stocks. He also recommended staying short-term on bonds, as rising interest rates could pressure longer-duration bonds. Additionally, he expressed concerns about potential inflationary policies from the incoming administration, such as changes to immigration or tariffs, which could further strain the economy and complicate the Fed’s path forward.\nFor this article, we used the Yahoo Finance stocks screener to identify 30 companies with the largest market cap and a 5-year beta (monthly) between 0.2 and 0.8. Next, we narrowed our list to 8 stocks most widely held by institutional investors. The 8 best low-risk stocks to buy are listed in ascending order of their hedge fund sentiment.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points ( see more details here ).\nAn array of pharmaceutical pills with the company’s logo on the bottle.\n5-year Beta (Monthly): 0.43\nNumber of Hedge Fund Holders: 106\nEli Lilly and Company (NYSE:LLY) is a prominent global pharmaceutical company with a strong presence in the healthcare sector, particularly recognized for its range of treatments for diabetes and obesity. The company has been making waves with its breakthrough medications, such as Mounjaro, a diabetes treatment, and Zepbound, a companion drug for chronic weight management. Both of these products have become significant contributors to the company’s revenue.\nIn the third quarter, Mounjaro contributed 27.3% of total revenue, showing a 121% growth from the previous year, while Zepbound accounted for over 11% of the revenue. This growing demand for these treatments has positioned Eli Lilly well in the market, especially with the recent FDA approval of Zepbound for the treatment of obstructive sleep apnea, a common sleep disorder.\nThis approval is particularly noteworthy as it marks Zepbound as the first drug authorized to directly treat patients suffering from this condition. Additionally, Eli Lilly (NYSE:LLY) announced a substantial $4.5 billion investment in October for the construction of the Lilly Medicine Foundry in Lebanon, Indiana, scheduled to open in 2027. This facility will focus on research and development as well as production for clinical trials, further reinforcing Eli Lilly’s (NYSE:LLY) commitment to advancing healthcare solutions.\nOverall, LLY ranks 3rd on our list of best low volatility stocks to buy right now. While we acknowledge the potential of LLY as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns and doing so within a shorter time frame. If you are looking for an AI stock that is more promising than LLY but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock .\nREAD NEXT: 8 Best Wide Moat Stocks to Buy Now and 30 Most Important AI Stocks According to BlackRock\nDisclosure: None. This article is originally published at Insider Monkey .\nYahoo Finance\nReturns since its inception in May 2014 (through August 15th, 2025)\n30 day money back guarantee. Cancel anytime.\nWarren Buffett\nBerkshire Hathaway\n$293,447,417,000\nDavid Einhorn\nGreenlight Capital\n$1,491,303,000\nGeorge Soros\nSoros Fund Management\n$5,416,602,000\nJim Simons\nRenaissance Technologies\n$77,426,184,000\nLeon Cooperman\nOmega Advisors\n$1,886,381,000\nCarl Icahn\nIcahn Capital LP\n$22,521,664,000\nSteve Cohen\nPoint72 Asset Management\n$22,767,998,000\nJohn Paulson\nPaulson & Co\n$3,510,256,000\nDavid Tepper\nAppaloosa Management LP\n$4,198,712,000\nPaul Tudor Jones\nTudor Investment Corp\n$6,160,740,000"
    },
    {
      "url": "https://seekingalpha.com/news/4391294-eli-lilly-among-best-big-pharma-2024-novo-among-worst",
      "url_mobile": "",
      "title": "Eli Lilly among best in Big Pharma in 2024 ; Novo among worst",
      "seendate": "20241228T144500Z",
      "socialimage": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2153927815/image_2153927815.jpg?io=getty-c-w750",
      "domain": "seekingalpha.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 4,
      "recency_weight": 1.0,
      "content": null
    },
    {
      "url": "https://www.forbes.com/sites/michaelfoster/2024/12/24/my-top-retirement-strategy-for-14-dividends-in-2025/",
      "url_mobile": "",
      "title": "My Top Retirement Strategy For 14 % Dividends In 2025",
      "seendate": "20241224T193000Z",
      "socialimage": "https://imageio.forbes.com/specials-images/imageserve/676468a137bc7747dbf8f298/0x0.jpg?format=jpg&fit=bounds",
      "domain": "forbes.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 8,
      "recency_weight": 0.5,
      "content": "By Michael Foster ,\nContributor.\nNot many people know this, but if you really want to diversify—deftly balancing and rebalancing to maximize (and protect) your gains, you need to invest in closed-end funds (CEFs) .\nDoing this with CEFs, which yield around 8% on average, gives you two key advantages:\nFirst, you get a much bigger income stream. That’s great on its own. But if you’re reinvesting your income , you get an even bigger edge because you can easily redirect your dividends from one CEF to another in a different sector. You just can’t do this with an index fund.\nLet’s dig into how that works in practice.\nWhile 2024 has been a great year for stocks, some sectors are lagging, as is always the case. And right now, as we look ahead to 2025, is a good time to reallocate a bit from your winners into the stragglers. That’s because, over time, these laggards will likely revert to their long-term average performance.\nA look at the sectors making up the S&P 500 tells us that the biggest winners this year have been the communication services, finance, consumer discretionary and tech sectors. These firms are picking up the slack we’ve seen in materials, energy and healthcare. I want to focus on healthcare, because the gap between this year’s performance (up just around 1.1% following last week’s selloff) and what the sector has done in the long run is striking.\nWith about a 9% annualized return over the last decade, healthcare has performed relatively well, making it a good target for rebalancing by moving profits (or CEF dividends) into it from the stronger-performing sectors of 2024.\nThe highest-yielding healthcare CEF is the abrdn Healthcare Investors Fund (HQH), a 14.2% payer whose portfolio includes key pharma names like Gilead Sciences (GILD) , Amgen (AMGN) and Eli Lilly & Co. (LLY) . It would take just $705,000 invested in this fund to get $100,000 per year in income.\nPlus, HQH’s focus on healthcare means we could pair it with other sector-specific CEFs and rebalance to ensure we aren’t overexposed to any particular industry—and also profit from the performance differences between those sectors.\nBut to make certain HQH is the best CEF for this strategy, we need to dig deeper.\nAs of this writing, HQH has beaten the healthcare sector as a whole, with a 7.9% total NAV return year to date (this is a CEF-specific measure that examines the performance of a fund’s underlying portfolio, rather than its price on the open market), about seven times the return of the benchmark Health Care Select Sector SPDR Fund (XLV).\nHowever, on the open market, the fund has returned 10.6%, including dividends paid out. This gap largely stems from the fund’s big discount to NAV (or the difference between the NAV- and market price–based return), which was over 15% at the start of the year and has now returned to that overly generous discount following the big selloff last week.\nThis is a new buying opportunity, and momentum could drive that discount smaller still over the coming months if the market’s recent panic subsides, pulling up the fund’s market price with it. And if HQH doesn’t cut its payout, we may indeed see that discount get smaller still.\nThere are two problems, however: Obviously, the market pullback might not yet be done and, more importantly, HQH raised its dividend in May, which means it’s now paying a 12.6% yield on NAV, much higher than that 7.9% total NAV return we just talked about. This means the dividend might need to be cut. Or HQH will need to pay out shareholder capital, shrinking the fund’s size—and its gain potential.\nThat’s a tough situation, made worse by management’s decision to raise the payout.\nNow let’s consider the BlackRock Health Sciences Trust (BME) , whose 7% yield is half that of HQH. BME trades at a less generous 10.3% discount, but the trend in this discount (in orange below) is very different than that of HQH (in purple).\nHQH went from being priced at par to a huge discount to going back toward par over the last three years to plummeting last week. BME, meantime, has been on a steady descent toward a bigger discount (although the vector of decline has flattened out significantly in 2024, and it didn’t change all that much with the recent selloff).\nThis would suggest BME is at risk of getting cheaper, but there’s a key detail: The fund is part of BlackRock’s “discount management program,” under which the company buys a certain amount of some CEFs (including BME) if their average discount is more than 7.5% during a three-month measurement period.\nHQH has no such initiative, which is why its discount grew so large late last year and why its discount could grow so massively.\nThis means BME is unlikely to see its discount go much lower. And even if it does, BlackRock’s discount-management program means the firm will buy back shares on a quarterly basis at a 2% discount. If you tender your shares during this offer after buying at the fund’s current price, the result would be an instant 9.3% profit.\nThere’s one more reason to prefer BME over HQH, despite its lower yield.\nOver the last five years, BME (in orange above) has outperformed HQH on a total-NAV-return basis. This suggests it should be priced at a much smaller discount than HQH, on the strength of its stronger management. This also suggests BME is the better buy when its discount gets unusually wide.\nThus, while HQH’s huge dividends make it look like the better choice, if you want to buy and hold a sector fund for the long term, BME is likely to outperform HQH, especially if BlackRock continues its discount-management program. However, if abrdn were to start its own discount-management program, HQH might have the edge. Until that happens, though, my money’s on BME.\nMichael Foster is the Lead Research Analyst for Contrarian Outlook . For more great income ideas, click here for our latest report “ Indestructible Income: 5 Bargain Funds with Steady 8.6% Dividends. ”\nDisclosure: none"
    },
    {
      "url": "https://www.investopedia.com/sandp-500-gains-and-losses-today-chip-stocks-surge-broadcom-amd-nvidia-8765818",
      "url_mobile": "",
      "title": "S & P 500 Gains and Losses Today : Chip Stocks Surge as Holiday Trading Week Begins",
      "seendate": "20241224T020000Z",
      "socialimage": "https://www.investopedia.com/thmb/6zY9Nw1Vxkrtr0LZqTOlpxEtPy4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-2189656773-518305a72e6c40d18af8a92063a5319b.jpg",
      "domain": "investopedia.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 8,
      "recency_weight": 0.5,
      "content": "Michael Bromberg is a finance editor with a decade of experience. He is an expert at elucidating complex financial topics in clear, concise language. Michael received a Bachelor of Arts in literature from the University of Wisconsin-Madison and a master's in linguistics from the Universidad de Antioquia in Medellin, Colombia.\nMajor U.S. equities indexes moved higher to kick off the week, with a shortened trading session on tap for Tuesday followed by a midweek day off in observance of Christmas.\nThe S&P 500 gained 0.7%. Strength in the tech sector helped lift the Nasdaq 1%, while the Dow staged an afternoon rally to eke out a daily gain of 0.2%.\nBroadcom ( AVGO ) shares rose 5.5%, notching the top performance in the S&P 500, after UBS lifted its price target on the stock. Analysts said they boosted their forecasts for Broadcom's artificial intelligence revenue based on the chipmaker's disclosures about its addressable market along with an improving outlook for its custom compute and AI networking businesses.\nShares of Advanced Micro Devices ( AMD ) jumped 4.5% as analysts at Rosenblatt listed the semiconductor stock as one of their top picks for the first half of 2025. The investment research firm believes AMD is positioned for strength in the server and data center segment as it takes an increasing share of the central processing unit and graphic processing unit markets.\nOther stocks in the semiconductor industry joined Monday's rally as the Biden administration announced a new investigation into legacy Chinese semiconductors used in U.S. products. Shares of microcontroller maker Microchip Technology ( MCHP ) and power circuit provider Monolithic Power Systems ( MPWR ) were more than 4% apiece, while chip industry giants Nvidia ( NVDA ), Intel ( INTC ), and Qualcomm ( QCOM ) also gained ground.\nCarnival Corp. ( CCL ) shares sank 4%, falling the most of any S&P 500 stock. Monday's drop reversed gains posted at the end of last week after the cruise operator reported better-than-expected quarterly profits and provided an upbeat outlook for 2025 bookings. Analysts at Bernstein maintained their \"market perform\" rating on Carnival stock, pointing to a more favorable growth outlook for competing cruiser Royal Caribbean ( RCL ). Norwegian Cruise Line Holdings ( NCLH ) shares lost 2.9%.\nParamount Global ( PARA ) entered an agreement with the Federal Communications Commission (FCC) to pay fines for Emergency Alert System violations. A filing last week revealed a petition for the FCC to challenge Paramount's planned merger with production company Skydance Media, but reports have suggested that the relationship between Paramount boss Shari Redstone and President-elect Donald Trump could be beneficial as the incoming administration evaluates the deal. Shares of the entertainment giant lost 2.9%\nShares of cloud-based human resources software provider Workday ( WDAY ) declined 2.8% on Monday, the stock's first day of trading as a constituent of the S&P 500. The stock gained ground earlier in December following the announcement that it would join the benchmark index but has been volatile in recent weeks.\nShares of ResMed ( RMD ), a medical technology company focused on sleep apnea devices, lost 2.6% after the Food and Drug Administration approved Zepbound as a treatment for obstructive sleep apnea treatment in adults with obesity. Increased adoption of the blockbuster weight-loss drug from Eli Lilly ( LLY ) among sleep apnea patients could pressure sales of ResMed's continuous positive airway pressure, or CPAP, devices. Eli Lilly shares climbed 3.7% ."
    },
    {
      "url": "https://www.investopedia.com/top-stock-movers-now-broadcom-amd-resmed-and-more-8765845",
      "url_mobile": "",
      "title": "Top Stock Movers Now : Broadcom , AMD , ResMed , and More",
      "seendate": "20241223T210000Z",
      "socialimage": "https://www.investopedia.com/thmb/_e91aHwdjnw9qHn2JtwOeAfFwPE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-19806700676-4876f91af7c24127be77dcdb15c28120.jpg",
      "domain": "investopedia.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 9,
      "recency_weight": 0.5,
      "content": "Bill McColl has 25+ years of experience as a senior producer and writer for TV, radio, and digital media leading teams of anchors, reporters, and editors in creating news broadcasts, covering some of the most notable news stories of the time.\nBloomberg / Contributor / Getty Images\nMajor U.S. indexes were mixed at midday Monday to start the holiday-shortened trading week . The markets will close early Tuesday for Christmas Eve, and remain closed on Christmas. The Dow was lower, while the S&P 500 and Nasdaq gained.\nChip stocks advanced, led by Broadcom ( AVGO ) after UBS analysts raised their price target for the stock, citing the chipmaker's artificial intelligence (AI) revenue growth. Advanced Micro Devices ( AMD ) shares also surged after Rosenblatt analysts called it a \"top pick\" on its AI-driven potential.\nTesla ( TSLA ) shares gained after Barclays analysts suggested the electric vehicle (EV) manufacturer could report better-than-expected deliveries for the fourth quarter.\nShares of Xerox Holdings ( XRX ) rose after the office products maker purchased rival Lexmark International for $1.5 billion .\nShares of sleep apnea machine maker ResMed ( RMD ) slumped after the Food and Drug Administration (FDA) approved Eli Lilly’s ( LLY ) weight-loss treatment Zepbound to treat some sleep apnea patients . Eli Lilly shares climbed.\nShares of Nordstrom ( JWN ) fell after the retailer announced it is being taken private by its founding family and a Mexican retail group.\nOil and gold futures fell. The yield on the 10-year Treasury note was up. The U.S. dollar was higher versus the euro, pound, and yen. Prices for most major cryptocurrencies were lower.\nTradingView"
    },
    {
      "url": "https://www.investopedia.com/dow-jones-today-12232024-8765703",
      "url_mobile": "",
      "title": "Dow Jones Today : Stocks Slip To Start Holiday - Shortened Week ; Honda Soars on Merger Plans",
      "seendate": "20241223T160000Z",
      "socialimage": "https://www.investopedia.com/thmb/TNTsdR0xPn0lQae59esdG8FGZQw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/MarketBlogImage-final-6ac06c7b9250446a8e86c566b11e02e1.png",
      "domain": "investopedia.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 9,
      "recency_weight": 0.5,
      "content": "Colin is an Associate Editor focused on tech and financial news. He has more than three years of experience editing, proofreading, and fact-checking content on current financial events and politics. He received his M.A. in journalism from The New School and his B.A. in history and political science from McGill University.\nJulie Bang / Investopedia\nU.S. stocks recovered from a shaky morning to close Monday in the green, starting a holiday-shortened week off on a positive note.\nThe Nasdaq Composite gained 1%, while the S&P 500 rose 0.7% and the Dow Jones Industrial Average, in the red most of the day, ticked up 0.2%.\nDespite rallying Friday, all three indexes lost ground last week after the Federal Reserve scaled back its forecast for future interest rate cuts. It was the Dow's third consecutive weekly decline and the S&P 500's second. The resultant sell-off snapped a four-week winning streak for the Nasdaq Composite.\nChip stocks advanced, led by Broadcom ( AVGO ), which climbed 5% after analysts at UBS raised their price target following strong quarterly results earlier this month. Nvidia ( NVDA ), which rose more than 3%, led Magnificent Seven stocks higher. Tesla ( TSLA ), Meta ( META ), and Alphabet ( GOOG )( GOOGL ) each gained about 2%, while Amazon ( AMZN ) and Apple ( AAPL ) posted smaller gains. Microsoft ( MSFT ) was the sole decliner, dipping 0.3%.\nEli Lilly ( LLY ) shares added nearly 4% after federal regulators approved its Zepbound weight-loss drug Zepbound to treat sleep apnea. Shares of Palantir ( PLTR ) ticked up 0.2% on the defense contractor's first day as a component of the Nasdaq 100. MicroStrategy ( MSTR ), another new addition to the index, tumbled nearly 9% alongside the price of Bitcoin.\nThe economic and corporate calendars are light this week . Data released Monday morning showed consumer confidence pulled back in December, while new home sales fell short of expectations in November. The stock market will close at 1 p.m. ET on Tuesday and remain closed Wednesday. Regular trading resumes on Thursday morning.\nTreasury yields continued to tick up on Monday after surging last week after the Fed's interest rate forecast. The 10-year Treasury yield rose above 4.6% for the first time since May before retreating to about 4.59%.\nBitcoin slid to about $94,000 after slumping below the $100,000 mark last week. The dollar, trading at its highest level since 2022, advanced against most major currencies. Gold futures fell to about $2,630 an ounce, while oil rebounded from earlier losses to trade around $69.50.\nBiggest S&P 500 Movers on Monday\nAdvancers:\nDecliners:\n- Michael Bromberg\nPalantir, MicroStrategy, Axon Stocks Struggle on First Day in Nasdaq 100\nIt hasn't been a great kickoff for the newest members of the Nasdaq 100 Index .\nShares of Palantir Technologies ( PLTR ), MicroStrategy ( MSTR ), and Axon Enterprise ( AXON ) all wavered on their first day in the prestigious index. Palantir stock was flat late in the session, while Axon Enterprises shares traded 1% lower. MicroStrategy slumped more than 8%.\nAlso weighing on MicroStrategy shares was the price of Bitcoin, which the company disclosed in a regulatory filing it bought more of last week. The largest corporate holder of the cryptocurrency bought 5,262 bitcoins at an average price of $106,662, close to the cryptocurrency's all-time high.\nThe price of Bitcoin slumped to about $93,000 on Monday.\nDespite each stock's struggles on Monday, shares of Palantir Technologies and MicroStrategy have skyrocketed 360% and 445%, respectively, this year, while Axon Enterprise shares have jumped 140%.\n- Bill McColl\nWhere Analysts Think Bitcoin Is Headed in 2025\nBitcoin ( BTCUSD ) has had a strong 2024, climbing above $100,000 as a confluence of factors drove up investor confidence in the leading cryptocurrency.\nWhile the Federal Reserve's interest rate outlook shook crypto markets last week, some analysts remain bullish on the cryptocurrency—but warn of volatility ahead.\nPrior to the Fed meeting shock, digital asset manager Bitwise's predictions for 2025 pegged bitcoin rising above $200,000 for the first time. That number rises to $500,000 if the federal government adopts Senator Cynthia Lummis' plan of buying 1 million bitcoin for a \"strategic bitcoin reserve.\"\nStandard Chartered analysts have a similar price expectation for bitcoin, and align with Bitwise on projecting that inflows for spot bitcoin ETFs in 2025 will remain similar to levels seen this year. So far this year, bitcoin ETFs have seen net inflows of more than $36 billion, according to data from Farside Investors.\nAnalysts are VanEck are also bullish, but less so. They expect bitcoin prices to reach a high of $180,000 in 2025 with volatility galore. They see bitcoin prices falling by roughly a third (30%) after touching new highs earlier in the year, followed by a period of consolidation during the summer before a peak toward year-end.\nAs of Monday afternoon, bitcoin traded at about $93,000.\n- Kyle Torpey\nTop Stock Movers Now\nChip stocks advanced, led by Broadcom ( AVGO ) after UBS analysts raised their price target for the stock, citing the chipmaker's artificial intelligence (AI) revenue growth. Advanced Micro Devices ( AMD ) shares also surged after Rosenblatt analysts called it a \"top pick\" on its AI-driven potential.\nTesla ( TSLA ) shares gained after Barclays analysts suggested the electric vehicle (EV) manufacturer could report better-than-expected deliveries for the fourth quarter.\nShares of Xerox Holdings ( XRX ) rose after the office products maker purchased rival Lexmark International for $1.5 billion .\nShares of sleep apnea machine maker ResMed ( RMD ) slumped after the Food and Drug Administration (FDA) approved Eli Lilly’s ( LLY ) weight-loss treatment Zepbound to treat some sleep apnea patients . Eli Lilly shares climbed.\nShares of Nordstrom ( JWN ) fell after the retailer announced it's being taken private by its founding family and a Mexican retail group.\n- Bill McColl\nXerox Stock Soars on $1.5B Acquisition of Printer Maker Lexmark\nXerox Holdings ( XRX ) shares jumped nearly 7% intraday trading Monday after the office products maker announced that it was buying privately held Lexmark International from its Chinese owners for $1.5 billion to address the increased number of workers with flexible schedules. The company also slashed its dividend in half to help pay the costs.\nThe company said the deal would \"strengthen the Xerox core print portfolio and build a broader global print and managed print services business better suited to meet the evolving needs of clients in the hybrid workplace.\"\nXerox added that the purchase will also assist the company in serving clients in the growing A4 color market, as well as boost its reach in the Asia-Pacific (APAC) region.\nThe transaction is expected to close in the second half of 2025.\nDespite today's gains, shares of Xerox Holdings are down 50% this year.\n- Bill McColl\nEli Lilly Rises on FDA Approval of Weight-Loss Drug Zepbound for Sleep Apnea\nEli Lilly's ( LLY ) Zepbound has received Food and Drug Administration (FDA) approval as a treatment for obstructive sleep apnea for adults with obesity, the drugmaker announced late Friday.\nThe approval comes after several trials earlier this year that showed the tirzepatide-based drug is five times more effective than a placebo at reducing breathing disruptions caused by obstructive sleep apnea (OSA) and in 50% of cases, completely preventing them.\n\"Nearly half of clinical trial patients saw such improvements that they no longer had symptoms associated with OSA, marking a critical step forward in reducing the burden of this disease and its interconnected health challenges,\" Jonsson said.\nZepbound got FDA approval to treat obesity and weight loss in November 2023 , joining Eli Lilly's other tirzepatide-based drug, Mounjaro. The two drugs, along with Novo Nordisk's ( NVO ) Ozempic and Wegovy , have captured the majority of a surging weight-loss market that has grown substantially in recent years.\nEli Lilly shares were up more than 2% in midday trading Monday, having gained about 34% on the year. Shares of ResMed ( RMD ), a medical device company that makes much of its revenue through the sale of sleep apnea masks, were 4% lower on Monday and have been negatively affected previously by the sleep apnea trials for Zepbound.\n- Aaron McDade\nRumble Stock Soars After Video Platform Gets $775M Investment From Tether\nRumble ( RUM ) shares skyrocketed Monday morning after the video platform received a $775 million investment from Tether, operator of a cryptocurrency platform and creator of the stablecoin of the same name.\nRumble announced that Tether had purchased 103.3 million shares of Rumble for $7.50 each. It noted that the transaction would not change the status of Chief Executive Officer (CEO) Chris Pavlovski as the firm's majority stakeholder. The transaction is expected to close in the first quarter of 2025.\nThe company said it will use $250 million of the proceeds to \"support growth initiatives and the remaining proceeds to fund a self tender offer for up to 70 million of its Class A Common Stock, at the same price.\"\nOppenheimer wrote in a note to clients that for Rumble, the deal \"should alleviate investor concerns related to liquidity\" ahead of positive free cash flow . It has a \"perform\" rating on the stock.\nShares of Rumble were up 80% Monday morning at $13.20, their highest level since November 2022.\n- Bill McColl\nHonda Stock Surges as Automaker Plans To Merge With Nissan in 2026\nHonda's ( HMC ) U.S.-listed shares popped Monday morning after the Japanese automaker and Nissan announced the signing of a memorandum of understanding (MOU) outlining their plans to merge in 2026.\nThe automakers plan to finalize the terms over the next several months and announce a definitive agreement in June 2025. A combined entity is expected to be listed on the Tokyo Stock Exchange in August 2026, the companies said.\nHonda also announced a plan to buy back up to 1.1 trillion Japanese yen ($7 billion) worth of the automaker's own stock over the next calendar year, replacing a 100 billion yen ($636.3 million) plan announced last month.\nJapanese regulators have not explicitly spoken about the Honda-Nissan deal, but Yoji Muto, head of the Ministry of Economy, Trade and Industry, said last Friday that the government \"should take a favorable view when companies cooperate to strengthen their competitiveness,\" The Wall Street Journal reported.\nHonda's U.S.-listed shares soared 13% in early trading Monday after entering the day down about 23% this year.\n- Aaron McDade\nStock Futures Mixed To Start Holiday-Shortened Week\nFutures contracts connected to the Dow Jones Industrial Average traded 0.5% lower in premarket trading on Monday.\nS&P 500 futures were off 0.2%.\nNasdaq 100 futures were barely hanging onto gains shortly before markets opened.\nMicroStrategy. \" FORM 8-K .\"\nBitwise. \" The Year Ahead: 10 Crypto Predictions for 2025 .\"\nCynthia Lummis Senator for Wyoming. \" Lummis Introduces Strategic Bitcoin Reserve Legislation .\"\nFarside Investors. \" Bitcoin ETF Flow – All Data (US$m) .\"\nVanEck. \" VanEck’s 10 Crypto Predictions for 2025 .\"\nXerox Holdings. \" Xerox to Acquire Lexmark .\"\nEli Lilly. \" FDA Approves Zepbound® (Tirzepatide) as the First and Only Prescription Medicine for Moderate-to-Severe Obstructive Sleep Apnea in Adults with Obesity .\"\nRumble. \" Rumble Announces $775 Million Strategic Investment from Tether .\"\nHonda. \" Nissan and Honda sign MOU to consider business integration .\"\nHonda. \" Notice Concerning Status and Suspension of Acquisition of the Company’s Own Shares and Determination of Matters Related to the Acquisition of Own Shares .\"\nThe Wall Street Journal. \" Honda, Nissan Plan to Create World’s No. 3 Automaker in 2026 Merger .\""
    },
    {
      "url": "https://www.investors.com:443/news/technology/eli-lilly-weight-loss-drug-obstructive-sleep-apnea-resmed-cpap/",
      "url_mobile": "",
      "title": "Eli Lilly Weight - Loss Drug Wins Approval In Sleep Apnea ; Will ResMed Feel The Heat ? ",
      "seendate": "20241221T003000Z",
      "socialimage": "https://www.investors.com/wp-content/uploads/2024/09/Stock-EliLilly-building-04-shutt.jpg",
      "domain": "investors.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 11,
      "recency_weight": 0.5,
      "content": "Eli Lilly (LLY) gained Food and Drug Administration approval late Friday for its weight-loss drug, Zepbound, as a treatment for obstructive sleep apnea. Obstructive sleep apnea, also called sleep suffocation, occurs when the upper airway repeatedly narrows or closes during sleep. This stops or reduces airflow. Patients typically wear a continuous positive airway pressure device, or CPAP. In testing, Zepbound…"
    },
    {
      "url": "https://www.fool.com/investing/2024/12/20/novo-nordisk-destroyed-lilly-and-viking-stocks-up/?source=iedfolrf0000001",
      "url_mobile": "",
      "title": "Why Novo Nordisk Stock Got Destroyed Today , but Eli Lilly and Viking Stocks Are Up",
      "seendate": "20241220T174500Z",
      "socialimage": "https://g.foolcdn.com/editorial/images/801777/package-of-weight-loss-drug-next-to-a-barbell.jpg",
      "domain": "fool.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 12,
      "recency_weight": 0.5,
      "content": null
    },
    {
      "url": "https://www.theglobeandmail.com/investing/markets/inside-the-market/article-market-movers-stocks-seeing-action-on-friday-december-20-and-why/",
      "url_mobile": "",
      "title": "Market movers : Stocks seeing action on Friday - and why",
      "seendate": "20241220T151500Z",
      "socialimage": "https://www.theglobeandmail.com/resizer/v2/MQVSCY5AZNECDMIRHE5JYMUSZM.JPG?auth=e538c83dcd0c2e016513c03088431c391028e6fa8141c28b2ad326514995a483&quality=80&smart=true",
      "domain": "theglobeandmail.com",
      "language": "English",
      "sourcecountry": "Canada",
      "coverage_count": 1,
      "days_ago": 12,
      "recency_weight": 0.5,
      "content": "A survey of North American equities heading in both directions\nShares of BlackBerry Ltd. ( BB-T ) surged over 23 per cent after it reported better-than-expected quarterly earnings Thursday, days after announcing it was unloading a money-losing, declining cybersecurity business at a steep loss.\nThe Waterloo, Ont., software company said it generated US$162-million in revenue in its fiscal third quarter ended Nov. 30, well above analyst expectations of US$151-million, driven by better-than-expected results in both its cybersecurity and connected-car software units. The company’s adjusted operating earnings for the quarter were US$23-million, significantly higher than analyst expectations in the mid-single digits millions.\nFriday's upgrades and downgrades: A TD Cowen analyst raised his rating for BlackBerry\nBlackBerry’s net loss was US$11-million, or 2 cents a share, an improvement from a US$21-million loss in the same period a year earlier.\nExcluding the US$23-million in quarterly losses from the Cylance cybersecurity unit that it is selling, the company generated a US$12-million profit.\nOperating cash flows came in at US$3-million; analysts had expected that to be negative.\n“BlackBerry achieved a significant inflection in its results this past quarter,” CEO John Giamatteo said in a release.\nThe company also forecast that it would generate US$126-million to US$135-million during its fourth quarter from its non-Cylance businesses, and operating earnings of US$10-million to US$12-million.\n“This is a significant shift in the profitability of this company,” chief financial officer Tim Foote said on a conference call with analysts.\nBlackBerry said Monday it had sold Cylance to Arctic Wolf Networks Inc., for US$120-million in cash and 5.5 million of the privately held buyer’s common shares. The value of the deal is difficult to estimate, but is clearly a fraction of the US$1.4-billion that BlackBerry paid for the money-losing business six years ago in what was supposed to be the signature deal of former CEO John Chen as part of his plan to pivot the company further into software after its complete exit from the smartphone business.\n- Sean Silcoff\nCAE Inc. ( CAE-T ) was higher by 4 per cent after activist investor Browning West announced it has built a 4.3-per-cent stake , pushing to have a say in hiring the flight simulator maker’s new top boss.\nCAE had said in November its current CEO Marc Parent would leave the Canadian firm after 15 years.\n“We urge the Board not to act hastily in its CEO search, but rather to engage with us to collectively recruit the best possible leader,” Browning West said.\nThe aviation training specialist’s shares have fallen by about 4 per cent in the past five years, underperforming the S&P/TSX Composite Index which has risen roughly 43 per cent in the same period.\nBrowning said while it “admired CAE’s business and its enviable market position”, the company’s stock has fallen short of expectations.\nThe Montreal-based company also reported a lower second-quarter profit, as supply chain challenges continued to affect the firm.\nFormed in 2019, Browning West is an investment firm based in Los Angeles, California and was most recently involved with Canadian apparel maker Gildan and bringing its former CEO back .\nIn a research note, Desjardins Securities analyst Benoit Poirier said: “We view the emergence of this new activist shareholder as a positive development for CAE investors. In our view, Browning is an ideal partner in the upcoming CEO search given its successful Gildan campaign, deep knowledge of the Canadian investor base (in relation to its wants and preferences), as well as its familiarity in dealing with a Québec-based company.\n“Our sense after analyzing the letter is that Browning will most likely try to target an external executive with US A&D experience (eg LHX, LMT, NOC, RTX) or a solid industrial sector capital allocation background (it mentioned “a proven CEO with a verifiable track record of value creation”). This is exactly what the market wants and having an active investor like Browning involved in the process would significantly derisk the CEO and CFO selections, in our view. We would not be surprised if it has already identified potential CEO candidates or board members to strengthen the company. Lastly, we would not rule out the potential that Browning could influence the board to monetize CAE’s defence business down the line, which could also be another positive catalyst—ultimately, we believe CAE would trade at a higher multiple if it were a pure-play civil and bizjet training busine\nCarnival Corp. ( CCL-N ) forecast strong bookings for 2025 ahead of the busy summer season as Americans remained eager to spend on experiences even as ticket prices increased, sending its shares up 6.4 per cent.\nThe resilient demand for cruise vacations also helped Carnival post better-than-expected profit and sales for the fourth quarter, but the company forecast annual profit below estimates due to rising input costs and advertising spending.\nAdjusted cruise costs, excluding fuel, increased 7.4 per cent from 2023 but were better than the firm’s projections of about 8%, announced in September.\n“2025 is shaping up to be another banner year, with yield growth expected to far outpace historical growth rates and again exceed unit cost growth,” CEO Josh Weinstein said in a statement.\nOn a constant currency basis, Carnival’s cumulative advanced booked position for next year is at an all-time high for occupancy and price, with both surpassing 2024 in all four quarters of 2025.\nThe Miami, Florida-based company reported quarterly revenue of US$5.94-billion, compared with analysts’ estimates of US$5.93-billion, per data compiled by LSEG.\nIts adjusted profit for the quarter was 14 US cents per share, above estimates of 8 US cents.\nCarnival plans to roll out heavier promotions in the run up to the deal-heavy wave season, which starts right after winter holidays and lasts till the end of March.\nThe higher promotional expenses as well as maintenance costs due to increased dry dock days led the company to forecast annual profit of US$1.70 per share, below estimates of US$1.74.\nNike ( NKE-N ) fell 0.2 per cent in the wake of offering a muted forecast on Thursday, reversing gains in its shares made earlier in the day after the embattled sportswear seller’s quarterly results beat estimates.\nThe Beaverton, Oregon-based sportswear company, which has been scrambling to regain market dominance in the face of intensifying competition, predicted revenue would fall by low double-digits in the third quarter.\nAnalysts, on average, had expected revenue to fall 7.65 per cent to US$11.48-billion for the current quarter, according to data compiled by LSEG.\nNew CEO Elliott Hill said Nike’s efforts to regain lost market share would mean some short-term pain. The company had “lost its obsession with sport,” he said in his first earnings call since taking the helm in October.\nMr. Hill vowed to put Nike back on track by refocusing its business on sport and selling more items at premium prices, but added “the shift’s gonna take time.”\nEarlier in the day, Nike reported earnings per share of 78 US cents, compared with estimates of 63 US cents per share, according to analysts’ estimates compiled by LSEG.\nSecond-quarter net revenue fell 7.7 per cent to US$12.35-billion, less than the 9.41-per-cent fall analysts had expected, as newer versions of performance and running shoes attracted shoppers.\nShares surged 11 per cent immediately after the earnings report but gave up those gains after Mr. Hill and CFO Matthew Friend reined in expectations. So far this year, Nike shares have slumped nearly 30 per cent.\n“If you really look at (second quarter earnings), the numbers are not good. ... but it’s better than most people feared,” said Jane Hali & Associates senior analyst Jessica Ramirez.\nFedEx ’s ( FDX-N ) decision to spin off its freight truckload segment will strengthen the business while allowing the parcel delivery giant to better tackle challenges in its core operations, analysts said on Friday.\nShares finished narrowly lower as the bellwether for global trade trimmed its annual profit forecast.\nFedEx Freight, the largest U.S. provider of less-than-truckload (LTL) services, could be valued between US$30-billion and US$35-billion, as per an estimate from Citi.\n“The decision to proceed with a full separation of the LTL segment has the potential to unlock significant value and is a welcomed holiday gift to FDX shareholders,” BMO Capital Markets analyst Fadi Chamoun wrote in a note on Friday.\nAnalysts have long argued that Freight was undervalued within FedEx, which has been slashing expenses and consolidating its express and ground operations in recent quarters.\nFedEx disclosed in June it was weighing options for the LTL business, which involves carrying multiple shipments from different customers on a single truck.\nThe spin-off will be completed within 18 months, which some analysts say will allow FedEx to cut risks and separate the business when freight demand is favorable.\nThe move will allow FedEx to sharpen its focus on addressing the impact of soft industrial shipping demand and a shift away from higher-priced deliveries among customers.\nFedEx also faces a US$500-million hit from the loss of the United States Postal Service, its largest customer, earlier this year.\nIts shares have risen 9.1 per cent this year, underperforming the S&P 500 index but better than rival UPS’ ( UPS-N ) 22-per-cent slump.\nShares of Reitmans (Canada) Ltd . ( RET-A-X ) fell 2.4 per cent on Friday after the Montreal-based retailer reported a drop in revenues and earnings for its third quarter ended Nov. 2, citing “unfavourably warm autumn weather” that delayed sales and a lower store count compared to the same period last year.\nIn its earnings report released after markets closed on Thursday, the retailer behind its namesake brand, Penningtons and RW&CO, also said its gross margin rate increased due to strong inventory control and fewer promotions.\nNet revenues came in at $187.7-million down 2.9 per cent from $193.4-million in the third quarter last year that ended on Oct. 28. Comparable sales, including e-commerce revenues, decreased 1.9 per cent year over year, despite increased sales dollar per transaction, the company said.\nNet earnings decreased to $2.1-million or 4 cents per share, down from net earnings of $5.3-million or 11 cents per share for the same quarter last year.\nReitmans said adjusted earnings before interest, taxes, depreciation and amortization fell 60 per cent to $3.8-million compared to $9.5-million last year, citing mainly higher occupancy costs and foreign exchange losses.\n- Brenda Bouw\nCalgary-based STEP Energy Services Ltd. ( STEP-T ) dropped 14.9 per cent on the premarket announcement that it has entered a mutual agreement to terminate its take-private deal with ARC Financial Corp.\nIt said the decision was made after it became clear that the requisite minority shareholder approval could not be achieved.\n“We do not expect a full roundtrip back into the mid-$3.00/share range (where STEP traded immediately prior to the transaction announcement in early-November), but we do expect the stock to be under some pressure at the open,” said Raymond James analyst Michael Barth in a release. “Even still, our target (despite being revised modestly lower) remains above the proposed transaction price and where STEP last traded. We reiterate our Outperform rating and would be buyers on any material weakness.”\n“We’ve long thought that it would make sense for STEP to be taken out by one of the frac competitors in Western Canada, specifically TCW. We still think that. The bigger question is what price ARC would be willing to entertain for a transaction (and they clearly left the door open in this last proposal for another bidder to emerge). The fact that no other bidder actually emerged tells us that the bid/ask was too wide. At the same time, we know that ARC can’t hold their stake in STEP forever (fund maturities, and all that jazz), their own takeout proposal was voted down, and for whatever reason ARC can’t/won’t pay more than $5.00/share. We have to think that the ARC ask will gradually drift lower on the back of these events, and it wouldn’t surprise us to see a corporate take STEP out in the next 12 months. Even with lower Adj. EBITDA expectations at STEP, we think the accretion math still works more than $5.00/share for potential bidders like TCW.”\nNovo Nordisk ( NVO-N ) plummeted 17.8 per cent after it revealed disappointing results in a late-stage trial for its experimental next-generation obesity drug CagriSema.\nThe lower-than-expected weight loss from the drug candidate deals a blow to the Danish company’s ambitions for a successor to its Wegovy weight-loss drug that is more powerful than Eli Lilly’s ( LLY-N ) rival Zepbound, also known as Mounjaro.\nInvestors and analysts had eagerly awaited this data as a test of Novo’s case that it has a strong pipeline of drugs to follow Wegovy in the fiercely competitive anti-obesity market.\nThe CagriSema trial showed the drug helped patients cut their weight by 22.7 per cent, below the 25-per-cent Novo Nordisk had expected.\nNovo’s European share price fell as much as 27 per cent after the results were announced, hitting their lowest since August 2023 in one of the biggest one-day wipe outs on record for a European company.\nShares in U.S. rival Lilly rose on the news.\nNovo said if all people adhered to treatment with CagriSema, patients overall achieved weight loss of 22.7 per cent after 68 weeks, with 40.4 per cent losing 25 per cent or more.\nThe results are a “worst case-scenario” for Novo, said Markus Manns, portfolio manager at mutual funds firm Union Investment, a Novo and Lilly shareholder.\n“CagrisSema is only as good as Zepbound, but more complex to manufacture,” he said.\nTrump Media & Technology ’s shares ( DJT-Q ) fell 2 per cent on Friday after U.S. President-elect Donald Trump moved the stake he owns in the social media company to a revocable trust.\nThe move comes after Trump said in November that he had no intention of selling his shares in the company, which owns the Truth Social media platform.\nTrump transferred 114.75 million shares, or 53 per cent of Trump Media & Technology Group’s outstanding stock, to the revocable trust of which he is the sole beneficiary, according to securities filings.\nHis stake in the company was valued at more than US$4-billion based on the stock’s last closing price of U$35.41.\nStarbucks Corp. ( SBUX-Q ) was lower by 0.9 per cent after the workers’ union representing over 10,000 baristas said its members will strike at stores in Los Angeles, Chicago, and Seattle for five days starting Friday, citing unresolved issues over wages, staffing and schedules.\nThis is the latest in a series of labor actions that have picked up pace across service industries following a period when workers at manufacturers in the automotive, aerospace and rail industries won substantial concessions from employers.\nAmazon workers at seven U.S. facilities walked off the job on Thursday during the holiday shopping rush.\nThere were 33 work stoppages in 2023, the most since 2000, though far lower than in past decades, data from the U.S. Bureau of Labor Statistics showed.\nAt Starbucks, the Workers United union, which represents employees at 525 stores across the U.S., said late on Thursday that walkouts would escalate daily, and could reach “hundreds of stores” nationwide by Christmas Eve.\nNegotiations between the company and Workers United began in April, based on an established framework agreed upon in February, which could also help resolve numerous pending legal disputes.\nThe company said on Thursday it has held more than nine bargaining sessions with the union since April, and reached more than 30 agreements on “hundreds of topics”, including economic issues.\nThe Seattle-headquartered firm said it is ready to continue negotiations, claiming the union delegates prematurely ended the bargaining session this week.\nWith files from staff and wires"
    },
    {
      "url": "https://www.forbes.com/sites/investor-hub/article/best-growth-stocks/",
      "url_mobile": "",
      "title": "7 Best Growth Stocks To Buy In 2025",
      "seendate": "20241219T224500Z",
      "socialimage": "https://imageio.forbes.com/specials-images/imageserve/6764980138ebbe607be3c982/0x0.jpg?format=jpg&fit=bounds",
      "domain": "forbes.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 13,
      "recency_weight": 0.5,
      "content": "By Catherine Brock ,\nContributor.\nIf increasing net worth is on your list of 2025 resolutions, re-evaluating your growth stock portfolio may be the first action item. You can fill the gaps with companies that have proven growth track records and strong outlooks. Seven promising stocks to consider are introduced below.\nGrowth stocks are equity shares likely to outperform their peers and the broader market. Outperformance can happen when a company successfully delivers an innovative solution to a sizable audience.\nCompanies that unlock this growth puzzle tend to keep doing it. To be clear, past growth performance does not guarantee future success. But it does show a leadership team's ability to see big opportunities, implement solutions and create value.\nFor that reason, my screening criteria for growth stocks includes historic growth metrics and future performance expectations:\nMuch more than breaking news, our diverse reporting digs deeper with unparalleled insights that empower you to make better informed decisions. Become a Forbes member and get unlimited access to cutting-edge strategies, actionable insights, and updated analysis from our network of leading finance experts. Unlock Premium Access — Free For 25 Days .\nThe table below shows seven top growth stocks that meet the above parameters.\nTable data source: Stockanalysis.com.\nLet's take a closer look at each of these fast-growing companies. Data comes from company reports and Stockanalysis.com.\nEli Lilly is a drugmaker offering treatments for diabetes, weight loss , plaque psoriasis, anxiety, fibromyalgia and other conditions.\nEli Lilly has business momentum, thanks to Mounjaro and Zepbound, two formulations that treat diabetes and obesity, respectively. Both drugs are versions of the compound tirzepatide, a GLP-1 receptor agonist.\nGLP-1 drugs have been popular since competing product Ozempic became the weight-loss answer for Hollywood A-listers. Ozempic is technically a diabetes medication, but its maker Novo Nordisk markets a related product called Wegovy for weight loss. Demand for Ozempic, Wegovy and the Eli Lilly treatments have outpaced supply, causing shortages in the U.S.\nLilly is addressing the shortage by investing billions in production capacity. The company has also completed clinical trials showing its Zepbound treatment is more effective for weight loss than Wegovy.\nSince 2020, LLY's EPS has varied from $5.80 to $6.90. Analysts expect 2024 and 2025 EPS of $13.32 and $22.24, respectively.\nServiceNow offers a workflow automation platform for enterprise technology management. The platform is sold on a subscription basis to Fortune 500 companies and others.\nIn the third quarter of 2024, ServiceNow had subscription growth of 22.5%—beating the high end of the company's guidance. Customers are responding well to ServiceNow's AI-focused messaging. The company is positioning its Now platform as an essential AI-powered resource for digital transformation.\nThe company's investments in efficiency-enhancing generative AI features are also paying off. Examples include industry-targeted AI solutions for financial services, telecommunications and more. ServiceNow is also incorporating agenic AI into its platform. Agenic AI is an emerging AI innovation that can complete complex tasks, learn and make decisions without human intervention.\nAnalysts expect NOW to produce 2024 and 2025 EPS of $14.06 and $16.87, respectively. The company delivered $8.42 in EPS in 2023 and $1.60 in 2022.\nShopify manages and sells a commerce platform that customers use to manage inventory and sell products online and offline.\nShopify generates about $8 billion in annual revenue with a leading 28% market share in the e-commerce platform segment.\nLike ServiceNow, Shopify invests continually in platform features to enhance efficiency and productivity for customers. In Shopify's case, the customers range from solo entrepreneurs to big brands. Recent enhancements include the launch of generative AI to respond to customer queries and the expansion of sales tax management to the entire EU.\nThe company has a great growth track record, expanding sales from $1.5 billion in 2019 to $7 billion last year. Analysts expect EPS of $1.29 in 2024 and $1.54 in 2025, both sizable upticks from the $0.10 earned in 2023.\nDiscover more in-depth insights, entrepreneurial advice and winning strategies that can propel your journey forward and save you from making costly mistakes. Elevate your journey by becoming a Forbes member. Unlock Premium Access — Free For 25 Days .\nMercadoLibre manages the top e-commerce marketplace and one of the largest online payment platforms in Latin America.\nMELI is often called the \"Amazon of South America.\" Both companies operate dominant e-commerce marketplaces in their regions and have delivered strong returns to shareholders for a decade. MercadoLibre does not have a cloud computing business like Amazon, but it does have a popular digital payment solution, Mercado Pago.\nBetween 2019 and 2023, MercadoLibre grew annual revenues from $2.2 billion to more than $14.4 billion. The bottom line increased from a $3.71 loss per share to earnings of $19.47 per share, with steady operating margin growth along the way.\nAnalysts expect the growth pattern to continue. Strengthening economic conditions in Argentina is one reason for optimism. MercadoLibre has a strong position there in e-commerce and payments, with no formidable competitors. The 2024 and 2025 EPS predictions for MELI are $36.10 and $47.92, respectively.\nMonolithic Power Systems designs and sells power circuits that control voltage to servers, AI and storage applications, vehicle components, home appliances, communications infrastructure and more.\nMonolithic has revenue exposure to three transforming industries: automotive, AI and 5G. This positioning helped the company raise its stock price from about $384 in 2021 to a high of $940 last October.\nHowever, the MPWR stock price has since dipped to the $590s. The prompt was a report speculating that Nvidia canceled its backlogged orders of a Monolithic product due to performance issues. Monolithic denied the speculations, but investors have not been convinced.\nThe pullback may create an opportunity to buy this growing company. A Citi analyst thinks so. Analyst Kelsey Chia initiated coverage on MPWR with a buy rating and a price target of $700. Chia cited strength in AI and automotive, arguing that the opportunity available will outweigh any market share loss for Monolithic with Nvidia.\nAnalysts expect MPWR to produce 2024 EPS of $14.35, up from $8.76 in the prior year. The 2025 EPS outlook is $16.89.\nShift4 Payments provides integrated payment processing solutions to merchants in the U.S. and internationally.\nShift4 Payments has steadily grown sales from $731 million in 2019 to more than $3 billion in the 12 months before September 30, 2024. In the third quarter of 2024, the company produced record cash flow, signed new hospitality and gaming customers, expanded geographically and raised its full-year sales and Ebitda outlooks.\nWith strong sales, a $33 billion backlog and three acquisitions to integrate, Shift4 Payments has momentum. Acquisitions of POS companies Revel and Vectron expand the company's network of merchant customers, driving revenue and creating cross-sell opportunities.\nThose are a few reasons why analysts believe FOUR will produce EPS of $3.75 in 2024 and $4.71 in 2025—marking significant earnings improvement from $1.42 in 2023.\nCorcept Therapeutics develops treatments for metabolic, psychiatric and oncologic disorders. The company has one marketed product, a cortisol receptor blocker called Korlym. Corcept's pipeline includes Phase III and Phase IV treatments for Cushing's Syndrome and a Phase III treatment for ovarian cancer, among other things.\nKorlym has produced steadily growing revenue since 2019—including 48% revenue growth and 46% diluted net income per share growth in the third quarter of 2024.\nConditions look good for the growth to continue. The company recently announced positive results from the treatment phase of its Catalyst study: Korlym reached its primary endpoint in patients with Cushing's Syndrome and hard-to-control type 2 diabetes. An earlier phase of Catalyst showed Cushing's is more common than previously thought.\nCorcept has also seen positive clinical trial results from a Phase III study of relacorilant, another treatment for Cushing's Syndrome.\nThe EPS expectation for Corcept in 2024 is $1.39, which compares favorably to 2023 EPS of $0.94. For 2025, analysts believe the company will produce EPS of $1.79.\nYou can wish for a prosperous new year, but strategic actions may get you there quicker. Start by reviewing your growth stock portfolio and replacing the duds with companies poised to shine in 2025.\nWhether it’s mastering cutting-edge strategies, uncovering actionable investment opportunities from influential leaders, or breaking down complex topics, our in-depth journalism has you covered. Become a Forbes member and gain unlimited access to bold ideas shaking up industries, expert guides and practical investment advice that keeps you ahead of the market. Unlock Premium Access — Free For 25 Days ."
    },
    {
      "url": "https://finance.yahoo.com/news/15-billion-reasons-love-eli-144500454.html",
      "url_mobile": "",
      "title": "15 Billion Reasons to Love Eli Lilly Stock Right Now",
      "seendate": "20241219T023000Z",
      "socialimage": "https://s.yimg.com/ny/api/res/1.2/gLXzfYLOrAUPS3ZIvs4H.g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/motleyfool.com/28363e4e6e66b90ea587e677d4ecf691",
      "domain": "finance.yahoo.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 13,
      "recency_weight": 0.5,
      "content": null
    },
    {
      "url": "https://www.benzinga.com/trading-ideas/24/12/42561975/whos-next-to-join-tesla-broadcom-in-1-trillion-club-over-50-say-the-worlds-biggest-retailer",
      "url_mobile": "",
      "title": "Who Next To Join Tesla , Broadcom In $1 Trillion Club ? Over 50 % Say The World Biggest Retailer - Broadcom ( NASDAQ : AVGO ), JPMorgan Chase ( NYSE : JPM ) ",
      "seendate": "20241218T201500Z",
      "socialimage": "https://cdn.benzinga.com/files/images/story/2024/12/18/chart-investors-ai.png?&fit=crop",
      "domain": "benzinga.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 14,
      "recency_weight": 0.5,
      "content": "A newsletter built for market enthusiasts by market enthusiasts. Top stories, top movers, and trade ideas delivered to your inbox every weekday before and after the market closes.\nThe list of companies that have market capitalizations greater than $1 trillion continues to grow with Broadcom Inc (NASDAQ: AVGO ) recently joining the club after its quarterly financial results sparked a rally in shares.\nA Benzinga poll asks readers which company could be next to join the elusive club.\nWhat Happened: Less than two years ago, investors could count on one hand the number of companies that were valued at more than $1 trillion. That changed in May 2023 when NVIDIA Corporation (NASDAQ: NVDA ) became the sixth company in the club and ninth public company in history to be valued at more than $1 trillion.\nFast forward to December 2024 and there are now 10 companies valued at $1 trillion or more. Berkshire Hathaway Inc (NYSE: BRK ) (NYSE: BRK ) crossed the milestone earlier this year and currently hovers near it again, with a market capitalization of $983 billion.\nHere is the current list of members in the $1 trillion market capitalization club, according to Companiesmarketcap.com :\nBenzinga recently asked who will be the next company to join the club for the first time with Berkshire Hathaway left out due to its close proximity and the fact it had already been in the club.\n\"Following Broadcom, which company will join the $1 trillion club next?\" Benzinga asked.\nThe results were as follows along with the market caps at the time the poll was conducted:\nOver half of readers polled said they believe Walmart will be the next company to join the $1 trillion club for the first time, followed by Eli Lilly at around one fourth of readers.\nHere's a look at the current year-to-date and five-year returns of the four stocks featured in the poll:\nChart created using ChatGPT.\nThe chart above shows that while Walmart is the top gainer year-to-date, it is Eli Lilly that has the better five-year stock growth.\nRead Also: Nancy Pelosi Loads Up On More Nvidia Shares, Buys Broadcom Options\nMeta Platforms (NASDAQ: META ) is another company that was previously in the $1 trillion club years ago and rejoined the club earlier this year.\nIn August, Benzinga polled readers to ask which company they thought would hit the $1 trillion valuation next after Berkshire Hathaway joined.\nThe results were:\nThat poll was conducted when Eli Lilly and Taiwan Semiconductor both traded with market capitalizations of around $800 billion. Readers ended up being wrong with Eli Lilly still out of the club, while Taiwan Semiconductor, Tesla and Broadcom have all joined in recent months.\nRead Next:\nThe study was conducted by Benzinga from Dec. 16 through Dec. 17, 2024, and included the responses of a diverse population of adults 18 or older. Opting into the survey was completely voluntary, with no incentives offered to potential respondents. The study reflects results from 128 adults.\nImage created using artificial intelligence via Midjourney.\n© 2026 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\nWhy It's Important: Broadcom stock is up 28% over the last five days and up over 113% year-to-date. The company beat fourth-quarter analyst earnings per share, missed revenue estimates and provided guidance that was in-line. The guidance and positive outlook was enough to send shares higher and provide entry into the club.\nTesla Inc (NASDAQ: TSLA ), which was previously a member of the club, has rejoined the $1 trillion club thanks to impressive gains for the electric vehicle stock since Donald Trump won the 2024 presidential election."
    },
    {
      "url": "https://markets.businessinsider.com/news/stocks/eli-lilly-s-kisunla-approved-in-china-for-alzheimer-s-disease-treatment-1034148679",
      "url_mobile": "",
      "title": "Eli Lilly Kisunla approved in China for Alzheimer Disease treatment",
      "seendate": "20241218T061500Z",
      "socialimage": "",
      "domain": "markets.businessinsider.com",
      "language": "English",
      "sourcecountry": "United States",
      "coverage_count": 1,
      "days_ago": 14,
      "recency_weight": 0.5,
      "content": "The company states: “Eli Lilly ( LLY ) announced that the National Medical Products Administration in China has approved Kisunla, an Alzheimer’s treatment for adults with early symptomatic Alzheimer’s disease, which includes people with mild cognitive impairment, or MCI, as well as people with the mild dementia stage of Alzheimer’s disease who have confirmed amyloid pathology. China is the fourth major market in which Kisunla has been approved for use, following approvals in the United States, Japan and Great Britain. In China, it is estimated that nearly 6% of people over the age of 65 are living with Alzheimer’s disease and related dementias, with nearly 11% over the age of 65 expected to be living with Alzheimer’s disease by 2050. Among the two groups analyzed, participants treated with Kisunla had up to a 39% lower risk of progressing to the next clinical stage of disease than those taking placebo. Among the overall population of participants, Kisunla reduced amyloid plaques on average by 61% at 6 months, 80% at 12 months, and 84% at 18 months compared to the start of the study. One of the treatment goals of the study was to remove amyloid plaques to minimal levels consistent with a visually negative scan using amyloid positron emission tomography. If participants were confirmed to have reached these levels, they were able to complete treatment with Kisunla and switch to placebo for the remainder of the study. In the TRAILBLAZER-ALZ 2 study, 66% of patients achieved plaque clearance at one year.”\nPublished first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>>\nSee Insiders’ Hot Stocks on TipRanks >>\nRead More on LLY:"
    }
  ]
}